MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
        uint32_t RESERVED45;                         /*!< Reserved,                                                Address offset: 0x1148 */
  __IM  uint32_t DMACCARXDR;                         /*!< Channel  current application receive descriptor register,Address offset: 0x114C */
        uint32_t RESERVED46;                         /*!< Reserved,                                                Address offset: 0x1150 */
  __IM  uint32_t DMACCATXBR;                         /*!< Channel current application transmit buffer register,    Address offset: 0x1154 */
        uint32_t RESERVED47;                         /*!< Reserved,                                                Address offset: 0x1158 */
  __IM  uint32_t DMACCARXBR;                         /*!< Channel  current application receive buffer register,    Address offset: 0x115C */
  __IOM uint32_t DMACSR;                             /*!< Channel status register,                                 Address offset: 0x1160 */
  __IOM uint32_t DMACMFCR;                           /*!< Channel missed frame count register,                     Address offset: 0x1164 */
} ETH_TypeDef;

/**
  * @brief Ethernet DMA Channel Unit
  */
typedef struct
{
  __IOM uint32_t DMACXCR;         /*!< DMA Channel x control register                                 Address offset: 0x1100 + 0x80 * x, (x = 0) */
  __IOM uint32_t DMACXTXCR;       /*!< DMA Channel x transmit control register                        Address offset: 0x1104 + 0x80 * x, (x = 0) */
  __IOM uint32_t DMACXRXCR;       /*!< DMA Channel x receive control register                         Address offset: 0x1108 + 0x80 * x, (x = 0) */
        uint32_t RESERVED1[2];    /*!< Reserved                                                       Address offset: [0x110C-0x1110]            */
  __IOM uint32_t DMACXTXDLAR;     /*!< DMA Channel x T0 descriptor list address register              Address offset: 0x1114 + 0x80 * x, (x = 0) */
        uint32_t RESERVED2;       /*!< Reserved                                                       Address offset: 0x1118 + 0x80 * x, (x = 0) */
  __IOM uint32_t DMACXRXDLAR;     /*!< DMA Channel x R0 descriptor list address register              Address offset: 0x111C + 0x80 * x, (x = 0) */
  __IOM uint32_t DMACXTXDTPR;     /*!< DMA Channel x T0 descriptor tail pointer register              Address offset: 0x1120 + 0x80 * x, (x = 0) */
        uint32_t RESERVED3;       /*!< Reserved                                                       Address offset: 0x1124 + 0x80 * x, (x = 0) */
  __IOM uint32_t DMACXRXDTPR;     /*!< DMA Channel x R0 descriptor tail pointer register              Address offset: 0x1128 + 0x80 * x, (x = 0) */
  __IOM uint32_t DMACXTXRLR;      /*!< DMA Channel x T0 descriptor ring length register               Address offset: 0x112C + 0x80 * x, (x = 0) */
  __IOM uint32_t DMACXRXRLR;      /*!< DMA Channel x R0 descriptor ring length register               Address offset: 0x1130 + 0x80 * x, (x = 0) */
  __IOM uint32_t DMACXIER;        /*!< DMA Channel x interrupt enable register                        Address offset: 0x1134 + 0x80 * x, (x = 0) */
  __IOM uint32_t DMACXRXIWTR;     /*!< DMA Channel x R0 interrupt watchdog timer register             Address offset: 0x1138 + 0x80 * x, (x = 0) */
        uint32_t RESERVED4[2];    /*!< Reserved                                                       Address offset: [0x113C-0x1140]            */
  __IOM uint32_t DMACXCATXDR;     /*!< DMA Channel x current application transmit descriptor register Address offset: 0x1144 + 0x80 * x, (x = 0) */
        uint32_t RESERVED5;       /*!< Reserved                                                       Address offset: 0x1148 + 0x80 * x, (x = 0) */
  __IOM uint32_t DMACXCARXDR;     /*!< DMA Channel x current application receive descriptor register  Address offset: 0x114C + 0x80 * x, (x = 0) */
        uint32_t RESERVED6;       /*!< Reserved                                                       Address offset: 0x1150 + 0x80 * x, (x = 0) */
  __IOM uint32_t DMACXCATXBR;     /*!< DMA Channel x current application transmit buffer register     Address offset: 0x1154 + 0x80 * x, (x = 0) */
        uint32_t RESERVED7;       /*!< Reserved                                                       Address offset: 0x1158 + 0x80 * x, (x = 0) */
  __IOM uint32_t DMACXCARXBR;     /*!< DMA Channel x current application receive buffer register      Address offset: 0x115C + 0x80 * x, (x = 0) */
  __IOM uint32_t DMACXSR;         /*!< DMA Channel x status register                                  Address offset: 0x1160 + 0x80 * x, (x = 0) */
  __IOM uint32_t DMACXMFCR;       /*!< DMA Channel x missed frame count register                      Address offset: 0x1164 + 0x80 * x, (x = 0) */
        uint32_t RESERVED8[6];    /*!< Reserved                                                       Address offset: [0x1168-0x117C]            */
} ETH_DMA_Channel_TypeDef;

/**
  * @brief Ethernet MTL Queue Unit
  */
typedef struct
{
  __IOM uint32_t MTLTXQXOMR;      /*!< Tx queue x operating mode register                             Address offset: 0x0D00 + 0x40 * x, (x = 0)  */
  __IOM uint32_t MTLTXQXUR;       /*!< Tx queue x underflow register                                  Address offset: 0x0D04 + 0x40 * x, (x = 0)  */
  __IOM uint32_t MTLTXQXDR;       /*!< Tx queue x debug register                                      Address offset: 0x0D08 + 0x40 * x, (x = 0)  */
        uint32_t RESERVED1[8];    /*!< Reserved                                                       Address offset: [0x0D0C-0x0D28]             */
  __IOM uint32_t MTLQXICSR;       /*!< Queue x interrupt control status register                      Address offset: 0x0D2C + 0x40 * x, (x = 0)  */
  __IOM uint32_t MTLRXQXOMR;      /*!< Rx queue x operating mode register                             Address offset: 0x0D30 + 0x40 * x, (x = 0)  */
  __IOM uint32_t MTLRXQXMPOCR;    /*!< Rx queue x missed packet and overflow counter register         Address offset: 0x0D34 + 0x40 * x, (x = 0)  */
  __IOM uint32_t MTLRXQXDR;       /*!< Rx queue x debug register                                      Address offset: 0x0D38 + 0x40 * x, (x = 0)  */
  __IOM uint32_t RESERVED3;       /*!< Reserved                                                       Address offset: 0x0D3C + 0x40 * x, (x = 0)  */
} ETH_MTL_Queue_TypeDef;

/**
  * @brief Extended interrupts and event controller (EXTI)
  */
typedef struct
{
  __IOM uint32_t RTSR1;          /*!< EXTI Rising Trigger Selection Register 1,        Address offset:   0x000 */
  __IOM uint32_t FTSR1;          /*!< EXTI Falling Trigger Selection Register 1,       Address offset:   0x004 */
  __IOM uint32_t SWIER1;         /*!< EXTI Software Interrupt event Register 1,        Address offset:   0x008 */
  __IOM uint32_t RPR1;           /*!< EXTI Rising Pending Register 1,                  Address offset:   0x00C */
  __IOM uint32_t FPR1;           /*!< EXTI Falling Pending Register 1,                 Address offset:   0x010 */
        uint32_t RESERVED1;      /*!< Reserved,                                        Address offset:   0x014 */
  __IOM uint32_t PRIVCFGR1;      /*!< EXTI Privilege Configuration Register 1,         Address offset:   0x018 */
        uint32_t RESERVED2;      /*!< Reserved,                                        Address offset:   0x01C */
  __IOM uint32_t RTSR2;          /*!< EXTI Rising Trigger Selection Register 2,        Address offset:   0x020 */
  __IOM uint32_t FTSR2;          /*!< EXTI Falling Trigger Selection Register 2,       Address offset:   0x024 */
  __IOM uint32_t SWIER2;         /*!< EXTI Software Interrupt event Register 2,        Address offset:   0x028 */
  __IOM uint32_t RPR2;           /*!< EXTI Rising Pending Register 2,                  Address offset:   0x02C */
  __IOM uint32_t FPR2;           /*!< EXTI Falling Pending Register 2,                 Address offset:   0x030 */
        uint32_t RESERVED3;      /*!< Reserved,                                        Address offset:   0x034 */
  __IOM uint32_t PRIVCFGR2;      /*!< EXTI Privilege Configuration Register 2,         Address offset:   0x038 */
        uint32_t RESERVED4[9];   /*!< Reserved,                                        Address offset:   0x03C */
  __IOM uint32_t EXTICR[4];      /*!< EXIT External Interrupt Configuration Register,  Address offset:   0x060 */
        uint32_t RESERVED5[4];   /*!< Reserved,                                        Address offset:   0x070 */
  __IOM uint32_t IMR1;           /*!< EXTI Interrupt Mask Register 1,                  Address offset:   0x080 */
  __IOM uint32_t EMR1;           /*!< EXTI Event Mask Register 1,                      Address offset:   0x084 */
        uint32_t RESERVED6[2];   /*!< Reserved,                                        Address offset:   0x088 */
  __IOM uint32_t IMR2;           /*!< EXTI Interrupt Mask Register 2,                  Address offset:   0x090 */
  __IOM uint32_t EMR2;           /*!< EXTI Event Mask Register 2,                      Address offset:   0x094 */
} EXTI_TypeDef;

/**
  * @brief FD Controller Area Network
  */
typedef struct
{
  __IM  uint32_t CREL;         /*!< FDCAN Core Release register,                                     Address offset: 0x000 */
  __IM  uint32_t ENDN;         /*!< FDCAN Endian register,                                           Address offset: 0x004 */
        uint32_t RESERVED1;    /*!< Reserved,                                                                        0x008 */
  __IOM uint32_t DBTP;         /*!< FDCAN Data Bit Timing & Prescaler register,                      Address offset: 0x00C */
  __IOM uint32_t TEST;         /*!< FDCAN Test register,                                             Address offset: 0x010 */
  __IOM uint32_t RWD;          /*!< FDCAN RAM Watchdog register,                                     Address offset: 0x014 */
  __IOM uint32_t CCCR;         /*!< FDCAN CC Control register,                                       Address offset: 0x018 */
  __IOM uint32_t NBTP;         /*!< FDCAN Nominal Bit Timing & Prescaler register,                   Address offset: 0x01C */
  __IOM uint32_t TSCC;         /*!< FDCAN Timestamp Counter Configuration register,                  Address offset: 0x020 */
  __IOM uint32_t TSCV;         /*!< FDCAN Timestamp Counter Value register,                          Address offset: 0x024 */
  __IOM uint32_t TOCC;         /*!< FDCAN Timeout Counter Configuration register,                    Address offset: 0x028 */
  __IOM uint32_t TOCV;         /*!< FDCAN Timeout Counter Value register,                            Address offset: 0x02C */
        uint32_t RESERVED2[4]; /*!< Reserved,                                                                0x030 - 0x03C */
  __IM  uint32_t ECR;          /*!< FDCAN Error Counter register,                                    Address offset: 0x040 */
  __IM  uint32_t PSR;          /*!< FDCAN Protocol Status register,                                  Address offset: 0x044 */
  __IOM uint32_t TDCR;         /*!< FDCAN Transmitter Delay Compensation register,                   Address offset: 0x048 */
        uint32_t RESERVED3;    /*!< Reserved,                                                                        0x04C */
  __IOM uint32_t IR;           /*!< FDCAN Interrupt register,                                        Address offset: 0x050 */
  __IOM uint32_t IE;           /*!< FDCAN Interrupt Enable register,                                 Address offset: 0x054 */
  __IOM uint32_t ILS;          /*!< FDCAN Interrupt Line Select register,                            Address offset: 0x058 */
  __IOM uint32_t ILE;          /*!< FDCAN Interrupt Line Enable register,                            Address offset: 0x05C */
        uint32_t RESERVED4[8]; /*!< Reserved,                                                                0x060 - 0x07C */
  __IOM uint32_t RXGFC;        /*!< FDCAN Global Filter Configuration register,                      Address offset: 0x080 */
  __IOM uint32_t XIDAM;        /*!< FDCAN Extended ID AND Mask register,                             Address offset: 0x084 */
  __IM  uint32_t HPMS;         /*!< FDCAN High Priority Message Status register,                     Address offset: 0x088 */
        uint32_t RESERVED5;    /*!< Reserved,                                                                        0x08C */
  __IM  uint32_t RXF0S;        /*!< FDCAN Rx FIFO 0 Status register,                                 Address offset: 0x090 */
  __IOM uint32_t RXF0A;        /*!< FDCAN Rx FIFO 0 Acknowledge register,                            Address offset: 0x094 */
  __IM  uint32_t RXF1S;        /*!< FDCAN Rx FIFO 1 Status register,                                 Address offset: 0x098 */
  __IOM uint32_t RXF1A;        /*!< FDCAN Rx FIFO 1 Acknowledge register,                            Address offset: 0x09C */
        uint32_t RESERVED6[8]; /*!< Reserved,                                                                0x0A0 - 0x0BC */
  __IOM uint32_t TXBC;         /*!< FDCAN Tx Buffer Configuration register,                          Address offset: 0x0C0 */
  __IM  uint32_t TXFQS;        /*!< FDCAN Tx FIFO/Queue Status register,                             Address offset: 0x0C4 */
  __IM  uint32_t TXBRP;        /*!< FDCAN Tx Buffer Request Pending register,                        Address offset: 0x0C8 */
  __IOM uint32_t TXBAR;        /*!< FDCAN Tx Buffer Add Request register,                            Address offset: 0x0CC */
  __IOM uint32_t TXBCR;        /*!< FDCAN Tx Buffer Cancellation Request register,                   Address offset: 0x0D0 */
  __IM  uint32_t TXBTO;        /*!< FDCAN Tx Buffer Transmission Occurred register,                  Address offset: 0x0D4 */
  __IM  uint32_t TXBCF;        /*!< FDCAN Tx Buffer Cancellation Finished register,                  Address offset: 0x0D8 */
  __IOM uint32_t TXBTIE;       /*!< FDCAN Tx Buffer Transmission Interrupt Enable register,          Address offset: 0x0DC */
  __IOM uint32_t TXBCIE;       /*!< FDCAN Tx Buffer Cancellation Finished Interrupt Enable register, Address offset: 0x0E0 */
  __IM  uint32_t TXEFS;        /*!< FDCAN Tx Event FIFO Status register,                             Address offset: 0x0E4 */
  __IOM uint32_t TXEFA;        /*!< FDCAN Tx Event FIFO Acknowledge register,                        Address offset: 0x0E8 */
} FDCAN_GlobalTypeDef;

/**
  * @brief FD Controller Area Network Configuration
  */
typedef struct
{
  __IOM uint32_t CKDIV;        /*!< FDCAN clock divider register,                            Address offset: 0x100 + 0x000 */
} FDCAN_Config_TypeDef;

/**
  * @brief FLASH Registers
  */
typedef struct
{
  __IOM uint32_t ACR;             /*!< FLASH access control register,                           Address offset: 0x000 */
  __OM  uint32_t KEYR;            /*!< FLASH key register,                                      Address offset: 0x004 */
        uint32_t RESERVED1;       /*!< Reserved,                                                Address offset: 0x008 */
  __OM  uint32_t OPTKEYR;         /*!< FLASH option key register,                               Address offset: 0x00C */
        uint32_t RESERVED2[2];    /*!< Reserved,                                                Address offset: 0x010 */
  __IM  uint32_t OPSR;            /*!< FLASH operation status register,                         Address offset: 0x018 */
  __IOM uint32_t OPTCR;           /*!< FLASH option control register,                           Address offset: 0x01C */
  __IM  uint32_t SR;              /*!< FLASH status register,                                   Address offset: 0x020 */
        uint32_t RESERVED3;       /*!< Reserved,                                                Address offset: 0x024 */
  __IOM uint32_t CR;              /*!< FLASH control register,                                  Address offset: 0x028 */
        uint32_t RESERVED4;       /*!< Reserved,                                                Address offset: 0x02C */
  __OM  uint32_t CCR;             /*!< FLASH clear control register,                            Address offset: 0x030 */
        uint32_t RESERVED5[2];    /*!< Reserved,                                                Address offset: 0x034 */
  __IOM uint32_t PRIVCFGR;        /*!< FLASH privilege configuration register,                  Address offset: 0x03C */
        uint32_t RESERVED6[2];    /*!< Reserved,                                                Address offset: 0x040 */
  __IOM uint32_t HDPEXTR;         /*!< FLASH HDP extension register,                            Address offset: 0x048 */
        uint32_t RESERVED7;       /*!< Reserved,                                                Address offset: 0x04C */
  __IM  uint32_t OPTSR_CUR;       /*!< FLASH option status register,                            Address offset: 0x050 */
  __IOM uint32_t OPTSR_PRG;       /*!< FLASH option status register,                            Address offset: 0x054 */
        uint32_t RESERVED8[6];    /*!< Reserved,                                                Address offset: 0x058 */
  __IM  uint32_t OPTSR2_CUR;      /*!< FLASH option status register 2,                          Address offset: 0x070 */
  __IOM uint32_t OPTSR2_PRG;      /*!< FLASH option status register 2,                          Address offset: 0x074 */
        uint32_t RESERVED9[2];    /*!< Reserved,                                                Address offset: 0x078 */
  __IM  uint32_t BOOTR_CUR;       /*!< FLASH unique boot entry register,                        Address offset: 0x080 */
  __IOM uint32_t BOOTR_PRG;       /*!< FLASH unique boot entry address,                         Address offset: 0x084 */
        uint32_t RESERVED10[2];   /*!< Reserved,                                                Address offset: 0x088 */
  __IM  uint32_t OTPBLR_CUR;      /*!< FLASH OTP block lock,                                    Address offset: 0x090 */
  __IOM uint32_t OTPBLR_PRG;      /*!< FLASH OTP block lock,                                    Address offset: 0x094 */
  __IM  uint32_t BL_COM_CFG_CUR;  /*!< FLASH Bootloader interface selection,                    Address offset: 0x098 */
  __IOM uint32_t BL_COM_CFG_PRG;  /*!< FLASH Bootloader interface selection,                    Address offset: 0x09C */
        uint32_t RESERVED11;      /*!< Reserved,                                                Address offset: 0x0A0 */
  __OM  uint32_t OEMKEYR1_PRG;    /*!< FLASH OEM Key register 1,                                Address offset: 0x0A4 */
        uint32_t RESERVED12;      /*!< Reserved,                                                Address offset: 0x0A8 */
  __OM  uint32_t OEMKEYR2_PRG;    /*!< FLASH OEM Key register 2,                                Address offset: 0x0AC */
        uint32_t RESERVED13;      /*!< Reserved,                                                Address offset: 0x0B0 */
  __OM  uint32_t OEMKEYR3_PRG;    /*!< FLASH OEM Key register 3,                                Address offset: 0x0B4 */
        uint32_t RESERVED14;      /*!< Reserved,                                                Address offset: 0x0B8 */
  __OM  uint32_t OEMKEYR4_PRG;    /*!< FLASH OEM Key register 4,                                Address offset: 0x0BC */
        uint32_t RESERVED15;      /*!< Reserved,                                                Address offset: 0x0C0 */
  __OM  uint32_t BSKEYR_PRG;      /*!< FLASH Boundary Scan key register,                        Address offset: 0x0C4 */
        uint32_t RESERVED16[8];   /*!< Reserved,                                                Address offset: 0x0C8 */
  __IM  uint32_t WRP1R_CUR;       /*!< FLASH write page protection for bank1,                   Address offset: 0x0E8 */
  __IOM uint32_t WRP1R_PRG;       /*!< FLASH write page protection for bank1,                   Address offset: 0x0EC */
        uint32_t RESERVED17[2];   /*!< Reserved,                                                Address offset: 0x0F0 */
  __IM  uint32_t HDP1R_CUR;       /*!< FLASH HDP bank1 register,                                Address offset: 0x0F8 */
  __IOM uint32_t HDP1R_PRG;       /*!< FLASH HDP bank1 register,                                Address offset: 0x0FC */
  __IOM uint32_t ECCCORR;         /*!< FLASH ECC correction register,                           Address offset: 0x100 */
  __IOM uint32_t ECCDETR;         /*!< FLASH ECC detection register,                            Address offset: 0x104 */
  __IM  uint32_t ECCDR;           /*!< FLASH ECC data,                                          Address offset: 0x108 */
        uint32_t RESERVED18[55];  /*!< Reserved,                                                Address offset: 0x10C */
  __IM  uint32_t WRP2R_CUR;       /*!< FLASH write page protection for bank2,                   Address offset: 0x1E8 */
  __IOM uint32_t WRP2R_PRG;       /*!< FLASH write page protection for bank2,                   Address offset: 0x1EC */
        uint32_t RESERVED19[2];   /*!< Reserved,                                                Address offset: 0x1F0 */
  __IM  uint32_t HDP2R_CUR;       /*!< FLASH HDP bank2 register,                                Address offset: 0x1F8 */
  __IOM uint32_t HDP2R_PRG;       /*!< FLASH HDP bank2 register,                                Address offset: 0x1FC */
} FLASH_TypeDef;

/**
  * @brief General Purpose I/O (GPIO)
  */
typedef struct
{
  __IOM uint32_t MODER;           /*!< GPIO port mode register,                                 Address offset: 0x000 */
  __IOM uint32_t OTYPER;          /*!< GPIO port output type register,                          Address offset: 0x004 */
  __IOM uint32_t OSPEEDR;         /*!< GPIO port output speed register,                         Address offset: 0x008 */
  __IOM uint32_t PUPDR;           /*!< GPIO port pull-up/pull-down register,                    Address offset: 0x00C */
  __IM  uint32_t IDR;             /*!< GPIO port input data register,                           Address offset: 0x010 */
  __IOM uint32_t ODR;             /*!< GPIO port output data register,                          Address offset: 0x014 */
  __OM  uint32_t BSRR;            /*!< GPIO port bit set/reset register,                        Address offset: 0x018 */
  __IOM uint32_t LCKR;            /*!< GPIO port configuration lock register,                   Address offset: 0x01C */
  __IOM uint32_t AFR[2];          /*!< GPIO alternate function register,                        Address offset: 0x020 */
  __OM  uint32_t BRR;             /*!< GPIO port bit reset register,                            Address offset: 0x028 */
} GPIO_TypeDef;

/**
  * @brief Hash processor (HASH)
  */
typedef struct
{
  __IOM uint32_t CR;              /*!< HASH control register,                                   Address offset: 0x000 */
  __OM  uint32_t DIN;             /*!< HASH data input register,                                Address offset: 0x004 */
  __IOM uint32_t STR;             /*!< HASH start register,                                     Address offset: 0x008 */
  __IM  uint32_t HRA[5];          /*!< HASH digest registers,                                   Address offset: 0x00C */
  __IOM uint32_t IMR;             /*!< HASH interrupt enable register,                          Address offset: 0x020 */
  __IOM uint32_t SR;              /*!< HASH status register,                                    Address offset: 0x024 */
        uint32_t RESERVED1[52];   /*!< Reserved,                                                Address offset: 0x028 */
  __IOM uint32_t CSR[103];        /*!< HASH context swap register,                              Address offset: 0x0F8 */
        uint32_t RESERVED2[31];   /*!< Reserved,                                                Address offset: 0x294 */
  __IM  uint32_t HR[16];          /*!< HASH digest register,                                    Address offset: 0x310 */
} HASH_TypeDef;

