MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* ***********************************  Bit definition for ADC_AWD1HTR register  ************************************ */
#define ADC_AWD1HTR_HTR_Pos      (0U)
#define ADC_AWD1HTR_HTR_Msk      (0x7FFFFFUL << ADC_AWD1HTR_HTR_Pos)   /*!< 0x007FFFFF */
#define ADC_AWD1HTR_HTR          ADC_AWD1HTR_HTR_Msk                   /*!< Analog watchdog 1 higher threshold */
#define ADC_AWD1HTR_HTR_0        (0x1UL << ADC_AWD1HTR_HTR_Pos)        /*!< 0x00000001 */
#define ADC_AWD1HTR_HTR_1        (0x2UL << ADC_AWD1HTR_HTR_Pos)        /*!< 0x00000002 */
#define ADC_AWD1HTR_HTR_2        (0x4UL << ADC_AWD1HTR_HTR_Pos)        /*!< 0x00000004 */
#define ADC_AWD1HTR_HTR_3        (0x8UL << ADC_AWD1HTR_HTR_Pos)        /*!< 0x00000008 */
#define ADC_AWD1HTR_HTR_4        (0x10UL << ADC_AWD1HTR_HTR_Pos)       /*!< 0x00000010 */
#define ADC_AWD1HTR_HTR_5        (0x20UL << ADC_AWD1HTR_HTR_Pos)       /*!< 0x00000020 */
#define ADC_AWD1HTR_HTR_6        (0x40UL << ADC_AWD1HTR_HTR_Pos)       /*!< 0x00000040 */
#define ADC_AWD1HTR_HTR_7        (0x80UL << ADC_AWD1HTR_HTR_Pos)       /*!< 0x00000080 */
#define ADC_AWD1HTR_HTR_8        (0x100UL << ADC_AWD1HTR_HTR_Pos)      /*!< 0x00000100 */
#define ADC_AWD1HTR_HTR_9        (0x200UL << ADC_AWD1HTR_HTR_Pos)      /*!< 0x00000200 */
#define ADC_AWD1HTR_HTR_10       (0x400UL << ADC_AWD1HTR_HTR_Pos)      /*!< 0x00000400 */
#define ADC_AWD1HTR_HTR_11       (0x800UL << ADC_AWD1HTR_HTR_Pos)      /*!< 0x00000800 */
#define ADC_AWD1HTR_HTR_12       (0x1000UL << ADC_AWD1HTR_HTR_Pos)     /*!< 0x00001000 */
#define ADC_AWD1HTR_HTR_13       (0x2000UL << ADC_AWD1HTR_HTR_Pos)     /*!< 0x00002000 */
#define ADC_AWD1HTR_HTR_14       (0x4000UL << ADC_AWD1HTR_HTR_Pos)     /*!< 0x00004000 */
#define ADC_AWD1HTR_HTR_15       (0x8000UL << ADC_AWD1HTR_HTR_Pos)     /*!< 0x00008000 */
#define ADC_AWD1HTR_HTR_16       (0x10000UL << ADC_AWD1HTR_HTR_Pos)    /*!< 0x00010000 */
#define ADC_AWD1HTR_HTR_17       (0x20000UL << ADC_AWD1HTR_HTR_Pos)    /*!< 0x00020000 */
#define ADC_AWD1HTR_HTR_18       (0x40000UL << ADC_AWD1HTR_HTR_Pos)    /*!< 0x00040000 */
#define ADC_AWD1HTR_HTR_19       (0x80000UL << ADC_AWD1HTR_HTR_Pos)    /*!< 0x00080000 */
#define ADC_AWD1HTR_HTR_20       (0x100000UL << ADC_AWD1HTR_HTR_Pos)   /*!< 0x00100000 */
#define ADC_AWD1HTR_HTR_21       (0x200000UL << ADC_AWD1HTR_HTR_Pos)   /*!< 0x00200000 */
#define ADC_AWD1HTR_HTR_22       (0x400000UL << ADC_AWD1HTR_HTR_Pos)   /*!< 0x00400000 */
#define ADC_AWD1HTR_AWDFILT_Pos  (29U)
#define ADC_AWD1HTR_AWDFILT_Msk  (0x7UL << ADC_AWD1HTR_AWDFILT_Pos)    /*!< 0xE0000000 */
#define ADC_AWD1HTR_AWDFILT      ADC_AWD1HTR_AWDFILT_Msk               /*!< Analog watchdog filtering parameter */
#define ADC_AWD1HTR_AWDFILT_0    (0x1UL << ADC_AWD1HTR_AWDFILT_Pos)    /*!< 0x20000000 */
#define ADC_AWD1HTR_AWDFILT_1    (0x2UL << ADC_AWD1HTR_AWDFILT_Pos)    /*!< 0x40000000 */
#define ADC_AWD1HTR_AWDFILT_2    (0x4UL << ADC_AWD1HTR_AWDFILT_Pos)    /*!< 0x80000000 */

/* ***********************************  Bit definition for ADC_AWD2LTR register  ************************************ */
#define ADC_AWD2LTR_LTR_Pos      (0U)
#define ADC_AWD2LTR_LTR_Msk      (0x7FFFFFUL << ADC_AWD2LTR_LTR_Pos)   /*!< 0x007FFFFF */
#define ADC_AWD2LTR_LTR          ADC_AWD2LTR_LTR_Msk                   /*!< Analog watchdog 2 lower threshold */
#define ADC_AWD2LTR_LTR_0        (0x1UL << ADC_AWD2LTR_LTR_Pos)        /*!< 0x00000001 */
#define ADC_AWD2LTR_LTR_1        (0x2UL << ADC_AWD2LTR_LTR_Pos)        /*!< 0x00000002 */
#define ADC_AWD2LTR_LTR_2        (0x4UL << ADC_AWD2LTR_LTR_Pos)        /*!< 0x00000004 */
#define ADC_AWD2LTR_LTR_3        (0x8UL << ADC_AWD2LTR_LTR_Pos)        /*!< 0x00000008 */
#define ADC_AWD2LTR_LTR_4        (0x10UL << ADC_AWD2LTR_LTR_Pos)       /*!< 0x00000010 */
#define ADC_AWD2LTR_LTR_5        (0x20UL << ADC_AWD2LTR_LTR_Pos)       /*!< 0x00000020 */
#define ADC_AWD2LTR_LTR_6        (0x40UL << ADC_AWD2LTR_LTR_Pos)       /*!< 0x00000040 */
#define ADC_AWD2LTR_LTR_7        (0x80UL << ADC_AWD2LTR_LTR_Pos)       /*!< 0x00000080 */
#define ADC_AWD2LTR_LTR_8        (0x100UL << ADC_AWD2LTR_LTR_Pos)      /*!< 0x00000100 */
#define ADC_AWD2LTR_LTR_9        (0x200UL << ADC_AWD2LTR_LTR_Pos)      /*!< 0x00000200 */
#define ADC_AWD2LTR_LTR_10       (0x400UL << ADC_AWD2LTR_LTR_Pos)      /*!< 0x00000400 */
#define ADC_AWD2LTR_LTR_11       (0x800UL << ADC_AWD2LTR_LTR_Pos)      /*!< 0x00000800 */
#define ADC_AWD2LTR_LTR_12       (0x1000UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00001000 */
#define ADC_AWD2LTR_LTR_13       (0x2000UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00002000 */
#define ADC_AWD2LTR_LTR_14       (0x4000UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00004000 */
#define ADC_AWD2LTR_LTR_15       (0x8000UL << ADC_AWD2LTR_LTR_Pos)     /*!< 0x00008000 */
#define ADC_AWD2LTR_LTR_16       (0x10000UL << ADC_AWD2LTR_LTR_Pos)    /*!< 0x00010000 */
#define ADC_AWD2LTR_LTR_17       (0x20000UL << ADC_AWD2LTR_LTR_Pos)    /*!< 0x00020000 */
#define ADC_AWD2LTR_LTR_18       (0x40000UL << ADC_AWD2LTR_LTR_Pos)    /*!< 0x00040000 */
#define ADC_AWD2LTR_LTR_19       (0x80000UL << ADC_AWD2LTR_LTR_Pos)    /*!< 0x00080000 */
#define ADC_AWD2LTR_LTR_20       (0x100000UL << ADC_AWD2LTR_LTR_Pos)   /*!< 0x00100000 */
#define ADC_AWD2LTR_LTR_21       (0x200000UL << ADC_AWD2LTR_LTR_Pos)   /*!< 0x00200000 */
#define ADC_AWD2LTR_LTR_22       (0x400000UL << ADC_AWD2LTR_LTR_Pos)   /*!< 0x00400000 */

/* ***********************************  Bit definition for ADC_AWD2HTR register  ************************************ */
#define ADC_AWD2HTR_HTR_Pos      (0U)
#define ADC_AWD2HTR_HTR_Msk      (0x7FFFFFUL << ADC_AWD2HTR_HTR_Pos)   /*!< 0x007FFFFF */
#define ADC_AWD2HTR_HTR          ADC_AWD2HTR_HTR_Msk                   /*!< Analog watchdog 2 higher threshold */
#define ADC_AWD2HTR_HTR_0        (0x1UL << ADC_AWD2HTR_HTR_Pos)        /*!< 0x00000001 */
#define ADC_AWD2HTR_HTR_1        (0x2UL << ADC_AWD2HTR_HTR_Pos)        /*!< 0x00000002 */
#define ADC_AWD2HTR_HTR_2        (0x4UL << ADC_AWD2HTR_HTR_Pos)        /*!< 0x00000004 */
#define ADC_AWD2HTR_HTR_3        (0x8UL << ADC_AWD2HTR_HTR_Pos)        /*!< 0x00000008 */
#define ADC_AWD2HTR_HTR_4        (0x10UL << ADC_AWD2HTR_HTR_Pos)       /*!< 0x00000010 */
#define ADC_AWD2HTR_HTR_5        (0x20UL << ADC_AWD2HTR_HTR_Pos)       /*!< 0x00000020 */
#define ADC_AWD2HTR_HTR_6        (0x40UL << ADC_AWD2HTR_HTR_Pos)       /*!< 0x00000040 */
#define ADC_AWD2HTR_HTR_7        (0x80UL << ADC_AWD2HTR_HTR_Pos)       /*!< 0x00000080 */
#define ADC_AWD2HTR_HTR_8        (0x100UL << ADC_AWD2HTR_HTR_Pos)      /*!< 0x00000100 */
#define ADC_AWD2HTR_HTR_9        (0x200UL << ADC_AWD2HTR_HTR_Pos)      /*!< 0x00000200 */
#define ADC_AWD2HTR_HTR_10       (0x400UL << ADC_AWD2HTR_HTR_Pos)      /*!< 0x00000400 */
#define ADC_AWD2HTR_HTR_11       (0x800UL << ADC_AWD2HTR_HTR_Pos)      /*!< 0x00000800 */
#define ADC_AWD2HTR_HTR_12       (0x1000UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00001000 */
#define ADC_AWD2HTR_HTR_13       (0x2000UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00002000 */
#define ADC_AWD2HTR_HTR_14       (0x4000UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00004000 */
#define ADC_AWD2HTR_HTR_15       (0x8000UL << ADC_AWD2HTR_HTR_Pos)     /*!< 0x00008000 */
#define ADC_AWD2HTR_HTR_16       (0x10000UL << ADC_AWD2HTR_HTR_Pos)    /*!< 0x00010000 */
#define ADC_AWD2HTR_HTR_17       (0x20000UL << ADC_AWD2HTR_HTR_Pos)    /*!< 0x00020000 */
#define ADC_AWD2HTR_HTR_18       (0x40000UL << ADC_AWD2HTR_HTR_Pos)    /*!< 0x00040000 */
#define ADC_AWD2HTR_HTR_19       (0x80000UL << ADC_AWD2HTR_HTR_Pos)    /*!< 0x00080000 */
#define ADC_AWD2HTR_HTR_20       (0x100000UL << ADC_AWD2HTR_HTR_Pos)   /*!< 0x00100000 */
#define ADC_AWD2HTR_HTR_21       (0x200000UL << ADC_AWD2HTR_HTR_Pos)   /*!< 0x00200000 */
#define ADC_AWD2HTR_HTR_22       (0x400000UL << ADC_AWD2HTR_HTR_Pos)   /*!< 0x00400000 */

/* ***********************************  Bit definition for ADC_AWD3LTR register  ************************************ */
#define ADC_AWD3LTR_LTR_Pos      (0U)
#define ADC_AWD3LTR_LTR_Msk      (0x7FFFFFUL << ADC_AWD3LTR_LTR_Pos)   /*!< 0x007FFFFF */
#define ADC_AWD3LTR_LTR          ADC_AWD3LTR_LTR_Msk                   /*!< Analog watchdog 3 lower threshold */
#define ADC_AWD3LTR_LTR_0        (0x1UL << ADC_AWD3LTR_LTR_Pos)        /*!< 0x00000001 */
#define ADC_AWD3LTR_LTR_1        (0x2UL << ADC_AWD3LTR_LTR_Pos)        /*!< 0x00000002 */
#define ADC_AWD3LTR_LTR_2        (0x4UL << ADC_AWD3LTR_LTR_Pos)        /*!< 0x00000004 */
#define ADC_AWD3LTR_LTR_3        (0x8UL << ADC_AWD3LTR_LTR_Pos)        /*!< 0x00000008 */
#define ADC_AWD3LTR_LTR_4        (0x10UL << ADC_AWD3LTR_LTR_Pos)       /*!< 0x00000010 */
#define ADC_AWD3LTR_LTR_5        (0x20UL << ADC_AWD3LTR_LTR_Pos)       /*!< 0x00000020 */
#define ADC_AWD3LTR_LTR_6        (0x40UL << ADC_AWD3LTR_LTR_Pos)       /*!< 0x00000040 */
#define ADC_AWD3LTR_LTR_7        (0x80UL << ADC_AWD3LTR_LTR_Pos)       /*!< 0x00000080 */
#define ADC_AWD3LTR_LTR_8        (0x100UL << ADC_AWD3LTR_LTR_Pos)      /*!< 0x00000100 */
#define ADC_AWD3LTR_LTR_9        (0x200UL << ADC_AWD3LTR_LTR_Pos)      /*!< 0x00000200 */
#define ADC_AWD3LTR_LTR_10       (0x400UL << ADC_AWD3LTR_LTR_Pos)      /*!< 0x00000400 */
#define ADC_AWD3LTR_LTR_11       (0x800UL << ADC_AWD3LTR_LTR_Pos)      /*!< 0x00000800 */
#define ADC_AWD3LTR_LTR_12       (0x1000UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00001000 */
#define ADC_AWD3LTR_LTR_13       (0x2000UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00002000 */
#define ADC_AWD3LTR_LTR_14       (0x4000UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00004000 */
#define ADC_AWD3LTR_LTR_15       (0x8000UL << ADC_AWD3LTR_LTR_Pos)     /*!< 0x00008000 */
#define ADC_AWD3LTR_LTR_16       (0x10000UL << ADC_AWD3LTR_LTR_Pos)    /*!< 0x00010000 */
#define ADC_AWD3LTR_LTR_17       (0x20000UL << ADC_AWD3LTR_LTR_Pos)    /*!< 0x00020000 */
#define ADC_AWD3LTR_LTR_18       (0x40000UL << ADC_AWD3LTR_LTR_Pos)    /*!< 0x00040000 */
#define ADC_AWD3LTR_LTR_19       (0x80000UL << ADC_AWD3LTR_LTR_Pos)    /*!< 0x00080000 */
#define ADC_AWD3LTR_LTR_20       (0x100000UL << ADC_AWD3LTR_LTR_Pos)   /*!< 0x00100000 */
#define ADC_AWD3LTR_LTR_21       (0x200000UL << ADC_AWD3LTR_LTR_Pos)   /*!< 0x00200000 */
#define ADC_AWD3LTR_LTR_22       (0x400000UL << ADC_AWD3LTR_LTR_Pos)   /*!< 0x00400000 */

