MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* ************************************  Bit definition for AES_SUSPR1 register  ************************************ */
#define AES_SUSPR1_SUSP_Pos       (0U)
#define AES_SUSPR1_SUSP_Msk       (0xFFFFFFFFUL << AES_SUSPR1_SUSP_Pos)        /*!< 0xFFFFFFFF */
#define AES_SUSPR1_SUSP           AES_SUSPR1_SUSP_Msk                          /*!< Suspend data */

/* ************************************  Bit definition for AES_SUSPR2 register  ************************************ */
#define AES_SUSPR2_SUSP_Pos       (0U)
#define AES_SUSPR2_SUSP_Msk       (0xFFFFFFFFUL << AES_SUSPR2_SUSP_Pos)        /*!< 0xFFFFFFFF */
#define AES_SUSPR2_SUSP           AES_SUSPR2_SUSP_Msk                          /*!< Suspend data */

/* ************************************  Bit definition for AES_SUSPR3 register  ************************************ */
#define AES_SUSPR3_SUSP_Pos       (0U)
#define AES_SUSPR3_SUSP_Msk       (0xFFFFFFFFUL << AES_SUSPR3_SUSP_Pos)        /*!< 0xFFFFFFFF */
#define AES_SUSPR3_SUSP           AES_SUSPR3_SUSP_Msk                          /*!< Suspend data */

/* ************************************  Bit definition for AES_SUSPR4 register  ************************************ */
#define AES_SUSPR4_SUSP_Pos       (0U)
#define AES_SUSPR4_SUSP_Msk       (0xFFFFFFFFUL << AES_SUSPR4_SUSP_Pos)        /*!< 0xFFFFFFFF */
#define AES_SUSPR4_SUSP           AES_SUSPR4_SUSP_Msk                          /*!< Suspend data */

/* ************************************  Bit definition for AES_SUSPR5 register  ************************************ */
#define AES_SUSPR5_SUSP_Pos       (0U)
#define AES_SUSPR5_SUSP_Msk       (0xFFFFFFFFUL << AES_SUSPR5_SUSP_Pos)        /*!< 0xFFFFFFFF */
#define AES_SUSPR5_SUSP           AES_SUSPR5_SUSP_Msk                          /*!< Suspend data */

/* ************************************  Bit definition for AES_SUSPR6 register  ************************************ */
#define AES_SUSPR6_SUSP_Pos       (0U)
#define AES_SUSPR6_SUSP_Msk       (0xFFFFFFFFUL << AES_SUSPR6_SUSP_Pos)        /*!< 0xFFFFFFFF */
#define AES_SUSPR6_SUSP           AES_SUSPR6_SUSP_Msk                          /*!< Suspend data */

/* ************************************  Bit definition for AES_SUSPR7 register  ************************************ */
#define AES_SUSPR7_SUSP_Pos       (0U)
#define AES_SUSPR7_SUSP_Msk       (0xFFFFFFFFUL << AES_SUSPR7_SUSP_Pos)        /*!< 0xFFFFFFFF */
#define AES_SUSPR7_SUSP           AES_SUSPR7_SUSP_Msk                          /*!< Suspend data */

/* *************************************  Bit definition for AES_IER register  ************************************** */
#define AES_IER_CCFIE_Pos         (0U)
#define AES_IER_CCFIE_Msk         (0x1UL << AES_IER_CCFIE_Pos)                 /*!< 0x00000001 */
#define AES_IER_CCFIE             AES_IER_CCFIE_Msk                            /*!< Computation complete flag interrupt
                                                                                    enable */
#define AES_IER_RWEIE_Pos         (1U)
#define AES_IER_RWEIE_Msk         (0x1UL << AES_IER_RWEIE_Pos)                 /*!< 0x00000002 */
#define AES_IER_RWEIE             AES_IER_RWEIE_Msk                            /*!< Read or write error interrupt
                                                                                    enable */
#define AES_IER_KEIE_Pos          (2U)
#define AES_IER_KEIE_Msk          (0x1UL << AES_IER_KEIE_Pos)                  /*!< 0x00000004 */
#define AES_IER_KEIE              AES_IER_KEIE_Msk                             /*!< Key error interrupt enable */
#define AES_IER_RNGEIE_Pos        (3U)
#define AES_IER_RNGEIE_Msk        (0x1UL << AES_IER_RNGEIE_Pos)                /*!< 0x00000008 */
#define AES_IER_RNGEIE            AES_IER_RNGEIE_Msk                           /*!< RNG error interrupt enable */

/* *************************************  Bit definition for AES_ISR register  ************************************** */
#define AES_ISR_CCF_Pos           (0U)
#define AES_ISR_CCF_Msk           (0x1UL << AES_ISR_CCF_Pos)                   /*!< 0x00000001 */
#define AES_ISR_CCF               AES_ISR_CCF_Msk                              /*!< Computation complete flag */
#define AES_ISR_RWEIF_Pos         (1U)
#define AES_ISR_RWEIF_Msk         (0x1UL << AES_ISR_RWEIF_Pos)                 /*!< 0x00000002 */
#define AES_ISR_RWEIF             AES_ISR_RWEIF_Msk                            /*!< Read or write error interrupt flag
                                                                                    */
#define AES_ISR_KEIF_Pos          (2U)
#define AES_ISR_KEIF_Msk          (0x1UL << AES_ISR_KEIF_Pos)                  /*!< 0x00000004 */
#define AES_ISR_KEIF              AES_ISR_KEIF_Msk                             /*!< Key error interrupt flag */
#define AES_ISR_RNGEIF_Pos        (3U)
#define AES_ISR_RNGEIF_Msk        (0x1UL << AES_ISR_RNGEIF_Pos)                /*!< 0x00000008 */
#define AES_ISR_RNGEIF            AES_ISR_RNGEIF_Msk                           /*!< RNG error interrupt flag */

/* *************************************  Bit definition for AES_ICR register  ************************************** */
#define AES_ICR_CCF_Pos           (0U)
#define AES_ICR_CCF_Msk           (0x1UL << AES_ICR_CCF_Pos)                   /*!< 0x00000001 */
#define AES_ICR_CCF               AES_ICR_CCF_Msk                              /*!< Computation complete flag clear */
#define AES_ICR_RWEIF_Pos         (1U)
#define AES_ICR_RWEIF_Msk         (0x1UL << AES_ICR_RWEIF_Pos)                 /*!< 0x00000002 */
#define AES_ICR_RWEIF             AES_ICR_RWEIF_Msk                            /*!< Read or write error interrupt flag
                                                                                    clear */
#define AES_ICR_KEIF_Pos          (2U)
#define AES_ICR_KEIF_Msk          (0x1UL << AES_ICR_KEIF_Pos)                  /*!< 0x00000004 */
#define AES_ICR_KEIF              AES_ICR_KEIF_Msk                             /*!< Key error interrupt flag clear */
#define AES_ICR_RNGEIF_Pos        (3U)
#define AES_ICR_RNGEIF_Msk        (0x1UL << AES_ICR_RNGEIF_Pos)                /*!< 0x00000008 */
#define AES_ICR_RNGEIF            AES_ICR_RNGEIF_Msk                           /*!< RNG error interrupt flag clear */

/**********************************************************************************************************************/
/*                                                                                                                    */
/*                                       Coupling and chaining bridge (CCB)                                           */
/*                                                                                                                    */
/**********************************************************************************************************************/
/* **************************************  Bit definition for CCB_CR register  ************************************** */
#define CCB_CR_CCOP_Pos            (0U)
#define CCB_CR_CCOP_Msk            (0xFFUL << CCB_CR_CCOP_Pos)             /*!< 0x000000FF */
#define CCB_CR_CCOP                CCB_CR_CCOP_Msk                         /*!< Coupling and chaining operation */
#define CCB_CR_CCOP_0              (0x1UL << CCB_CR_CCOP_Pos)              /*!< 0x00000001 */
#define CCB_CR_CCOP_1              (0x2UL << CCB_CR_CCOP_Pos)              /*!< 0x00000002 */
#define CCB_CR_CCOP_2              (0x4UL << CCB_CR_CCOP_Pos)              /*!< 0x00000004 */
#define CCB_CR_CCOP_3              (0x8UL << CCB_CR_CCOP_Pos)              /*!< 0x00000008 */
#define CCB_CR_CCOP_4              (0x10UL << CCB_CR_CCOP_Pos)             /*!< 0x00000010 */
#define CCB_CR_CCOP_5              (0x20UL << CCB_CR_CCOP_Pos)             /*!< 0x00000020 */
#define CCB_CR_CCOP_6              (0x40UL << CCB_CR_CCOP_Pos)             /*!< 0x00000040 */
#define CCB_CR_CCOP_7              (0x80UL << CCB_CR_CCOP_Pos)             /*!< 0x00000080 */
#define CCB_CR_IPRST_Pos           (31U)
#define CCB_CR_IPRST_Msk           (0x1UL << CCB_CR_IPRST_Pos)             /*!< 0x80000000 */
#define CCB_CR_IPRST               CCB_CR_IPRST_Msk                        /*!< CCB reset */

