MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* ************************************  Bit definition for DAC_SHSR1 register  ************************************* */
#define DAC_SHSR1_TSAMPLE1_Pos     (0U)
#define DAC_SHSR1_TSAMPLE1_Msk     (0x3FFUL << DAC_SHSR1_TSAMPLE1_Pos)     /*!< 0x000003FF */
#define DAC_SHSR1_TSAMPLE1         DAC_SHSR1_TSAMPLE1_Msk                  /*!< DAC channel1 sample time
                                                                                (only valid in sample and hold mode) */
#define DAC_SHSR1_TSAMPLE1_0       (0x1UL << DAC_SHSR1_TSAMPLE1_Pos)       /*!< 0x00000001 */
#define DAC_SHSR1_TSAMPLE1_1       (0x2UL << DAC_SHSR1_TSAMPLE1_Pos)       /*!< 0x00000002 */
#define DAC_SHSR1_TSAMPLE1_2       (0x4UL << DAC_SHSR1_TSAMPLE1_Pos)       /*!< 0x00000004 */
#define DAC_SHSR1_TSAMPLE1_3       (0x8UL << DAC_SHSR1_TSAMPLE1_Pos)       /*!< 0x00000008 */
#define DAC_SHSR1_TSAMPLE1_4       (0x10UL << DAC_SHSR1_TSAMPLE1_Pos)      /*!< 0x00000010 */
#define DAC_SHSR1_TSAMPLE1_5       (0x20UL << DAC_SHSR1_TSAMPLE1_Pos)      /*!< 0x00000020 */
#define DAC_SHSR1_TSAMPLE1_6       (0x40UL << DAC_SHSR1_TSAMPLE1_Pos)      /*!< 0x00000040 */
#define DAC_SHSR1_TSAMPLE1_7       (0x80UL << DAC_SHSR1_TSAMPLE1_Pos)      /*!< 0x00000080 */
#define DAC_SHSR1_TSAMPLE1_8       (0x100UL << DAC_SHSR1_TSAMPLE1_Pos)     /*!< 0x00000100 */
#define DAC_SHSR1_TSAMPLE1_9       (0x200UL << DAC_SHSR1_TSAMPLE1_Pos)     /*!< 0x00000200 */

/* *************************************  Bit definition for DAC_SHHR register  ************************************* */
#define DAC_SHHR_THOLD1_Pos        (0U)
#define DAC_SHHR_THOLD1_Msk        (0x3FFUL << DAC_SHHR_THOLD1_Pos)        /*!< 0x000003FF */
#define DAC_SHHR_THOLD1            DAC_SHHR_THOLD1_Msk                     /*!< DAC channel1 hold time
                                                                                (only valid in Sample and hold mode) */
#define DAC_SHHR_THOLD1_0          (0x1UL << DAC_SHHR_THOLD1_Pos)          /*!< 0x00000001 */
#define DAC_SHHR_THOLD1_1          (0x2UL << DAC_SHHR_THOLD1_Pos)          /*!< 0x00000002 */
#define DAC_SHHR_THOLD1_2          (0x4UL << DAC_SHHR_THOLD1_Pos)          /*!< 0x00000004 */
#define DAC_SHHR_THOLD1_3          (0x8UL << DAC_SHHR_THOLD1_Pos)          /*!< 0x00000008 */
#define DAC_SHHR_THOLD1_4          (0x10UL << DAC_SHHR_THOLD1_Pos)         /*!< 0x00000010 */
#define DAC_SHHR_THOLD1_5          (0x20UL << DAC_SHHR_THOLD1_Pos)         /*!< 0x00000020 */
#define DAC_SHHR_THOLD1_6          (0x40UL << DAC_SHHR_THOLD1_Pos)         /*!< 0x00000040 */
#define DAC_SHHR_THOLD1_7          (0x080UL << DAC_SHHR_THOLD1_Pos)        /*!< 0x00000080 */
#define DAC_SHHR_THOLD1_8          (0x100UL << DAC_SHHR_THOLD1_Pos)        /*!< 0x00000100 */
#define DAC_SHHR_THOLD1_9          (0x200UL << DAC_SHHR_THOLD1_Pos)        /*!< 0x00000200 */

/* *************************************  Bit definition for DAC_SHRR register  ************************************* */
#define DAC_SHRR_TREFRESH1_Pos     (0U)
#define DAC_SHRR_TREFRESH1_Msk     (0xFFUL << DAC_SHRR_TREFRESH1_Pos)      /*!< 0x000000FF */
#define DAC_SHRR_TREFRESH1         DAC_SHRR_TREFRESH1_Msk                  /*!< DAC channel1 refresh time
                                                                                (only valid in sample and hold mode) */
#define DAC_SHRR_TREFRESH1_0       (0x1UL << DAC_SHRR_TREFRESH1_Pos)       /*!< 0x00000001 */
#define DAC_SHRR_TREFRESH1_1       (0x2UL << DAC_SHRR_TREFRESH1_Pos)       /*!< 0x00000002 */
#define DAC_SHRR_TREFRESH1_2       (0x4UL << DAC_SHRR_TREFRESH1_Pos)       /*!< 0x00000004 */
#define DAC_SHRR_TREFRESH1_3       (0x8UL << DAC_SHRR_TREFRESH1_Pos)       /*!< 0x00000008 */
#define DAC_SHRR_TREFRESH1_4       (0x10UL << DAC_SHRR_TREFRESH1_Pos)      /*!< 0x00000010 */
#define DAC_SHRR_TREFRESH1_5       (0x20UL << DAC_SHRR_TREFRESH1_Pos)      /*!< 0x00000020 */
#define DAC_SHRR_TREFRESH1_6       (0x40UL << DAC_SHRR_TREFRESH1_Pos)      /*!< 0x00000040 */
#define DAC_SHRR_TREFRESH1_7       (0x80UL << DAC_SHRR_TREFRESH1_Pos)      /*!< 0x00000080 */

/**********************************************************************************************************************/
/*                                                                                                                    */
/*                                            Debug MCU (DBGMCU)                                                      */
/*                                                                                                                    */
/**********************************************************************************************************************/
/* **********************************  Bit definition for DBGMCU_IDCODE register  *********************************** */
#define DBGMCU_IDCODE_DEV_ID_Pos               (0U)
#define DBGMCU_IDCODE_DEV_ID_Msk               (0xFFFUL << DBGMCU_IDCODE_DEV_ID_Pos)               /*!< 0x00000FFF */
#define DBGMCU_IDCODE_DEV_ID                   DBGMCU_IDCODE_DEV_ID_Msk                            /*!< Device
                                                                                                        identification
                                                                                                        */
#define DBGMCU_IDCODE_REV_ID_Pos               (16U)
#define DBGMCU_IDCODE_REV_ID_Msk               (0xFFFFUL << DBGMCU_IDCODE_REV_ID_Pos)              /*!< 0xFFFF0000 */
#define DBGMCU_IDCODE_REV_ID                   DBGMCU_IDCODE_REV_ID_Msk                            /*!< Revision of the
                                                                                                        device */

/* ************************************  Bit definition for DBGMCU_CR register  ************************************* */
#define DBGMCU_CR_DBG_SLEEP_Pos                (0U)
#define DBGMCU_CR_DBG_SLEEP_Msk                (0x1UL << DBGMCU_CR_DBG_SLEEP_Pos)                  /*!< 0x00000001 */
#define DBGMCU_CR_DBG_SLEEP                    DBGMCU_CR_DBG_SLEEP_Msk                             /*!< Debug in Sleep
                                                                                                        mode */
#define DBGMCU_CR_DBG_STOP_Pos                 (1U)
#define DBGMCU_CR_DBG_STOP_Msk                 (0x1UL << DBGMCU_CR_DBG_STOP_Pos)                   /*!< 0x00000002 */
#define DBGMCU_CR_DBG_STOP                     DBGMCU_CR_DBG_STOP_Msk                              /*!< Debug in Stop
                                                                                                        mode */
#define DBGMCU_CR_DBG_STANDBY_Pos              (2U)
#define DBGMCU_CR_DBG_STANDBY_Msk              (0x1UL << DBGMCU_CR_DBG_STANDBY_Pos)                /*!< 0x00000004 */
#define DBGMCU_CR_DBG_STANDBY                  DBGMCU_CR_DBG_STANDBY_Msk                           /*!< Debug in Standby
                                                                                                        mode */
#define DBGMCU_CR_TRACE_IOEN_Pos               (4U)
#define DBGMCU_CR_TRACE_IOEN_Msk               (0x1UL << DBGMCU_CR_TRACE_IOEN_Pos)                 /*!< 0x00000010 */
#define DBGMCU_CR_TRACE_IOEN                   DBGMCU_CR_TRACE_IOEN_Msk                            /*!< Trace pin enable
                                                                                                        */
#define DBGMCU_CR_TRACE_EN_Pos                 (5U)
#define DBGMCU_CR_TRACE_EN_Msk                 (0x1UL << DBGMCU_CR_TRACE_EN_Pos)                   /*!< 0x00000020 */
#define DBGMCU_CR_TRACE_EN                     DBGMCU_CR_TRACE_EN_Msk                              /*!< Trace port and
                                                                                                        clock enable. */
#define DBGMCU_CR_TRACE_MODE_Pos               (6U)
#define DBGMCU_CR_TRACE_MODE_Msk               (0x3UL << DBGMCU_CR_TRACE_MODE_Pos)                 /*!< 0x000000C0 */
#define DBGMCU_CR_TRACE_MODE                   DBGMCU_CR_TRACE_MODE_Msk                            /*!< Trace pin
                                                                                                        assignment */
#define DBGMCU_CR_TRACE_MODE_0                (0x1UL << DBGMCU_CR_TRACE_MODE_Pos)                  /*!< 0x00000040 */
#define DBGMCU_CR_TRACE_MODE_1                (0x2UL << DBGMCU_CR_TRACE_MODE_Pos)                  /*!< 0x00000080 */

/* *********************************  Bit definition for DBGMCU_APB1LFZR register  ********************************** */
#define DBGMCU_APB1LFZR_DBG_TIM2_STOP_Pos      (0U)
#define DBGMCU_APB1LFZR_DBG_TIM2_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_TIM2_STOP_Pos)        /*!< 0x00000001 */
#define DBGMCU_APB1LFZR_DBG_TIM2_STOP          DBGMCU_APB1LFZR_DBG_TIM2_STOP_Msk                   /*!< TIM2 stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_TIM3_STOP_Pos      (1U)
#define DBGMCU_APB1LFZR_DBG_TIM3_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_TIM3_STOP_Pos)        /*!< 0x00000002 */
#define DBGMCU_APB1LFZR_DBG_TIM3_STOP          DBGMCU_APB1LFZR_DBG_TIM3_STOP_Msk                   /*!< TIM3 stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_TIM4_STOP_Pos      (2U)
#define DBGMCU_APB1LFZR_DBG_TIM4_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_TIM4_STOP_Pos)        /*!< 0x00000004 */
#define DBGMCU_APB1LFZR_DBG_TIM4_STOP          DBGMCU_APB1LFZR_DBG_TIM4_STOP_Msk                   /*!< TIM4 stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_TIM5_STOP_Pos      (3U)
#define DBGMCU_APB1LFZR_DBG_TIM5_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_TIM5_STOP_Pos)        /*!< 0x00000008 */
#define DBGMCU_APB1LFZR_DBG_TIM5_STOP          DBGMCU_APB1LFZR_DBG_TIM5_STOP_Msk                   /*!< TIM5 stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_TIM6_STOP_Pos      (4U)
#define DBGMCU_APB1LFZR_DBG_TIM6_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_TIM6_STOP_Pos)        /*!< 0x00000010 */
#define DBGMCU_APB1LFZR_DBG_TIM6_STOP          DBGMCU_APB1LFZR_DBG_TIM6_STOP_Msk                   /*!< TIM6 stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_TIM7_STOP_Pos      (5U)
#define DBGMCU_APB1LFZR_DBG_TIM7_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_TIM7_STOP_Pos)        /*!< 0x00000020 */
#define DBGMCU_APB1LFZR_DBG_TIM7_STOP          DBGMCU_APB1LFZR_DBG_TIM7_STOP_Msk                   /*!< TIM7 stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_TIM12_STOP_Pos     (6U)
#define DBGMCU_APB1LFZR_DBG_TIM12_STOP_Msk     (0x1UL << DBGMCU_APB1LFZR_DBG_TIM12_STOP_Pos)       /*!< 0x00000040 */
#define DBGMCU_APB1LFZR_DBG_TIM12_STOP         DBGMCU_APB1LFZR_DBG_TIM12_STOP_Msk                  /*!< TIM12 stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_WWDG_STOP_Pos      (11U)
#define DBGMCU_APB1LFZR_DBG_WWDG_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_WWDG_STOP_Pos)        /*!< 0x00000800 */
#define DBGMCU_APB1LFZR_DBG_WWDG_STOP          DBGMCU_APB1LFZR_DBG_WWDG_STOP_Msk                   /*!< WWDG stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_IWDG_STOP_Pos      (12U)
#define DBGMCU_APB1LFZR_DBG_IWDG_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_IWDG_STOP_Pos)        /*!< 0x00001000 */
#define DBGMCU_APB1LFZR_DBG_IWDG_STOP          DBGMCU_APB1LFZR_DBG_IWDG_STOP_Msk                   /*!< IWDG stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_I2C1_STOP_Pos      (21U)
#define DBGMCU_APB1LFZR_DBG_I2C1_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_I2C1_STOP_Pos)        /*!< 0x00200000 */
#define DBGMCU_APB1LFZR_DBG_I2C1_STOP          DBGMCU_APB1LFZR_DBG_I2C1_STOP_Msk                   /*!< I2C1 SMBUS
                                                                                                        timeout stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_I2C2_STOP_Pos      (22U)
#define DBGMCU_APB1LFZR_DBG_I2C2_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_I2C2_STOP_Pos)        /*!< 0x00400000 */
#define DBGMCU_APB1LFZR_DBG_I2C2_STOP          DBGMCU_APB1LFZR_DBG_I2C2_STOP_Msk                   /*!< I2C2 SMBUS
                                                                                                        timeout stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_I3C1_STOP_Pos      (23U)
#define DBGMCU_APB1LFZR_DBG_I3C1_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_I3C1_STOP_Pos)        /*!< 0x00800000 */
#define DBGMCU_APB1LFZR_DBG_I3C1_STOP          DBGMCU_APB1LFZR_DBG_I3C1_STOP_Msk                   /*!< I3C1 SCL stall
                                                                                                        counter stop in
                                                                                                        debug */

/* **********************************  Bit definition for DBGMCU_APB2FZR register  ********************************** */
#define DBGMCU_APB2FZR_DBG_TIM1_STOP_Pos       (11U)
#define DBGMCU_APB2FZR_DBG_TIM1_STOP_Msk       (0x1UL << DBGMCU_APB2FZR_DBG_TIM1_STOP_Pos)         /*!< 0x00000800 */
#define DBGMCU_APB2FZR_DBG_TIM1_STOP           DBGMCU_APB2FZR_DBG_TIM1_STOP_Msk                    /*!< TIM1 stop in
                                                                                                        debug */
#define DBGMCU_APB2FZR_DBG_TIM8_STOP_Pos       (13U)
#define DBGMCU_APB2FZR_DBG_TIM8_STOP_Msk       (0x1UL << DBGMCU_APB2FZR_DBG_TIM8_STOP_Pos)         /*!< 0x00002000 */
#define DBGMCU_APB2FZR_DBG_TIM8_STOP           DBGMCU_APB2FZR_DBG_TIM8_STOP_Msk                    /*!< TIM8 stop in
                                                                                                        debug */
#define DBGMCU_APB2FZR_DBG_TIM15_STOP_Pos      (16U)
#define DBGMCU_APB2FZR_DBG_TIM15_STOP_Msk      (0x1UL << DBGMCU_APB2FZR_DBG_TIM15_STOP_Pos)        /*!< 0x00010000 */
#define DBGMCU_APB2FZR_DBG_TIM15_STOP          DBGMCU_APB2FZR_DBG_TIM15_STOP_Msk                   /*!< TIM15 stop in
                                                                                                        debug */
#define DBGMCU_APB2FZR_DBG_TIM16_STOP_Pos      (17U)
#define DBGMCU_APB2FZR_DBG_TIM16_STOP_Msk      (0x1UL << DBGMCU_APB2FZR_DBG_TIM16_STOP_Pos)        /*!< 0x00020000 */
#define DBGMCU_APB2FZR_DBG_TIM16_STOP          DBGMCU_APB2FZR_DBG_TIM16_STOP_Msk                   /*!< TIM16 stop in
                                                                                                        debug */
#define DBGMCU_APB2FZR_DBG_TIM17_STOP_Pos      (18U)
#define DBGMCU_APB2FZR_DBG_TIM17_STOP_Msk      (0x1UL << DBGMCU_APB2FZR_DBG_TIM17_STOP_Pos)        /*!< 0x00040000 */
#define DBGMCU_APB2FZR_DBG_TIM17_STOP          DBGMCU_APB2FZR_DBG_TIM17_STOP_Msk                   /*!< TIM17 stop in
                                                                                                        debug */

/* **********************************  Bit definition for DBGMCU_APB3FZR register  ********************************** */
#define DBGMCU_APB3FZR_DBG_LPTIM1_STOP_Pos     (17U)
#define DBGMCU_APB3FZR_DBG_LPTIM1_STOP_Msk     (0x1UL << DBGMCU_APB3FZR_DBG_LPTIM1_STOP_Pos)       /*!< 0x00020000 */
#define DBGMCU_APB3FZR_DBG_LPTIM1_STOP         DBGMCU_APB3FZR_DBG_LPTIM1_STOP_Msk                  /*!< LPTIM1 stop
                                                                                                        in debug */
#define DBGMCU_APB3FZR_DBG_RTC_STOP_Pos        (30U)
#define DBGMCU_APB3FZR_DBG_RTC_STOP_Msk        (0x1UL << DBGMCU_APB3FZR_DBG_RTC_STOP_Pos)          /*!< 0x40000000 */
#define DBGMCU_APB3FZR_DBG_RTC_STOP            DBGMCU_APB3FZR_DBG_RTC_STOP_Msk                     /*!< RTC stop in
                                                                                                        debug */

/* **********************************  Bit definition for DBGMCU_AHB1FZR register  ********************************** */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_0_STOP_Pos   (0U)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_0_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_0_STOP_Pos)     /*!< 0x00000001 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_0_STOP       DBGMCU_AHB1FZR_DBG_LPDMA1_0_STOP_Msk                /*!< LPDMA1 channel 0
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_1_STOP_Pos   (1U)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_1_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_1_STOP_Pos)     /*!< 0x00000002 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_1_STOP       DBGMCU_AHB1FZR_DBG_LPDMA1_1_STOP_Msk                /*!< LPDMA1 channel 1
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_2_STOP_Pos   (2U)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_2_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_2_STOP_Pos)     /*!< 0x00000004 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_2_STOP       DBGMCU_AHB1FZR_DBG_LPDMA1_2_STOP_Msk                /*!< LPDMA1 channel 2
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_3_STOP_Pos   (3U)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_3_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_3_STOP_Pos)     /*!< 0x00000008 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_3_STOP       DBGMCU_AHB1FZR_DBG_LPDMA1_3_STOP_Msk                /*!< LPDMA1 channel 3
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_4_STOP_Pos   (4U)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_4_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_4_STOP_Pos)     /*!< 0x00000010 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_4_STOP       DBGMCU_AHB1FZR_DBG_LPDMA1_4_STOP_Msk                /*!< LPDMA1 channel 4
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_5_STOP_Pos   (5U)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_5_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_5_STOP_Pos)     /*!< 0x00000020 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_5_STOP       DBGMCU_AHB1FZR_DBG_LPDMA1_5_STOP_Msk                /*!< LPDMA1 channel 5
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_6_STOP_Pos   (6U)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_6_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_6_STOP_Pos)     /*!< 0x00000040 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_6_STOP       DBGMCU_AHB1FZR_DBG_LPDMA1_6_STOP_Msk                /*!< LPDMA1 channel 6
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_7_STOP_Pos   (7U)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_7_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_7_STOP_Pos)     /*!< 0x00000080 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_7_STOP       DBGMCU_AHB1FZR_DBG_LPDMA1_7_STOP_Msk                /*!< LPDMA1 channel 7
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_0_STOP_Pos   (16U)
#define DBGMCU_AHB1FZR_DBG_LPDMA2_0_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA2_0_STOP_Pos)     /*!< 0x00010000 */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_0_STOP       DBGMCU_AHB1FZR_DBG_LPDMA2_0_STOP_Msk                /*!< LPDMA2 channel 0
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_1_STOP_Pos   (17U)
#define DBGMCU_AHB1FZR_DBG_LPDMA2_1_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA2_1_STOP_Pos)     /*!< 0x00020000 */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_1_STOP       DBGMCU_AHB1FZR_DBG_LPDMA2_1_STOP_Msk                /*!< LPDMA2 channel 1
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_2_STOP_Pos   (18U)
#define DBGMCU_AHB1FZR_DBG_LPDMA2_2_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA2_2_STOP_Pos)     /*!< 0x00040000 */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_2_STOP       DBGMCU_AHB1FZR_DBG_LPDMA2_2_STOP_Msk                /*!< LPDMA2 channel 2
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_3_STOP_Pos   (19U)
#define DBGMCU_AHB1FZR_DBG_LPDMA2_3_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA2_3_STOP_Pos)     /*!< 0x00080000 */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_3_STOP       DBGMCU_AHB1FZR_DBG_LPDMA2_3_STOP_Msk                /*!< LPDMA2 channel 3
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_4_STOP_Pos   (20U)
#define DBGMCU_AHB1FZR_DBG_LPDMA2_4_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA2_4_STOP_Pos)     /*!< 0x00100000 */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_4_STOP       DBGMCU_AHB1FZR_DBG_LPDMA2_4_STOP_Msk                /*!< LPDMA2 channel 4
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_5_STOP_Pos   (21U)
#define DBGMCU_AHB1FZR_DBG_LPDMA2_5_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA2_5_STOP_Pos)     /*!< 0x00200000 */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_5_STOP       DBGMCU_AHB1FZR_DBG_LPDMA2_5_STOP_Msk                /*!< LPDMA2 channel 5
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_6_STOP_Pos   (22U)
#define DBGMCU_AHB1FZR_DBG_LPDMA2_6_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA2_6_STOP_Pos)     /*!< 0x00400000 */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_6_STOP       DBGMCU_AHB1FZR_DBG_LPDMA2_6_STOP_Msk                /*!< LPDMA2 channel 6
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_7_STOP_Pos   (23U)
#define DBGMCU_AHB1FZR_DBG_LPDMA2_7_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA2_7_STOP_Pos)     /*!< 0x00800000 */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_7_STOP       DBGMCU_AHB1FZR_DBG_LPDMA2_7_STOP_Msk                /*!< LPDMA2 channel 7
                                                                                                        stop in debug */

