MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* ***********************************  Bit definition for DBGMCU_PIDR2 register  *********************************** */
#define DBGMCU_PIDR2_JEP106ID_Pos              (0U)
#define DBGMCU_PIDR2_JEP106ID_Msk              (0x7UL << DBGMCU_PIDR2_JEP106ID_Pos)                /*!< 0x00000007 */
#define DBGMCU_PIDR2_JEP106ID                  DBGMCU_PIDR2_JEP106ID_Msk                           /*!< JEP106 identity
                                                                                                        code bits [6:4]
                                                                                                        */
#define DBGMCU_PIDR2_JEDEC_Pos                 (3U)
#define DBGMCU_PIDR2_JEDEC_Msk                 (0x1UL << DBGMCU_PIDR2_JEDEC_Pos)                   /*!< 0x00000008 */
#define DBGMCU_PIDR2_JEDEC                     DBGMCU_PIDR2_JEDEC_Msk                              /*!< JEDEC assigned
                                                                                                        value */
#define DBGMCU_PIDR2_REVISION_Pos              (4U)
#define DBGMCU_PIDR2_REVISION_Msk              (0xFUL << DBGMCU_PIDR2_REVISION_Pos)                /*!< 0x000000F0 */
#define DBGMCU_PIDR2_REVISION                  DBGMCU_PIDR2_REVISION_Msk                           /*!< Component
                                                                                                        revision number
                                                                                                        */

/* ***********************************  Bit definition for DBGMCU_PIDR3 register  *********************************** */
#define DBGMCU_PIDR3_CMOD_Pos                  (0U)
#define DBGMCU_PIDR3_CMOD_Msk                  (0xFUL << DBGMCU_PIDR3_CMOD_Pos)                    /*!< 0x0000000F */
#define DBGMCU_PIDR3_CMOD                      DBGMCU_PIDR3_CMOD_Msk                               /*!< Customer
                                                                                                        modified */
#define DBGMCU_PIDR3_REVAND_Pos                (4U)
#define DBGMCU_PIDR3_REVAND_Msk                (0xFUL << DBGMCU_PIDR3_REVAND_Pos)                  /*!< 0x000000F0 */
#define DBGMCU_PIDR3_REVAND                    DBGMCU_PIDR3_REVAND_Msk                             /*!< Metal fix
                                                                                                        version */

/* ***********************************  Bit definition for DBGMCU_CIDR0 register  *********************************** */
#define DBGMCU_CIDR0_PREAMBLE_Pos              (0U)
#define DBGMCU_CIDR0_PREAMBLE_Msk              (0xFFUL << DBGMCU_CIDR0_PREAMBLE_Pos)               /*!< 0x000000FF */
#define DBGMCU_CIDR0_PREAMBLE                  DBGMCU_CIDR0_PREAMBLE_Msk                           /*!< Component
                                                                                                        identification
                                                                                                        bits [7:0] */

/* ***********************************  Bit definition for DBGMCU_CIDR1 register  *********************************** */
#define DBGMCU_CIDR1_PREAMBLE_Pos              (0U)
#define DBGMCU_CIDR1_PREAMBLE_Msk              (0xFUL << DBGMCU_CIDR1_PREAMBLE_Pos)                /*!< 0x0000000F */
#define DBGMCU_CIDR1_PREAMBLE                  DBGMCU_CIDR1_PREAMBLE_Msk                           /*!< Component
                                                                                                        identification
                                                                                                        bits [11:8] */
#define DBGMCU_CIDR1_CLASS_Pos                 (4U)
#define DBGMCU_CIDR1_CLASS_Msk                 (0xFUL << DBGMCU_CIDR1_CLASS_Pos)                   /*!< 0x000000F0 */
#define DBGMCU_CIDR1_CLASS                     DBGMCU_CIDR1_CLASS_Msk                              /*!< Component
                                                                                                        identification
                                                                                                        bits [15:12] -
                                                                                                        component class
                                                                                                        */

/* ***********************************  Bit definition for DBGMCU_CIDR2 register  *********************************** */
#define DBGMCU_CIDR2_PREAMBLE_Pos              (0U)
#define DBGMCU_CIDR2_PREAMBLE_Msk              (0xFFUL << DBGMCU_CIDR2_PREAMBLE_Pos)               /*!< 0x000000FF */
#define DBGMCU_CIDR2_PREAMBLE                  DBGMCU_CIDR2_PREAMBLE_Msk                           /*!< Component
                                                                                                        identification
                                                                                                        bits [23:16] */

/* ***********************************  Bit definition for DBGMCU_CIDR3 register  *********************************** */
#define DBGMCU_CIDR3_PREAMBLE_Pos              (0U)
#define DBGMCU_CIDR3_PREAMBLE_Msk              (0xFFUL << DBGMCU_CIDR3_PREAMBLE_Pos)               /*!< 0x000000FF */
#define DBGMCU_CIDR3_PREAMBLE                  DBGMCU_CIDR3_PREAMBLE_Msk                           /*!< Component
                                                                                                        identification
                                                                                                        bits [31:24] */

/* ****************************************************************************************************************** */
/*                                                                                                                    */
/*                                                 Delay block (DLYB)                                                 */
/*                                                                                                                    */
/* ****************************************************************************************************************** */
/* *************************************  Bit definition for DLYB_CR register  ************************************** */
#define DLYB_CR_DEN_Pos    (0U)
#define DLYB_CR_DEN_Msk    (0x1UL << DLYB_CR_DEN_Pos)      /*!< 0x00000001 */
#define DLYB_CR_DEN        DLYB_CR_DEN_Msk                 /*!< Delay block enable bit */
#define DLYB_CR_SEN_Pos    (1U)
#define DLYB_CR_SEN_Msk    (0x1UL << DLYB_CR_SEN_Pos)      /*!< 0x00000002 */
#define DLYB_CR_SEN        DLYB_CR_SEN_Msk                 /*!< Sampler length enable bit */

/* ************************************  Bit definition for DLYB_CFGR register  ************************************* */
#define DLYB_CFGR_SEL_Pos  (0U)
#define DLYB_CFGR_SEL_Msk  (0xFUL << DLYB_CFGR_SEL_Pos)    /*!< 0x0000000F */
#define DLYB_CFGR_SEL      DLYB_CFGR_SEL_Msk               /*!< Phase for the output clock. */
#define DLYB_CFGR_SEL_0    (0x1UL << DLYB_CFGR_SEL_Pos)    /*!< 0x00000001 */
#define DLYB_CFGR_SEL_1    (0x2UL << DLYB_CFGR_SEL_Pos)    /*!< 0x00000002 */
#define DLYB_CFGR_SEL_2    (0x3UL << DLYB_CFGR_SEL_Pos)    /*!< 0x00000003 */
#define DLYB_CFGR_SEL_3    (0x8UL << DLYB_CFGR_SEL_Pos)    /*!< 0x00000008 */
#define DLYB_CFGR_UNIT_Pos (8U)
#define DLYB_CFGR_UNIT_Msk (0x7FUL << DLYB_CFGR_UNIT_Pos)  /*!< 0x00007F00 */
#define DLYB_CFGR_UNIT     DLYB_CFGR_UNIT_Msk              /*!< Delay of a unit delay cell. */
#define DLYB_CFGR_UNIT_0   (0x01UL << DLYB_CFGR_UNIT_Pos)  /*!< 0x00000100 */
#define DLYB_CFGR_UNIT_1   (0x02UL << DLYB_CFGR_UNIT_Pos)  /*!< 0x00000200 */
#define DLYB_CFGR_UNIT_2   (0x04UL << DLYB_CFGR_UNIT_Pos)  /*!< 0x00000400 */
#define DLYB_CFGR_UNIT_3   (0x08UL << DLYB_CFGR_UNIT_Pos)  /*!< 0x00000800 */
#define DLYB_CFGR_UNIT_4   (0x10UL << DLYB_CFGR_UNIT_Pos)  /*!< 0x00001000 */
#define DLYB_CFGR_UNIT_5   (0x20UL << DLYB_CFGR_UNIT_Pos)  /*!< 0x00002000 */
#define DLYB_CFGR_UNIT_6   (0x40UL << DLYB_CFGR_UNIT_Pos)  /*!< 0x00004000 */
#define DLYB_CFGR_LNG_Pos  (16U)
#define DLYB_CFGR_LNG_Msk  (0xFFFUL << DLYB_CFGR_LNG_Pos)  /*!< 0x0FFF0000 */
#define DLYB_CFGR_LNG      DLYB_CFGR_LNG_Msk               /*!< Delay line length value */
#define DLYB_CFGR_LNG_0    (0x001UL << DLYB_CFGR_LNG_Pos)  /*!< 0x00010000 */
#define DLYB_CFGR_LNG_1    (0x002UL << DLYB_CFGR_LNG_Pos)  /*!< 0x00020000 */
#define DLYB_CFGR_LNG_2    (0x004UL << DLYB_CFGR_LNG_Pos)  /*!< 0x00040000 */
#define DLYB_CFGR_LNG_3    (0x008UL << DLYB_CFGR_LNG_Pos)  /*!< 0x00080000 */
#define DLYB_CFGR_LNG_4    (0x010UL << DLYB_CFGR_LNG_Pos)  /*!< 0x00100000 */
#define DLYB_CFGR_LNG_5    (0x020UL << DLYB_CFGR_LNG_Pos)  /*!< 0x00200000 */
#define DLYB_CFGR_LNG_6    (0x040UL << DLYB_CFGR_LNG_Pos)  /*!< 0x00400000 */
#define DLYB_CFGR_LNG_7    (0x080UL << DLYB_CFGR_LNG_Pos)  /*!< 0x00800000 */
#define DLYB_CFGR_LNG_8    (0x100UL << DLYB_CFGR_LNG_Pos)  /*!< 0x01000000 */
#define DLYB_CFGR_LNG_9    (0x200UL << DLYB_CFGR_LNG_Pos)  /*!< 0x02000000 */
#define DLYB_CFGR_LNG_10   (0x400UL << DLYB_CFGR_LNG_Pos)  /*!< 0x04000000 */
#define DLYB_CFGR_LNG_11   (0x800UL << DLYB_CFGR_LNG_Pos)  /*!< 0x08000000 */
#define DLYB_CFGR_LNGF_Pos (31U)
#define DLYB_CFGR_LNGF_Msk (0x1UL << DLYB_CFGR_LNGF_Pos)   /*!< 0x80000000 */
#define DLYB_CFGR_LNGF     DLYB_CFGR_LNGF_Msk              /*!< Length valid flag */

/**********************************************************************************************************************/
/*                                                                                                                    */
/*                                         DMA Controller (DMA)                                                       */
/*                                                                                                                    */
/**********************************************************************************************************************/
/* ***********************************  Bit definition for DMA_PRIVCFGR register  *********************************** */
#define DMA_PRIVCFGR_PRIV0_Pos              (0U)
#define DMA_PRIVCFGR_PRIV0_Msk              (0x1UL << DMA_PRIVCFGR_PRIV0_Pos)       /*!< 0x00000001 */
#define DMA_PRIVCFGR_PRIV0                  DMA_PRIVCFGR_PRIV0_Msk                  /*!< Privileged State of
                                                                                           Channel 0 */
#define DMA_PRIVCFGR_PRIV1_Pos              (1U)
#define DMA_PRIVCFGR_PRIV1_Msk              (0x1UL << DMA_PRIVCFGR_PRIV1_Pos)       /*!< 0x00000002 */
#define DMA_PRIVCFGR_PRIV1                  DMA_PRIVCFGR_PRIV1_Msk                  /*!< Privileged State of
                                                                                           Channel 1  */
#define DMA_PRIVCFGR_PRIV2_Pos              (2U)
#define DMA_PRIVCFGR_PRIV2_Msk              (0x1UL << DMA_PRIVCFGR_PRIV2_Pos)       /*!< 0x00000004 */
#define DMA_PRIVCFGR_PRIV2                  DMA_PRIVCFGR_PRIV2_Msk                  /*!< Privileged State of
                                                                                           Channel 2  */
#define DMA_PRIVCFGR_PRIV3_Pos              (3U)
#define DMA_PRIVCFGR_PRIV3_Msk              (0x1UL << DMA_PRIVCFGR_PRIV3_Pos)       /*!< 0x00000008 */
#define DMA_PRIVCFGR_PRIV3                  DMA_PRIVCFGR_PRIV3_Msk                  /*!< Privileged State of
                                                                                           Channel 3  */
#define DMA_PRIVCFGR_PRIV4_Pos              (4U)
#define DMA_PRIVCFGR_PRIV4_Msk              (0x1UL << DMA_PRIVCFGR_PRIV4_Pos)       /*!< 0x00000010 */
#define DMA_PRIVCFGR_PRIV4                  DMA_PRIVCFGR_PRIV4_Msk                  /*!< Privileged State of
                                                                                           Channel 4  */
#define DMA_PRIVCFGR_PRIV5_Pos              (5U)
#define DMA_PRIVCFGR_PRIV5_Msk              (0x1UL << DMA_PRIVCFGR_PRIV5_Pos)       /*!< 0x00000020 */
#define DMA_PRIVCFGR_PRIV5                  DMA_PRIVCFGR_PRIV5_Msk                  /*!< Privileged State of
                                                                                           Channel 5  */
#define DMA_PRIVCFGR_PRIV6_Pos              (6U)
#define DMA_PRIVCFGR_PRIV6_Msk              (0x1UL << DMA_PRIVCFGR_PRIV6_Pos)       /*!< 0x00000040 */
#define DMA_PRIVCFGR_PRIV6                  DMA_PRIVCFGR_PRIV6_Msk                  /*!< Privileged State of
                                                                                           Channel 6  */
#define DMA_PRIVCFGR_PRIV7_Pos              (7U)
#define DMA_PRIVCFGR_PRIV7_Msk              (0x1UL << DMA_PRIVCFGR_PRIV7_Pos)       /*!< 0x00000080 */
#define DMA_PRIVCFGR_PRIV7                  DMA_PRIVCFGR_PRIV7_Msk                  /*!< Privileged State of
                                                                                           Channel 7  */

/* **********************************  Bit definition for DMA_RCFGLOCKR register  *********************************** */
#define DMA_RCFGLOCKR_LOCK0_Pos              (0U)
#define DMA_RCFGLOCKR_LOCK0_Msk              (0x1UL << DMA_RCFGLOCKR_LOCK0_Pos)       /*!< 0x00000001 */
#define DMA_RCFGLOCKR_LOCK0                  DMA_RCFGLOCKR_LOCK0_Msk                  /*!< Lock the configuration
                                                                                           of Channel 0  */
#define DMA_RCFGLOCKR_LOCK1_Pos              (1U)
#define DMA_RCFGLOCKR_LOCK1_Msk              (0x1UL << DMA_RCFGLOCKR_LOCK1_Pos)       /*!< 0x00000002 */
#define DMA_RCFGLOCKR_LOCK1                  DMA_RCFGLOCKR_LOCK1_Msk                  /*!< Lock the configuration
                                                                                           of Channel 1  */
#define DMA_RCFGLOCKR_LOCK2_Pos              (2U)
#define DMA_RCFGLOCKR_LOCK2_Msk              (0x1UL << DMA_RCFGLOCKR_LOCK2_Pos)       /*!< 0x00000004 */
#define DMA_RCFGLOCKR_LOCK2                  DMA_RCFGLOCKR_LOCK2_Msk                  /*!< Lock the configuration
                                                                                           of Channel 2  */
#define DMA_RCFGLOCKR_LOCK3_Pos              (3U)
#define DMA_RCFGLOCKR_LOCK3_Msk              (0x1UL << DMA_RCFGLOCKR_LOCK3_Pos)       /*!< 0x00000008 */
#define DMA_RCFGLOCKR_LOCK3                  DMA_RCFGLOCKR_LOCK3_Msk                  /*!< Lock the configuration
                                                                                           of Channel 3  */
#define DMA_RCFGLOCKR_LOCK4_Pos              (4U)
#define DMA_RCFGLOCKR_LOCK4_Msk              (0x1UL << DMA_RCFGLOCKR_LOCK4_Pos)       /*!< 0x00000010 */
#define DMA_RCFGLOCKR_LOCK4                  DMA_RCFGLOCKR_LOCK4_Msk                  /*!< Lock the configuration
                                                                                           of Channel 4  */
#define DMA_RCFGLOCKR_LOCK5_Pos              (5U)
#define DMA_RCFGLOCKR_LOCK5_Msk              (0x1UL << DMA_RCFGLOCKR_LOCK5_Pos)       /*!< 0x00000020 */
#define DMA_RCFGLOCKR_LOCK5                  DMA_RCFGLOCKR_LOCK5_Msk                  /*!< Lock the configuration
                                                                                           of Channel 5  */
#define DMA_RCFGLOCKR_LOCK6_Pos              (6U)
#define DMA_RCFGLOCKR_LOCK6_Msk              (0x1UL << DMA_RCFGLOCKR_LOCK6_Pos)       /*!< 0x00000040 */
#define DMA_RCFGLOCKR_LOCK6                  DMA_RCFGLOCKR_LOCK6_Msk                  /*!< Lock the configuration
                                                                                           of Channel 6  */
#define DMA_RCFGLOCKR_LOCK7_Pos              (7U)
#define DMA_RCFGLOCKR_LOCK7_Msk              (0x1UL << DMA_RCFGLOCKR_LOCK7_Pos)       /*!< 0x00000080 */
#define DMA_RCFGLOCKR_LOCK7                  DMA_RCFGLOCKR_LOCK7_Msk                  /*!< Lock the configuration
                                                                                           of Channel 7  */

/* *************************************  Bit definition for DMA_MISR register  ************************************* */
#define DMA_MISR_MIS0_Pos                   (0U)
#define DMA_MISR_MIS0_Msk                   (0x1UL << DMA_MISR_MIS0_Pos)            /*!< 0x00000001 */
#define DMA_MISR_MIS0                       DMA_MISR_MIS0_Msk                       /*!< Masked Interrupt State of
                                                                                         Channel 0  */
#define DMA_MISR_MIS1_Pos                   (1U)
#define DMA_MISR_MIS1_Msk                   (0x1UL << DMA_MISR_MIS1_Pos)            /*!< 0x00000002 */
#define DMA_MISR_MIS1                       DMA_MISR_MIS1_Msk                       /*!< Masked Interrupt State of
                                                                                         Channel 1  */
#define DMA_MISR_MIS2_Pos                   (2U)
#define DMA_MISR_MIS2_Msk                   (0x1UL << DMA_MISR_MIS2_Pos)            /*!< 0x00000004 */
#define DMA_MISR_MIS2                       DMA_MISR_MIS2_Msk                       /*!< Masked Interrupt State of
                                                                                         Channel 2  */
#define DMA_MISR_MIS3_Pos                   (3U)
#define DMA_MISR_MIS3_Msk                   (0x1UL << DMA_MISR_MIS3_Pos)            /*!< 0x00000008 */
#define DMA_MISR_MIS3                       DMA_MISR_MIS3_Msk                       /*!< Masked Interrupt State of
                                                                                         Channel 3  */
#define DMA_MISR_MIS4_Pos                   (4U)
#define DMA_MISR_MIS4_Msk                   (0x1UL << DMA_MISR_MIS4_Pos)            /*!< 0x00000010 */
#define DMA_MISR_MIS4                       DMA_MISR_MIS4_Msk                       /*!< Masked Interrupt State of
                                                                                         Channel 4  */
#define DMA_MISR_MIS5_Pos                   (5U)
#define DMA_MISR_MIS5_Msk                   (0x1UL << DMA_MISR_MIS5_Pos)            /*!< 0x00000020 */
#define DMA_MISR_MIS5                       DMA_MISR_MIS5_Msk                       /*!< Masked Interrupt State of
                                                                                         Channel 5  */
#define DMA_MISR_MIS6_Pos                   (6U)
#define DMA_MISR_MIS6_Msk                   (0x1UL << DMA_MISR_MIS6_Pos)            /*!< 0x00000040 */
#define DMA_MISR_MIS6                       DMA_MISR_MIS6_Msk                       /*!< Masked Interrupt State of
                                                                                         Channel 6  */
#define DMA_MISR_MIS7_Pos                   (7U)
#define DMA_MISR_MIS7_Msk                   (0x1UL << DMA_MISR_MIS7_Pos)            /*!< 0x00000080 */
#define DMA_MISR_MIS7                       DMA_MISR_MIS7_Msk                       /*!< Masked Interrupt State of
                                                                                         Channel 7  */

