MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* **********************************  Bit definition for ETH_MACQTXFCR register  *********************************** */
#define ETH_MACQTXFCR_FCB_BPA_Pos      (0U)
#define ETH_MACQTXFCR_FCB_BPA_Msk      (0x1UL << ETH_MACQTXFCR_FCB_BPA_Pos)        /*!< 0x00000001 */
#define ETH_MACQTXFCR_FCB_BPA          ETH_MACQTXFCR_FCB_BPA_Msk                   /*!< Flow Control Busy or
                                                                                        Backpressure Activate */
#define ETH_MACQTXFCR_TFE_Pos          (1U)
#define ETH_MACQTXFCR_TFE_Msk          (0x1UL << ETH_MACQTXFCR_TFE_Pos)            /*!< 0x00000002 */
#define ETH_MACQTXFCR_TFE              ETH_MACQTXFCR_TFE_Msk                       /*!< Transmit Flow Control Enable */
#define ETH_MACQTXFCR_PLT_Pos          (4U)
#define ETH_MACQTXFCR_PLT_Msk          (0x7UL << ETH_MACQTXFCR_PLT_Pos)            /*!< 0x00000070 */
#define ETH_MACQTXFCR_PLT              ETH_MACQTXFCR_PLT_Msk                       /*!< Pause Low Threshold */
#define ETH_MACQTXFCR_DZPQ_Pos         (7U)
#define ETH_MACQTXFCR_DZPQ_Msk         (0x1UL << ETH_MACQTXFCR_DZPQ_Pos)           /*!< 0x00000080 */
#define ETH_MACQTXFCR_DZPQ             ETH_MACQTXFCR_DZPQ_Msk                      /*!< Disable Zero-Quanta Pause */
#define ETH_MACQTXFCR_PT_Pos           (16U)
#define ETH_MACQTXFCR_PT_Msk           (0xFFFFUL << ETH_MACQTXFCR_PT_Pos)          /*!< 0xFFFF0000 */
#define ETH_MACQTXFCR_PT               ETH_MACQTXFCR_PT_Msk                        /*!< Pause Time */

/* ***********************************  Bit definition for ETH_MACRXFCR register  *********************************** */
#define ETH_MACRXFCR_RFE_Pos           (0U)
#define ETH_MACRXFCR_RFE_Msk           (0x1UL << ETH_MACRXFCR_RFE_Pos)             /*!< 0x00000001 */
#define ETH_MACRXFCR_RFE               ETH_MACRXFCR_RFE_Msk                        /*!< Receive Flow Control Enable */
#define ETH_MACRXFCR_UP_Pos            (1U)
#define ETH_MACRXFCR_UP_Msk            (0x1UL << ETH_MACRXFCR_UP_Pos)              /*!< 0x00000002 */
#define ETH_MACRXFCR_UP                ETH_MACRXFCR_UP_Msk                         /*!< Unicast Pause Packet Detect */

/* ************************************  Bit definition for ETH_MACISR register  ************************************ */
#define ETH_MACISR_PHYIS_Pos           (3U)
#define ETH_MACISR_PHYIS_Msk           (0x1UL << ETH_MACISR_PHYIS_Pos)             /*!< 0x00000008 */
#define ETH_MACISR_PHYIS               ETH_MACISR_PHYIS_Msk                        /*!< PHY Interrupt */
#define ETH_MACISR_PMTIS_Pos           (4U)
#define ETH_MACISR_PMTIS_Msk           (0x1UL << ETH_MACISR_PMTIS_Pos)             /*!< 0x00000010 */
#define ETH_MACISR_PMTIS               ETH_MACISR_PMTIS_Msk                        /*!< PMT Interrupt Status */
#define ETH_MACISR_LPIIS_Pos           (5U)
#define ETH_MACISR_LPIIS_Msk           (0x1UL << ETH_MACISR_LPIIS_Pos)             /*!< 0x00000020 */
#define ETH_MACISR_LPIIS               ETH_MACISR_LPIIS_Msk                        /*!< LPI Interrupt Status */
#define ETH_MACISR_MMCIS_Pos           (8U)
#define ETH_MACISR_MMCIS_Msk           (0x1UL << ETH_MACISR_MMCIS_Pos)             /*!< 0x00000100 */
#define ETH_MACISR_MMCIS               ETH_MACISR_MMCIS_Msk                        /*!< MMC Interrupt Status */
#define ETH_MACISR_MMCRXIS_Pos         (9U)
#define ETH_MACISR_MMCRXIS_Msk         (0x1UL << ETH_MACISR_MMCRXIS_Pos)           /*!< 0x00000200 */
#define ETH_MACISR_MMCRXIS             ETH_MACISR_MMCRXIS_Msk                      /*!< MMC Receive Interrupt Status */
#define ETH_MACISR_MMCTXIS_Pos         (10U)
#define ETH_MACISR_MMCTXIS_Msk         (0x1UL << ETH_MACISR_MMCTXIS_Pos)           /*!< 0x00000400 */
#define ETH_MACISR_MMCTXIS             ETH_MACISR_MMCTXIS_Msk                      /*!< MMC Transmit Interrupt Status */
#define ETH_MACISR_TSIS_Pos            (12U)
#define ETH_MACISR_TSIS_Msk            (0x1UL << ETH_MACISR_TSIS_Pos)              /*!< 0x00001000 */
#define ETH_MACISR_TSIS                ETH_MACISR_TSIS_Msk                         /*!< Timestamp Interrupt Status */
#define ETH_MACISR_TXSTSIS_Pos         (13U)
#define ETH_MACISR_TXSTSIS_Msk         (0x1UL << ETH_MACISR_TXSTSIS_Pos)           /*!< 0x00002000 */
#define ETH_MACISR_TXSTSIS             ETH_MACISR_TXSTSIS_Msk                      /*!< Transmit Status Interrupt */
#define ETH_MACISR_RXSTSIS_Pos         (14U)
#define ETH_MACISR_RXSTSIS_Msk         (0x1UL << ETH_MACISR_RXSTSIS_Pos)           /*!< 0x00004000 */
#define ETH_MACISR_RXSTSIS             ETH_MACISR_RXSTSIS_Msk                      /*!< Receive Status Interrupt */
#define ETH_MACISR_MDIOIS_Pos          (18U)
#define ETH_MACISR_MDIOIS_Msk          (0x1UL << ETH_MACISR_MDIOIS_Pos)            /*!< 0x00040000 */
#define ETH_MACISR_MDIOIS              ETH_MACISR_MDIOIS_Msk                       /*!< MDIO Interrupt Status */

/* ************************************  Bit definition for ETH_MACIER register  ************************************ */
#define ETH_MACIER_PHYIE_Pos           (3U)
#define ETH_MACIER_PHYIE_Msk           (0x1UL << ETH_MACIER_PHYIE_Pos)             /*!< 0x00000008 */
#define ETH_MACIER_PHYIE               ETH_MACIER_PHYIE_Msk                        /*!< PHY Interrupt Enable */
#define ETH_MACIER_PMTIE_Pos           (4U)
#define ETH_MACIER_PMTIE_Msk           (0x1UL << ETH_MACIER_PMTIE_Pos)             /*!< 0x00000010 */
#define ETH_MACIER_PMTIE               ETH_MACIER_PMTIE_Msk                        /*!< PMT Interrupt Enable */
#define ETH_MACIER_LPIIE_Pos           (5U)
#define ETH_MACIER_LPIIE_Msk           (0x1UL << ETH_MACIER_LPIIE_Pos)             /*!< 0x00000020 */
#define ETH_MACIER_LPIIE               ETH_MACIER_LPIIE_Msk                        /*!< LPI Interrupt Enable */
#define ETH_MACIER_TSIE_Pos            (12U)
#define ETH_MACIER_TSIE_Msk            (0x1UL << ETH_MACIER_TSIE_Pos)              /*!< 0x00001000 */
#define ETH_MACIER_TSIE                ETH_MACIER_TSIE_Msk                         /*!< Timestamp Interrupt Enable */
#define ETH_MACIER_TXSTSIE_Pos         (13U)
#define ETH_MACIER_TXSTSIE_Msk         (0x1UL << ETH_MACIER_TXSTSIE_Pos)           /*!< 0x00002000 */
#define ETH_MACIER_TXSTSIE             ETH_MACIER_TXSTSIE_Msk                      /*!< Transmit Status Interrupt Enable
                                                                                        */
#define ETH_MACIER_RXSTSIE_Pos         (14U)
#define ETH_MACIER_RXSTSIE_Msk         (0x1UL << ETH_MACIER_RXSTSIE_Pos)           /*!< 0x00004000 */
#define ETH_MACIER_RXSTSIE             ETH_MACIER_RXSTSIE_Msk                      /*!< Receive Status Interrupt Enable
                                                                                        */
#define ETH_MACIER_MDIOIE_Pos          (18U)
#define ETH_MACIER_MDIOIE_Msk          (0x1UL << ETH_MACIER_MDIOIE_Pos)            /*!< 0x00040000 */
#define ETH_MACIER_MDIOIE              ETH_MACIER_MDIOIE_Msk                       /*!< MDIO Interrupt Enable */

