MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* **************************  Bit definition for ETH_RX_ALIGNMENT_ERROR_PACKETS register  ************************** */
#define ETH_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_Pos          (0U)
#define ETH_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_Msk          (0xFFFFFFFFUL << ETH_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_Pos)     /*!< 0xFFFFFFFF */
#define ETH_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR              ETH_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_Msk                       /*!< Rx Alignment Error Packets */

/* ***************************  Bit definition for ETH_RX_UNICAST_PACKETS_GOOD register  **************************** */
#define ETH_RX_UNICAST_PACKETS_GOOD_RXUCASTG_Pos              (0U)
#define ETH_RX_UNICAST_PACKETS_GOOD_RXUCASTG_Msk              (0xFFFFFFFFUL << ETH_RX_UNICAST_PACKETS_GOOD_RXUCASTG_Pos)         /*!< 0xFFFFFFFF */
#define ETH_RX_UNICAST_PACKETS_GOOD_RXUCASTG                  ETH_RX_UNICAST_PACKETS_GOOD_RXUCASTG_Msk                           /*!< Rx Unicast Packets Good */

/* *******************************  Bit definition for ETH_TX_LPI_USEC_CNTR register  ******************************* */
#define ETH_TX_LPI_USEC_CNTR_TXLPIUSC_Pos                     (0U)
#define ETH_TX_LPI_USEC_CNTR_TXLPIUSC_Msk                     (0xFFFFFFFFUL << ETH_TX_LPI_USEC_CNTR_TXLPIUSC_Pos)                /*!< 0xFFFFFFFF */
#define ETH_TX_LPI_USEC_CNTR_TXLPIUSC                         ETH_TX_LPI_USEC_CNTR_TXLPIUSC_Msk                                  /*!< Tx LPI Microseconds Counter */

/* *******************************  Bit definition for ETH_TX_LPI_TRAN_CNTR register  ******************************* */
#define ETH_TX_LPI_TRAN_CNTR_TXLPITRC_Pos                     (0U)
#define ETH_TX_LPI_TRAN_CNTR_TXLPITRC_Msk                     (0xFFFFFFFFUL << ETH_TX_LPI_TRAN_CNTR_TXLPITRC_Pos)                /*!< 0xFFFFFFFF */
#define ETH_TX_LPI_TRAN_CNTR_TXLPITRC                         ETH_TX_LPI_TRAN_CNTR_TXLPITRC_Msk                                  /*!< Tx LPI Transition counter */

/* *******************************  Bit definition for ETH_RX_LPI_USEC_CNTR register  ******************************* */
#define ETH_RX_LPI_USEC_CNTR_RXLPIUSC_Pos                     (0U)
#define ETH_RX_LPI_USEC_CNTR_RXLPIUSC_Msk                     (0xFFFFFFFFUL << ETH_RX_LPI_USEC_CNTR_RXLPIUSC_Pos)                /*!< 0xFFFFFFFF */
#define ETH_RX_LPI_USEC_CNTR_RXLPIUSC                         ETH_RX_LPI_USEC_CNTR_RXLPIUSC_Msk                                  /*!< Rx LPI Microseconds Counter */

/* *******************************  Bit definition for ETH_RX_LPI_TRAN_CNTR register  ******************************* */
#define ETH_RX_LPI_TRAN_CNTR_RXLPITRC_Pos                     (0U)
#define ETH_RX_LPI_TRAN_CNTR_RXLPITRC_Msk                     (0xFFFFFFFFUL << ETH_RX_LPI_TRAN_CNTR_RXLPITRC_Pos)                /*!< 0xFFFFFFFF */
#define ETH_RX_LPI_TRAN_CNTR_RXLPITRC                         ETH_RX_LPI_TRAN_CNTR_RXLPITRC_Msk                                  /*!< Rx LPI Transition counter */

/* **********************************  Bit definition for ETH_MACL3L4C0R register  ********************************** */
#define ETH_MACL3L4C0R_L3PEN0_Pos      (0U)
#define ETH_MACL3L4C0R_L3PEN0_Msk      (0x1UL << ETH_MACL3L4C0R_L3PEN0_Pos)        /*!< 0x00000001 */
#define ETH_MACL3L4C0R_L3PEN0          ETH_MACL3L4C0R_L3PEN0_Msk                   /*!< Layer 3 Protocol Enable */
#define ETH_MACL3L4C0R_L3SAM0_Pos      (2U)
#define ETH_MACL3L4C0R_L3SAM0_Msk      (0x1UL << ETH_MACL3L4C0R_L3SAM0_Pos)        /*!< 0x00000004 */
#define ETH_MACL3L4C0R_L3SAM0          ETH_MACL3L4C0R_L3SAM0_Msk                   /*!< Layer 3 IP SA Match Enable */
#define ETH_MACL3L4C0R_L3SAIM0_Pos     (3U)
#define ETH_MACL3L4C0R_L3SAIM0_Msk     (0x1UL << ETH_MACL3L4C0R_L3SAIM0_Pos)       /*!< 0x00000008 */
#define ETH_MACL3L4C0R_L3SAIM0         ETH_MACL3L4C0R_L3SAIM0_Msk                  /*!< Layer 3 IP SA Inverse Match
                                                                                        Enable */
#define ETH_MACL3L4C0R_L3DAM0_Pos      (4U)
#define ETH_MACL3L4C0R_L3DAM0_Msk      (0x1UL << ETH_MACL3L4C0R_L3DAM0_Pos)        /*!< 0x00000010 */
#define ETH_MACL3L4C0R_L3DAM0          ETH_MACL3L4C0R_L3DAM0_Msk                   /*!< Layer 3 IP DA Match Enable */
#define ETH_MACL3L4C0R_L3DAIM0_Pos     (5U)
#define ETH_MACL3L4C0R_L3DAIM0_Msk     (0x1UL << ETH_MACL3L4C0R_L3DAIM0_Pos)       /*!< 0x00000020 */
#define ETH_MACL3L4C0R_L3DAIM0         ETH_MACL3L4C0R_L3DAIM0_Msk                  /*!< Layer 3 IP DA Inverse Match
                                                                                        Enable */
#define ETH_MACL3L4C0R_L3HSBM0_Pos     (6U)
#define ETH_MACL3L4C0R_L3HSBM0_Msk     (0x1FUL << ETH_MACL3L4C0R_L3HSBM0_Pos)      /*!< 0x000007C0 */
#define ETH_MACL3L4C0R_L3HSBM0         ETH_MACL3L4C0R_L3HSBM0_Msk                  /*!< Layer 3 IP SA higher bits match
                                                                                        */
#define ETH_MACL3L4C0R_L3HDBM0_Pos     (11U)
#define ETH_MACL3L4C0R_L3HDBM0_Msk     (0x1FUL << ETH_MACL3L4C0R_L3HDBM0_Pos)      /*!< 0x0000F800 */
#define ETH_MACL3L4C0R_L3HDBM0         ETH_MACL3L4C0R_L3HDBM0_Msk                  /*!< Layer 3 IP DA higher bits match
                                                                                        */
#define ETH_MACL3L4C0R_L4PEN0_Pos      (16U)
#define ETH_MACL3L4C0R_L4PEN0_Msk      (0x1UL << ETH_MACL3L4C0R_L4PEN0_Pos)        /*!< 0x00010000 */
#define ETH_MACL3L4C0R_L4PEN0          ETH_MACL3L4C0R_L4PEN0_Msk                   /*!< Layer 4 Protocol Enable */
#define ETH_MACL3L4C0R_L4SPM0_Pos      (18U)
#define ETH_MACL3L4C0R_L4SPM0_Msk      (0x1UL << ETH_MACL3L4C0R_L4SPM0_Pos)        /*!< 0x00040000 */
#define ETH_MACL3L4C0R_L4SPM0          ETH_MACL3L4C0R_L4SPM0_Msk                   /*!< Layer 4 Source Port Match Enable
                                                                                        */
#define ETH_MACL3L4C0R_L4SPIM0_Pos     (19U)
#define ETH_MACL3L4C0R_L4SPIM0_Msk     (0x1UL << ETH_MACL3L4C0R_L4SPIM0_Pos)       /*!< 0x00080000 */
#define ETH_MACL3L4C0R_L4SPIM0         ETH_MACL3L4C0R_L4SPIM0_Msk                  /*!< Layer 4 Source Port Inverse
                                                                                        Match Enable */
#define ETH_MACL3L4C0R_L4DPM0_Pos      (20U)
#define ETH_MACL3L4C0R_L4DPM0_Msk      (0x1UL << ETH_MACL3L4C0R_L4DPM0_Pos)        /*!< 0x00100000 */
#define ETH_MACL3L4C0R_L4DPM0          ETH_MACL3L4C0R_L4DPM0_Msk                   /*!< Layer 4 Destination Port Match
                                                                                        Enable */
#define ETH_MACL3L4C0R_L4DPIM0_Pos     (21U)
#define ETH_MACL3L4C0R_L4DPIM0_Msk     (0x1UL << ETH_MACL3L4C0R_L4DPIM0_Pos)       /*!< 0x00200000 */
#define ETH_MACL3L4C0R_L4DPIM0         ETH_MACL3L4C0R_L4DPIM0_Msk                  /*!< Layer 4 Destination Port Inverse
                                                                                        Match Enable */

/* ***********************************  Bit definition for ETH_MACL4A0R register  *********************************** */
#define ETH_MACL4A0R_L4SP0_Pos         (0U)
#define ETH_MACL4A0R_L4SP0_Msk         (0xFFFFUL << ETH_MACL4A0R_L4SP0_Pos)        /*!< 0x0000FFFF */
#define ETH_MACL4A0R_L4SP0             ETH_MACL4A0R_L4SP0_Msk                      /*!< Layer 4 Source Port Number Field
                                                                                        */
#define ETH_MACL4A0R_L4DP0_Pos         (16U)
#define ETH_MACL4A0R_L4DP0_Msk         (0xFFFFUL << ETH_MACL4A0R_L4DP0_Pos)        /*!< 0xFFFF0000 */
#define ETH_MACL4A0R_L4DP0             ETH_MACL4A0R_L4DP0_Msk                      /*!< Layer 4 Destination Port Number
                                                                                        Field */

/* **********************************  Bit definition for ETH_MACL3A00R register  *********************************** */
#define ETH_MACL3A00R_L3A00_Pos        (0U)
#define ETH_MACL3A00R_L3A00_Msk        (0xFFFFFFFFUL << ETH_MACL3A00R_L3A00_Pos)   /*!< 0xFFFFFFFF */
#define ETH_MACL3A00R_L3A00            ETH_MACL3A00R_L3A00_Msk                     /*!< Layer 3 Address 0 Field */

/* **********************************  Bit definition for ETH_MACL3A10R register  *********************************** */
#define ETH_MACL3A10R_L3A10_Pos        (0U)
#define ETH_MACL3A10R_L3A10_Msk        (0xFFFFFFFFUL << ETH_MACL3A10R_L3A10_Pos)   /*!< 0xFFFFFFFF */
#define ETH_MACL3A10R_L3A10            ETH_MACL3A10R_L3A10_Msk                     /*!< Layer 3 Address 1 Field */

