MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* ***********************************  Bit definition for ETH_MACATSSR register  *********************************** */
#define ETH_MACATSSR_AUXTSHI_Pos       (0U)
#define ETH_MACATSSR_AUXTSHI_Msk       (0xFFFFFFFFUL << ETH_MACATSSR_AUXTSHI_Pos)  /*!< 0xFFFFFFFF */
#define ETH_MACATSSR_AUXTSHI           ETH_MACATSSR_AUXTSHI_Msk                    /*!< Auxiliary Timestamp */

/* **********************************  Bit definition for ETH_MACTSIACR register  *********************************** */
#define ETH_MACTSIACR_OSTIAC_Pos       (0U)
#define ETH_MACTSIACR_OSTIAC_Msk       (0xFFFFFFFFUL << ETH_MACTSIACR_OSTIAC_Pos)  /*!< 0xFFFFFFFF */
#define ETH_MACTSIACR_OSTIAC           ETH_MACTSIACR_OSTIAC_Msk                    /*!< One-Step Timestamp Ingress
                                                                                        Asymmetry Correction */

/* **********************************  Bit definition for ETH_MACTSEACR register  *********************************** */
#define ETH_MACTSEACR_OSTEAC_Pos       (0U)
#define ETH_MACTSEACR_OSTEAC_Msk       (0xFFFFFFFFUL << ETH_MACTSEACR_OSTEAC_Pos)  /*!< 0xFFFFFFFF */
#define ETH_MACTSEACR_OSTEAC           ETH_MACTSEACR_OSTEAC_Msk                    /*!< One-Step Timestamp Egress
                                                                                        Asymmetry Correction */

/* **********************************  Bit definition for ETH_MACTSICNR register  *********************************** */
#define ETH_MACTSICNR_TSIC_Pos         (0U)
#define ETH_MACTSICNR_TSIC_Msk         (0xFFFFFFFFUL << ETH_MACTSICNR_TSIC_Pos)    /*!< 0xFFFFFFFF */
#define ETH_MACTSICNR_TSIC             ETH_MACTSICNR_TSIC_Msk                      /*!< Timestamp Ingress Correction */

/* **********************************  Bit definition for ETH_MACTSECNR register  *********************************** */
#define ETH_MACTSECNR_TSEC_Pos         (0U)
#define ETH_MACTSECNR_TSEC_Msk         (0xFFFFFFFFUL << ETH_MACTSECNR_TSEC_Pos)    /*!< 0xFFFFFFFF */
#define ETH_MACTSECNR_TSEC             ETH_MACTSECNR_TSEC_Msk                      /*!< Timestamp Egress Correction */

/* ***********************************  Bit definition for ETH_MACTSILR register  *********************************** */
#define ETH_MACTSILR_ITLSNS_Pos        (8U)
#define ETH_MACTSILR_ITLSNS_Msk        (0xFFUL << ETH_MACTSILR_ITLSNS_Pos)         /*!< 0x0000FF00 */
#define ETH_MACTSILR_ITLSNS            ETH_MACTSILR_ITLSNS_Msk                     /*!< Ingress Timestamp Latency, in
                                                                                        subnanoseconds */
#define ETH_MACTSILR_ITLNS_Pos         (16U)
#define ETH_MACTSILR_ITLNS_Msk         (0xFFFUL << ETH_MACTSILR_ITLNS_Pos)         /*!< 0x0FFF0000 */
#define ETH_MACTSILR_ITLNS             ETH_MACTSILR_ITLNS_Msk                      /*!< Ingress Timestamp Latency, in
                                                                                        nanoseconds */

/* ***********************************  Bit definition for ETH_MACTSELR register  *********************************** */
#define ETH_MACTSELR_ETLSNS_Pos        (8U)
#define ETH_MACTSELR_ETLSNS_Msk        (0xFFUL << ETH_MACTSELR_ETLSNS_Pos)         /*!< 0x0000FF00 */
#define ETH_MACTSELR_ETLSNS            ETH_MACTSELR_ETLSNS_Msk                     /*!< Egress Timestamp Latency, in
                                                                                        subnanoseconds */
#define ETH_MACTSELR_ETLNS_Pos         (16U)
#define ETH_MACTSELR_ETLNS_Msk         (0xFFFUL << ETH_MACTSELR_ETLNS_Pos)         /*!< 0x0FFF0000 */
#define ETH_MACTSELR_ETLNS             ETH_MACTSELR_ETLNS_Msk                      /*!< Egress Timestamp Latency, in
                                                                                        nanoseconds */

/* ***********************************  Bit definition for ETH_MACPPSCR register  *********************************** */
#define ETH_MACPPSCR_PPSCTRL_Pos       (0U)
#define ETH_MACPPSCR_PPSCTRL_Msk       (0xFUL << ETH_MACPPSCR_PPSCTRL_Pos)         /*!< 0x0000000F */
#define ETH_MACPPSCR_PPSCTRL           ETH_MACPPSCR_PPSCTRL_Msk                    /*!< PPS Output Frequency Control */
#define ETH_MACPPSCR_PPSCMD_Pos        (0U)
#define ETH_MACPPSCR_PPSCMD_Msk        (0xFUL << ETH_MACPPSCR_PPSCMD_Pos)          /*!< 0x0000000F */
#define ETH_MACPPSCR_PPSCMD            ETH_MACPPSCR_PPSCMD_Msk                     /*!< Flexible PPS Output
                                                                                        (eth_ptp_pps_out) Control */
#define ETH_MACPPSCR_PPSEN0_Pos        (4U)
#define ETH_MACPPSCR_PPSEN0_Msk        (0x1UL << ETH_MACPPSCR_PPSEN0_Pos)          /*!< 0x00000010 */
#define ETH_MACPPSCR_PPSEN0            ETH_MACPPSCR_PPSEN0_Msk                     /*!< Flexible PPS Output Mode Enable
                                                                                        */
#define ETH_MACPPSCR_TRGTMODSEL0_Pos   (5U)
#define ETH_MACPPSCR_TRGTMODSEL0_Msk   (0x3UL << ETH_MACPPSCR_TRGTMODSEL0_Pos)     /*!< 0x00000060 */
#define ETH_MACPPSCR_TRGTMODSEL0       ETH_MACPPSCR_TRGTMODSEL0_Msk                /*!< Target Time Register Mode for
                                                                                        PPS Output */
#define ETH_MACPPSCR_MCGREN0_Pos       (7U)
#define ETH_MACPPSCR_MCGREN0_Msk       (0x1UL << ETH_MACPPSCR_MCGREN0_Pos)         /*!< 0x00000080 */
#define ETH_MACPPSCR_MCGREN0           ETH_MACPPSCR_MCGREN0_Msk                    /*!< MCGR Mode Enable for PPS0 Output
                                                                                        */
#define ETH_MACPPSCR_TIMESEL_Pos       (28U)
#define ETH_MACPPSCR_TIMESEL_Msk       (0x1UL << ETH_MACPPSCR_TIMESEL_Pos)         /*!< 0x10000000 */
#define ETH_MACPPSCR_TIMESEL           ETH_MACPPSCR_TIMESEL_Msk                    /*!< Time Select */

/* **********************************  Bit definition for ETH_MACPPSTTSR register  ********************************** */
#define ETH_MACPPSTTSR_TSTRH0_Pos      (0U)
#define ETH_MACPPSTTSR_TSTRH0_Msk      (0xFFFFFFFFUL << ETH_MACPPSTTSR_TSTRH0_Pos) /*!< 0xFFFFFFFF */
#define ETH_MACPPSTTSR_TSTRH0          ETH_MACPPSTTSR_TSTRH0_Msk                   /*!< PPS Target Time Seconds Register
                                                                                        */

