MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* **********************************  Bit definition for ETH_MACPPSTTNR register  ********************************** */
#define ETH_MACPPSTTNR_TTSL0_Pos       (0U)
#define ETH_MACPPSTTNR_TTSL0_Msk       (0x7FFFFFFFUL << ETH_MACPPSTTNR_TTSL0_Pos)  /*!< 0x7FFFFFFF */
#define ETH_MACPPSTTNR_TTSL0           ETH_MACPPSTTNR_TTSL0_Msk                    /*!< Target Time Low for PPS Register
                                                                                        */
#define ETH_MACPPSTTNR_TRGTBUSY0_Pos   (31U)
#define ETH_MACPPSTTNR_TRGTBUSY0_Msk   (0x1UL << ETH_MACPPSTTNR_TRGTBUSY0_Pos)     /*!< 0x80000000 */
#define ETH_MACPPSTTNR_TRGTBUSY0       ETH_MACPPSTTNR_TRGTBUSY0_Msk                /*!< PPS Target Time Register Busy */

/* ***********************************  Bit definition for ETH_MACPPSIR register  *********************************** */
#define ETH_MACPPSIR_PPSINT0_Pos       (0U)
#define ETH_MACPPSIR_PPSINT0_Msk       (0xFFFFFFFFUL << ETH_MACPPSIR_PPSINT0_Pos)  /*!< 0xFFFFFFFF */
#define ETH_MACPPSIR_PPSINT0           ETH_MACPPSIR_PPSINT0_Msk                    /*!< PPS Output Signal Interval */

/* ***********************************  Bit definition for ETH_MACPPSWR register  *********************************** */
#define ETH_MACPPSWR_PPSWIDTH0_Pos     (0U)
#define ETH_MACPPSWR_PPSWIDTH0_Msk     (0xFFFFFFFFUL << \
                                       ETH_MACPPSWR_PPSWIDTH0_Pos)                 /*!< 0xFFFFFFFF */
#define ETH_MACPPSWR_PPSWIDTH0         ETH_MACPPSWR_PPSWIDTH0_Msk                  /*!< PPS Output Signal Width */

/* ***********************************  Bit definition for ETH_MACPOCR register  ************************************ */
#define ETH_MACPOCR_PTOEN_Pos          (0U)
#define ETH_MACPOCR_PTOEN_Msk          (0x1UL << ETH_MACPOCR_PTOEN_Pos)            /*!< 0x00000001 */
#define ETH_MACPOCR_PTOEN              ETH_MACPOCR_PTOEN_Msk                       /*!< PTP Offload Enable */
#define ETH_MACPOCR_ASYNCEN_Pos        (1U)
#define ETH_MACPOCR_ASYNCEN_Msk        (0x1UL << ETH_MACPOCR_ASYNCEN_Pos)          /*!< 0x00000002 */
#define ETH_MACPOCR_ASYNCEN            ETH_MACPOCR_ASYNCEN_Msk                     /*!< Automatic PTP SYNC message
                                                                                        Enable */
#define ETH_MACPOCR_APDREQEN_Pos       (2U)
#define ETH_MACPOCR_APDREQEN_Msk       (0x1UL << ETH_MACPOCR_APDREQEN_Pos)         /*!< 0x00000004 */
#define ETH_MACPOCR_APDREQEN           ETH_MACPOCR_APDREQEN_Msk                    /*!< Automatic PTP Pdelay_Req message
                                                                                        Enable */
#define ETH_MACPOCR_ASYNCTRIG_Pos      (4U)
#define ETH_MACPOCR_ASYNCTRIG_Msk      (0x1UL << ETH_MACPOCR_ASYNCTRIG_Pos)        /*!< 0x00000010 */
#define ETH_MACPOCR_ASYNCTRIG          ETH_MACPOCR_ASYNCTRIG_Msk                   /*!< Automatic PTP SYNC message
                                                                                        Trigger */
#define ETH_MACPOCR_APDREQTRIG_Pos     (5U)
#define ETH_MACPOCR_APDREQTRIG_Msk     (0x1UL << ETH_MACPOCR_APDREQTRIG_Pos)       /*!< 0x00000020 */
#define ETH_MACPOCR_APDREQTRIG         ETH_MACPOCR_APDREQTRIG_Msk                  /*!< Automatic PTP Pdelay_Req message
                                                                                        Trigger */
#define ETH_MACPOCR_DRRDIS_Pos         (6U)
#define ETH_MACPOCR_DRRDIS_Msk         (0x1UL << ETH_MACPOCR_DRRDIS_Pos)           /*!< 0x00000040 */
#define ETH_MACPOCR_DRRDIS             ETH_MACPOCR_DRRDIS_Msk                      /*!< Disable PTO Delay
                                                                                        Request/Response response
                                                                                        generation */
#define ETH_MACPOCR_PDRDIS_Pos         (7U)
#define ETH_MACPOCR_PDRDIS_Msk         (0x1UL << ETH_MACPOCR_PDRDIS_Pos)           /*!< 0x00000080 */
#define ETH_MACPOCR_PDRDIS             ETH_MACPOCR_PDRDIS_Msk                      /*!< Disable Peer Delay Response
                                                                                        response generation */
#define ETH_MACPOCR_DN_Pos             (8U)
#define ETH_MACPOCR_DN_Msk             (0xFFUL << ETH_MACPOCR_DN_Pos)              /*!< 0x0000FF00 */
#define ETH_MACPOCR_DN                 ETH_MACPOCR_DN_Msk                          /*!< Domain Number */

/* ***********************************  Bit definition for ETH_MACSPI0R register  *********************************** */
#define ETH_MACSPI0R_SPI0_Pos          (0U)
#define ETH_MACSPI0R_SPI0_Msk          (0xFFFFFFFFUL << ETH_MACSPI0R_SPI0_Pos)     /*!< 0xFFFFFFFF */
#define ETH_MACSPI0R_SPI0              ETH_MACSPI0R_SPI0_Msk                       /*!< Source Port Identity 0 */

/* ***********************************  Bit definition for ETH_MACSPI1R register  *********************************** */
#define ETH_MACSPI1R_SPI1_Pos          (0U)
#define ETH_MACSPI1R_SPI1_Msk          (0xFFFFFFFFUL << ETH_MACSPI1R_SPI1_Pos)     /*!< 0xFFFFFFFF */
#define ETH_MACSPI1R_SPI1              ETH_MACSPI1R_SPI1_Msk                       /*!< Source Port Identity 1 */

/* ***********************************  Bit definition for ETH_MACSPI2R register  *********************************** */
#define ETH_MACSPI2R_SPI2_Pos          (0U)
#define ETH_MACSPI2R_SPI2_Msk          (0xFFFFUL << ETH_MACSPI2R_SPI2_Pos)         /*!< 0x0000FFFF */
#define ETH_MACSPI2R_SPI2              ETH_MACSPI2R_SPI2_Msk                       /*!< Source Port Identity 2 */

/* ***********************************  Bit definition for ETH_MACLMIR register  ************************************ */
#define ETH_MACLMIR_LSI_Pos            (0U)
#define ETH_MACLMIR_LSI_Msk            (0xFFUL << ETH_MACLMIR_LSI_Pos)             /*!< 0x000000FF */
#define ETH_MACLMIR_LSI                ETH_MACLMIR_LSI_Msk                         /*!< Log Sync Interval */
#define ETH_MACLMIR_DRSYNCR_Pos        (8U)
#define ETH_MACLMIR_DRSYNCR_Msk        (0x7UL << ETH_MACLMIR_DRSYNCR_Pos)          /*!< 0x00000700 */
#define ETH_MACLMIR_DRSYNCR            ETH_MACLMIR_DRSYNCR_Msk                     /*!< Delay_Req to SYNC Ratio  */
#define ETH_MACLMIR_LMPDRI_Pos         (24U)
#define ETH_MACLMIR_LMPDRI_Msk         (0xFFUL << ETH_MACLMIR_LMPDRI_Pos)          /*!< 0xFF000000 */
#define ETH_MACLMIR_LMPDRI             ETH_MACLMIR_LMPDRI_Msk                      /*!< Log Min Pdelay_Req Interval */

