MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* **********************************  Bit definition for ETH_MTLRXQOMR register  *********************************** */
#define ETH_MTLRXQOMR_RTC_Pos          (0U)
#define ETH_MTLRXQOMR_RTC_Msk          (0x3UL << ETH_MTLRXQOMR_RTC_Pos)            /*!< 0x00000003 */
#define ETH_MTLRXQOMR_RTC              ETH_MTLRXQOMR_RTC_Msk                       /*!< Receive Queue Threshold Control
                                                                                        */
#define ETH_MTLRXQOMR_FUP_Pos          (3U)
#define ETH_MTLRXQOMR_FUP_Msk          (0x1UL << ETH_MTLRXQOMR_FUP_Pos)            /*!< 0x00000008 */
#define ETH_MTLRXQOMR_FUP              ETH_MTLRXQOMR_FUP_Msk                       /*!< Forward Undersized Good Packets
                                                                                        */
#define ETH_MTLRXQOMR_FEP_Pos          (4U)
#define ETH_MTLRXQOMR_FEP_Msk          (0x1UL << ETH_MTLRXQOMR_FEP_Pos)            /*!< 0x00000010 */
#define ETH_MTLRXQOMR_FEP              ETH_MTLRXQOMR_FEP_Msk                       /*!< Forward Error Packets */
#define ETH_MTLRXQOMR_RSF_Pos          (5U)
#define ETH_MTLRXQOMR_RSF_Msk          (0x1UL << ETH_MTLRXQOMR_RSF_Pos)            /*!< 0x00000020 */
#define ETH_MTLRXQOMR_RSF              ETH_MTLRXQOMR_RSF_Msk                       /*!< Receive Queue Store and Forward
                                                                                        */
#define ETH_MTLRXQOMR_DIS_TCP_EF_Pos   (6U)
#define ETH_MTLRXQOMR_DIS_TCP_EF_Msk   (0x1UL << ETH_MTLRXQOMR_DIS_TCP_EF_Pos)     /*!< 0x00000040 */
#define ETH_MTLRXQOMR_DIS_TCP_EF       ETH_MTLRXQOMR_DIS_TCP_EF_Msk                /*!< Disable Dropping of TCP/IP
                                                                                        Checksum Error Packets */
#define ETH_MTLRXQOMR_RQS_Pos          (20U)
#define ETH_MTLRXQOMR_RQS_Msk          (0x7UL << ETH_MTLRXQOMR_RQS_Pos)            /*!< 0x00700000 */
#define ETH_MTLRXQOMR_RQS              ETH_MTLRXQOMR_RQS_Msk                       /*!< Receive Queue Size */

/* *********************************  Bit definition for ETH_MTLRXQMPOCR register  ********************************** */
#define ETH_MTLRXQMPOCR_OVFPKTCNT_Pos  (0U)
#define ETH_MTLRXQMPOCR_OVFPKTCNT_Msk  (0x7FFUL << ETH_MTLRXQMPOCR_OVFPKTCNT_Pos)  /*!< 0x000007FF */
#define ETH_MTLRXQMPOCR_OVFPKTCNT      ETH_MTLRXQMPOCR_OVFPKTCNT_Msk               /*!< Overflow Packet Counter */
#define ETH_MTLRXQMPOCR_OVFCNTOVF_Pos  (11U)
#define ETH_MTLRXQMPOCR_OVFCNTOVF_Msk  (0x1UL << ETH_MTLRXQMPOCR_OVFCNTOVF_Pos)    /*!< 0x00000800 */
#define ETH_MTLRXQMPOCR_OVFCNTOVF      ETH_MTLRXQMPOCR_OVFCNTOVF_Msk               /*!< Overflow Counter Overflow Bit */
#define ETH_MTLRXQMPOCR_MISPKTCNT_Pos  (16U)
#define ETH_MTLRXQMPOCR_MISPKTCNT_Msk  (0x7FFUL << ETH_MTLRXQMPOCR_MISPKTCNT_Pos)  /*!< 0x07FF0000 */
#define ETH_MTLRXQMPOCR_MISPKTCNT      ETH_MTLRXQMPOCR_MISPKTCNT_Msk               /*!< Missed Packet Counter */
#define ETH_MTLRXQMPOCR_MISCNTOVF_Pos  (27U)
#define ETH_MTLRXQMPOCR_MISCNTOVF_Msk  (0x1UL << ETH_MTLRXQMPOCR_MISCNTOVF_Pos)    /*!< 0x08000000 */
#define ETH_MTLRXQMPOCR_MISCNTOVF      ETH_MTLRXQMPOCR_MISCNTOVF_Msk               /*!< Missed Packet Counter Overflow
                                                                                        Bit */

/* ***********************************  Bit definition for ETH_MTLRXQDR register  *********************************** */
#define ETH_MTLRXQDR_RWCSTS_Pos        (0U)
#define ETH_MTLRXQDR_RWCSTS_Msk        (0x1UL << ETH_MTLRXQDR_RWCSTS_Pos)          /*!< 0x00000001 */
#define ETH_MTLRXQDR_RWCSTS            ETH_MTLRXQDR_RWCSTS_Msk                     /*!< MTL Rx Queue Write Controller
                                                                                        Active Status */
#define ETH_MTLRXQDR_RRCSTS_Pos        (1U)
#define ETH_MTLRXQDR_RRCSTS_Msk        (0x3UL << ETH_MTLRXQDR_RRCSTS_Pos)          /*!< 0x00000006 */
#define ETH_MTLRXQDR_RRCSTS            ETH_MTLRXQDR_RRCSTS_Msk                     /*!< MTL Rx Queue Read Controller
                                                                                        State */
#define ETH_MTLRXQDR_RXQSTS_Pos        (4U)
#define ETH_MTLRXQDR_RXQSTS_Msk        (0x3UL << ETH_MTLRXQDR_RXQSTS_Pos)          /*!< 0x00000030 */
#define ETH_MTLRXQDR_RXQSTS            ETH_MTLRXQDR_RXQSTS_Msk                     /*!< MTL Rx Queue Fill-Level Status
                                                                                        */
#define ETH_MTLRXQDR_PRXQ_Pos          (16U)
#define ETH_MTLRXQDR_PRXQ_Msk          (0x3FFFUL << ETH_MTLRXQDR_PRXQ_Pos)         /*!< 0x3FFF0000 */
#define ETH_MTLRXQDR_PRXQ              ETH_MTLRXQDR_PRXQ_Msk                       /*!< Number of Packets in Receive
                                                                                        Queue */

/* ************************************  Bit definition for ETH_DMAMR register  ************************************* */
#define ETH_DMAMR_SWR_Pos              (0U)
#define ETH_DMAMR_SWR_Msk              (0x1UL << ETH_DMAMR_SWR_Pos)                /*!< 0x00000001 */
#define ETH_DMAMR_SWR                  ETH_DMAMR_SWR_Msk                           /*!< Software Reset */
#define ETH_DMAMR_DA_Pos               (1U)
#define ETH_DMAMR_DA_Msk               (0x1UL << ETH_DMAMR_DA_Pos)                 /*!< 0x00000002 */
#define ETH_DMAMR_DA                   ETH_DMAMR_DA_Msk                            /*!< DMA Tx or Rx Arbitration Scheme
                                                                                        */
#define ETH_DMAMR_TXPR_Pos             (11U)
#define ETH_DMAMR_TXPR_Msk             (0x1UL << ETH_DMAMR_TXPR_Pos)               /*!< 0x00000800 */
#define ETH_DMAMR_TXPR                 ETH_DMAMR_TXPR_Msk                          /*!< Transmit priority */
#define ETH_DMAMR_PR_Pos               (12U)
#define ETH_DMAMR_PR_Msk               (0x7UL << ETH_DMAMR_PR_Pos)                 /*!< 0x00007000 */
#define ETH_DMAMR_PR                   ETH_DMAMR_PR_Msk                            /*!< Priority ratio */
#define ETH_DMAMR_INTM_Pos             (16U)
#define ETH_DMAMR_INTM_Msk             (0x3UL << ETH_DMAMR_INTM_Pos)               /*!< 0x00030000 */
#define ETH_DMAMR_INTM                 ETH_DMAMR_INTM_Msk                          /*!< Interrupt Mode */

/* ***********************************  Bit definition for ETH_DMASBMR register  ************************************ */
#define ETH_DMASBMR_FB_Pos             (0U)
#define ETH_DMASBMR_FB_Msk             (0x1UL << ETH_DMASBMR_FB_Pos)               /*!< 0x00000001 */
#define ETH_DMASBMR_FB                 ETH_DMASBMR_FB_Msk                          /*!< Fixed Burst Length */
#define ETH_DMASBMR_AAL_Pos            (12U)
#define ETH_DMASBMR_AAL_Msk            (0x1UL << ETH_DMASBMR_AAL_Pos)              /*!< 0x00001000 */
#define ETH_DMASBMR_AAL                ETH_DMASBMR_AAL_Msk                         /*!< Address-Aligned Beats */
#define ETH_DMASBMR_MB_Pos             (14U)
#define ETH_DMASBMR_MB_Msk             (0x1UL << ETH_DMASBMR_MB_Pos)               /*!< 0x00004000 */
#define ETH_DMASBMR_MB                 ETH_DMASBMR_MB_Msk                          /*!< Mixed Burst */
#define ETH_DMASBMR_RB_Pos             (15U)
#define ETH_DMASBMR_RB_Msk             (0x1UL << ETH_DMASBMR_RB_Pos)               /*!< 0x00008000 */
#define ETH_DMASBMR_RB                 ETH_DMASBMR_RB_Msk                          /*!< Rebuild INCRx Burst */

