MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* ************************************  Bit definition for ETH_DMAISR register  ************************************ */
#define ETH_DMAISR_DC0IS_Pos           (0U)
#define ETH_DMAISR_DC0IS_Msk           (0x1UL << ETH_DMAISR_DC0IS_Pos)             /*!< 0x00000001 */
#define ETH_DMAISR_DC0IS               ETH_DMAISR_DC0IS_Msk                        /*!< DMA Channel Interrupt Status */
#define ETH_DMAISR_MTLIS_Pos           (16U)
#define ETH_DMAISR_MTLIS_Msk           (0x1UL << ETH_DMAISR_MTLIS_Pos)             /*!< 0x00010000 */
#define ETH_DMAISR_MTLIS               ETH_DMAISR_MTLIS_Msk                        /*!< MTL Interrupt Status */
#define ETH_DMAISR_MACIS_Pos           (17U)
#define ETH_DMAISR_MACIS_Msk           (0x1UL << ETH_DMAISR_MACIS_Pos)             /*!< 0x00020000 */
#define ETH_DMAISR_MACIS               ETH_DMAISR_MACIS_Msk                        /*!< MAC Interrupt Status */

/* ************************************  Bit definition for ETH_DMADSR register  ************************************ */
#define ETH_DMADSR_AXWHSTS_Pos         (0U)
#define ETH_DMADSR_AXWHSTS_Msk         (0x1UL << ETH_DMADSR_AXWHSTS_Pos)           /*!< 0x00000001 */
#define ETH_DMADSR_AXWHSTS             ETH_DMADSR_AXWHSTS_Msk                      /*!< AHB Master Write Channel */
#define ETH_DMADSR_RPS0_Pos            (8U)
#define ETH_DMADSR_RPS0_Msk            (0xFUL << ETH_DMADSR_RPS0_Pos)              /*!< 0x00000F00 */
#define ETH_DMADSR_RPS0                ETH_DMADSR_RPS0_Msk                         /*!< DMA Channel Receive Process
                                                                                        State */
#define ETH_DMADSR_TPS0_Pos            (12U)
#define ETH_DMADSR_TPS0_Msk            (0xFUL << ETH_DMADSR_TPS0_Pos)              /*!< 0x0000F000 */
#define ETH_DMADSR_TPS0                ETH_DMADSR_TPS0_Msk                         /*!< DMA Channel Transmit Process
                                                                                        State */

/* ************************************  Bit definition for ETH_DMACCR register  ************************************ */
#define ETH_DMACCR_MSS_Pos             (0U)
#define ETH_DMACCR_MSS_Msk             (0x3FFFUL << ETH_DMACCR_MSS_Pos)            /*!< 0x00003FFF */
#define ETH_DMACCR_MSS                 ETH_DMACCR_MSS_Msk                          /*!< Maximum Segment Size */
#define ETH_DMACCR_PBLX8_Pos           (16U)
#define ETH_DMACCR_PBLX8_Msk           (0x1UL << ETH_DMACCR_PBLX8_Pos)             /*!< 0x00010000 */
#define ETH_DMACCR_PBLX8               ETH_DMACCR_PBLX8_Msk                        /*!< 8xPBL mode */
#define ETH_DMACCR_DSL_Pos             (18U)
#define ETH_DMACCR_DSL_Msk             (0x7UL << ETH_DMACCR_DSL_Pos)               /*!< 0x001C0000 */
#define ETH_DMACCR_DSL                 ETH_DMACCR_DSL_Msk                          /*!< Descriptor Skip Length */
#define ETH_DMACCR_DRO_Pos             (26U)
#define ETH_DMACCR_DRO_Msk             (0x1UL << ETH_DMACCR_DRO_Pos)               /*!< 0x04000000 */
#define ETH_DMACCR_DRO                 ETH_DMACCR_DRO_Msk                          /*!< Descriptor refetch when OWN bit
                                                                                        is 0 */

/* ***********************************  Bit definition for ETH_DMACTXCR register  *********************************** */
#define ETH_DMACTXCR_ST_Pos            (0U)
#define ETH_DMACTXCR_ST_Msk            (0x1UL << ETH_DMACTXCR_ST_Pos)              /*!< 0x00000001 */
#define ETH_DMACTXCR_ST                ETH_DMACTXCR_ST_Msk                         /*!< Start or Stop Transmission
                                                                                        Command */
#define ETH_DMACTXCR_OSF_Pos           (4U)
#define ETH_DMACTXCR_OSF_Msk           (0x1UL << ETH_DMACTXCR_OSF_Pos)             /*!< 0x00000010 */
#define ETH_DMACTXCR_OSF               ETH_DMACTXCR_OSF_Msk                        /*!< Operate on Second Packet */
#define ETH_DMACTXCR_TSE_Pos           (12U)
#define ETH_DMACTXCR_TSE_Msk           (0x1UL << ETH_DMACTXCR_TSE_Pos)             /*!< 0x00001000 */
#define ETH_DMACTXCR_TSE               ETH_DMACTXCR_TSE_Msk                        /*!< TCP Segmentation Enabled */
#define ETH_DMACTXCR_TXPBL_Pos         (16U)
#define ETH_DMACTXCR_TXPBL_Msk         (0x3FUL << ETH_DMACTXCR_TXPBL_Pos)          /*!< 0x003F0000 */
#define ETH_DMACTXCR_TXPBL             ETH_DMACTXCR_TXPBL_Msk                      /*!< Transmit Programmable Burst
                                                                                        Length */

/* ***********************************  Bit definition for ETH_DMACRXCR register  *********************************** */
#define ETH_DMACRXCR_SR_Pos            (0U)
#define ETH_DMACRXCR_SR_Msk            (0x1UL << ETH_DMACRXCR_SR_Pos)              /*!< 0x00000001 */
#define ETH_DMACRXCR_SR                ETH_DMACRXCR_SR_Msk                         /*!< Start or Stop Receive */
#define ETH_DMACRXCR_RBSZ_Pos          (1U)
#define ETH_DMACRXCR_RBSZ_Msk          (0x3FFFUL << ETH_DMACRXCR_RBSZ_Pos)         /*!< 0x00007FFE */
#define ETH_DMACRXCR_RBSZ              ETH_DMACRXCR_RBSZ_Msk                       /*!< Receive Buffer size */
#define ETH_DMACRXCR_RXPBL_Pos         (16U)
#define ETH_DMACRXCR_RXPBL_Msk         (0x3FUL << ETH_DMACRXCR_RXPBL_Pos)          /*!< 0x003F0000 */
#define ETH_DMACRXCR_RXPBL             ETH_DMACRXCR_RXPBL_Msk                      /*!< Receive Programmable Burst
                                                                                        Length */
#define ETH_DMACRXCR_RPF_Pos           (31U)
#define ETH_DMACRXCR_RPF_Msk           (0x1UL << ETH_DMACRXCR_RPF_Pos)             /*!< 0x80000000 */
#define ETH_DMACRXCR_RPF               ETH_DMACRXCR_RPF_Msk                        /*!< DMA Rx Channel Packet Flush */

/* **********************************  Bit definition for ETH_DMACTXDLAR register  ********************************** */
#define ETH_DMACTXDLAR_TDESLA_Pos      (0U)
#define ETH_DMACTXDLAR_TDESLA_Msk      (0xFFFFFFFFUL << ETH_DMACTXDLAR_TDESLA_Pos) /*!< 0xFFFFFFFF */
#define ETH_DMACTXDLAR_TDESLA          ETH_DMACTXDLAR_TDESLA_Msk                   /*!< Start of Transmit List */

