MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* ************************************  Bit definition for EXTI_RPR1 register  ************************************* */
#define EXTI_RPR1_RPIF0_Pos       (0U)
#define EXTI_RPR1_RPIF0_Msk       (0x1UL << EXTI_RPR1_RPIF0_Pos)         /*!< 0x00000001 */
#define EXTI_RPR1_RPIF0           EXTI_RPR1_RPIF0_Msk                    /*!< configurable event input 0 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF1_Pos       (1U)
#define EXTI_RPR1_RPIF1_Msk       (0x1UL << EXTI_RPR1_RPIF1_Pos)         /*!< 0x00000002 */
#define EXTI_RPR1_RPIF1           EXTI_RPR1_RPIF1_Msk                    /*!< configurable event input 1 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF2_Pos       (2U)
#define EXTI_RPR1_RPIF2_Msk       (0x1UL << EXTI_RPR1_RPIF2_Pos)         /*!< 0x00000004 */
#define EXTI_RPR1_RPIF2           EXTI_RPR1_RPIF2_Msk                    /*!< configurable event input 2 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF3_Pos       (3U)
#define EXTI_RPR1_RPIF3_Msk       (0x1UL << EXTI_RPR1_RPIF3_Pos)         /*!< 0x00000008 */
#define EXTI_RPR1_RPIF3           EXTI_RPR1_RPIF3_Msk                    /*!< configurable event input 3 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF4_Pos       (4U)
#define EXTI_RPR1_RPIF4_Msk       (0x1UL << EXTI_RPR1_RPIF4_Pos)         /*!< 0x00000010 */
#define EXTI_RPR1_RPIF4           EXTI_RPR1_RPIF4_Msk                    /*!< configurable event input 4 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF5_Pos       (5U)
#define EXTI_RPR1_RPIF5_Msk       (0x1UL << EXTI_RPR1_RPIF5_Pos)         /*!< 0x00000020 */
#define EXTI_RPR1_RPIF5           EXTI_RPR1_RPIF5_Msk                    /*!< configurable event input 5 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF6_Pos       (6U)
#define EXTI_RPR1_RPIF6_Msk       (0x1UL << EXTI_RPR1_RPIF6_Pos)         /*!< 0x00000040 */
#define EXTI_RPR1_RPIF6           EXTI_RPR1_RPIF6_Msk                    /*!< configurable event input 6 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF7_Pos       (7U)
#define EXTI_RPR1_RPIF7_Msk       (0x1UL << EXTI_RPR1_RPIF7_Pos)         /*!< 0x00000080 */
#define EXTI_RPR1_RPIF7           EXTI_RPR1_RPIF7_Msk                    /*!< configurable event input 7 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF8_Pos       (8U)
#define EXTI_RPR1_RPIF8_Msk       (0x1UL << EXTI_RPR1_RPIF8_Pos)         /*!< 0x00000100 */
#define EXTI_RPR1_RPIF8           EXTI_RPR1_RPIF8_Msk                    /*!< configurable event input 8 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF9_Pos       (9U)
#define EXTI_RPR1_RPIF9_Msk       (0x1UL << EXTI_RPR1_RPIF9_Pos)         /*!< 0x00000200 */
#define EXTI_RPR1_RPIF9           EXTI_RPR1_RPIF9_Msk                    /*!< configurable event input 9 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF10_Pos      (10U)
#define EXTI_RPR1_RPIF10_Msk      (0x1UL << EXTI_RPR1_RPIF10_Pos)        /*!< 0x00000400 */
#define EXTI_RPR1_RPIF10          EXTI_RPR1_RPIF10_Msk                   /*!< configurable event input 10 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF11_Pos      (11U)
#define EXTI_RPR1_RPIF11_Msk      (0x1UL << EXTI_RPR1_RPIF11_Pos)        /*!< 0x00000800 */
#define EXTI_RPR1_RPIF11          EXTI_RPR1_RPIF11_Msk                   /*!< configurable event input 11 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF12_Pos      (12U)
#define EXTI_RPR1_RPIF12_Msk      (0x1UL << EXTI_RPR1_RPIF12_Pos)        /*!< 0x00001000 */
#define EXTI_RPR1_RPIF12          EXTI_RPR1_RPIF12_Msk                   /*!< configurable event input 12 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF13_Pos      (13U)
#define EXTI_RPR1_RPIF13_Msk      (0x1UL << EXTI_RPR1_RPIF13_Pos)        /*!< 0x00002000 */
#define EXTI_RPR1_RPIF13          EXTI_RPR1_RPIF13_Msk                   /*!< configurable event input 13 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF14_Pos      (14U)
#define EXTI_RPR1_RPIF14_Msk      (0x1UL << EXTI_RPR1_RPIF14_Pos)        /*!< 0x00004000 */
#define EXTI_RPR1_RPIF14          EXTI_RPR1_RPIF14_Msk                   /*!< configurable event input 14 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF15_Pos      (15U)
#define EXTI_RPR1_RPIF15_Msk      (0x1UL << EXTI_RPR1_RPIF15_Pos)        /*!< 0x00008000 */
#define EXTI_RPR1_RPIF15          EXTI_RPR1_RPIF15_Msk                   /*!< configurable event input 15 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF16_Pos      (16U)
#define EXTI_RPR1_RPIF16_Msk      (0x1UL << EXTI_RPR1_RPIF16_Pos)        /*!< 0x00010000 */
#define EXTI_RPR1_RPIF16          EXTI_RPR1_RPIF16_Msk                   /*!< configurable event input 16 rising edge
                                                                              pending bit */

/* ************************************  Bit definition for EXTI_FPR1 register  ************************************* */
#define EXTI_FPR1_FPIF0_Pos       (0U)
#define EXTI_FPR1_FPIF0_Msk       (0x1UL << EXTI_FPR1_FPIF0_Pos)         /*!< 0x00000001 */
#define EXTI_FPR1_FPIF0           EXTI_FPR1_FPIF0_Msk                    /*!< configurable event input 0 falling edge
                                                                              pending bit */
#define EXTI_FPR1_FPIF1_Pos       (1U)
#define EXTI_FPR1_FPIF1_Msk       (0x1UL << EXTI_FPR1_FPIF1_Pos)         /*!< 0x00000002 */
#define EXTI_FPR1_FPIF1           EXTI_FPR1_FPIF1_Msk                    /*!< configurable event input 1 falling edge
                                                                              pending bit */
#define EXTI_FPR1_FPIF2_Pos       (2U)
#define EXTI_FPR1_FPIF2_Msk       (0x1UL << EXTI_FPR1_FPIF2_Pos)         /*!< 0x00000004 */
#define EXTI_FPR1_FPIF2           EXTI_FPR1_FPIF2_Msk                    /*!< configurable event input 2 falling edge
                                                                              pending bit */
#define EXTI_FPR1_FPIF3_Pos       (3U)
#define EXTI_FPR1_FPIF3_Msk       (0x1UL << EXTI_FPR1_FPIF3_Pos)         /*!< 0x00000008 */
#define EXTI_FPR1_FPIF3           EXTI_FPR1_FPIF3_Msk                    /*!< configurable event input 3 falling edge
                                                                              pending bit */
#define EXTI_FPR1_FPIF4_Pos       (4U)
#define EXTI_FPR1_FPIF4_Msk       (0x1UL << EXTI_FPR1_FPIF4_Pos)         /*!< 0x00000010 */
#define EXTI_FPR1_FPIF4           EXTI_FPR1_FPIF4_Msk                    /*!< configurable event input 4 falling edge
                                                                              pending bit */
#define EXTI_FPR1_FPIF5_Pos       (5U)
#define EXTI_FPR1_FPIF5_Msk       (0x1UL << EXTI_FPR1_FPIF5_Pos)         /*!< 0x00000020 */
#define EXTI_FPR1_FPIF5           EXTI_FPR1_FPIF5_Msk                    /*!< configurable event input 5 falling edge
                                                                              pending bit */
#define EXTI_FPR1_FPIF6_Pos       (6U)
#define EXTI_FPR1_FPIF6_Msk       (0x1UL << EXTI_FPR1_FPIF6_Pos)         /*!< 0x00000040 */
#define EXTI_FPR1_FPIF6           EXTI_FPR1_FPIF6_Msk                    /*!< configurable event input 6 falling edge
                                                                              pending bit */
#define EXTI_FPR1_FPIF7_Pos       (7U)
#define EXTI_FPR1_FPIF7_Msk       (0x1UL << EXTI_FPR1_FPIF7_Pos)         /*!< 0x00000080 */
#define EXTI_FPR1_FPIF7           EXTI_FPR1_FPIF7_Msk                    /*!< configurable event input 7 falling edge
                                                                              pending bit */
#define EXTI_FPR1_FPIF8_Pos       (8U)
#define EXTI_FPR1_FPIF8_Msk       (0x1UL << EXTI_FPR1_FPIF8_Pos)         /*!< 0x00000100 */
#define EXTI_FPR1_FPIF8           EXTI_FPR1_FPIF8_Msk                    /*!< configurable event input 8 falling edge
                                                                              pending bit */
#define EXTI_FPR1_FPIF9_Pos       (9U)
#define EXTI_FPR1_FPIF9_Msk       (0x1UL << EXTI_FPR1_FPIF9_Pos)         /*!< 0x00000200 */
#define EXTI_FPR1_FPIF9           EXTI_FPR1_FPIF9_Msk                    /*!< configurable event input 9 falling edge
                                                                              pending bit */
#define EXTI_FPR1_FPIF10_Pos      (10U)
#define EXTI_FPR1_FPIF10_Msk      (0x1UL << EXTI_FPR1_FPIF10_Pos)        /*!< 0x00000400 */
#define EXTI_FPR1_FPIF10          EXTI_FPR1_FPIF10_Msk                   /*!< configurable event input 10 falling edge
                                                                              pending bit */
#define EXTI_FPR1_FPIF11_Pos      (11U)
#define EXTI_FPR1_FPIF11_Msk      (0x1UL << EXTI_FPR1_FPIF11_Pos)        /*!< 0x00000800 */
#define EXTI_FPR1_FPIF11          EXTI_FPR1_FPIF11_Msk                   /*!< configurable event input 11 falling edge
                                                                              pending bit */
#define EXTI_FPR1_FPIF12_Pos      (12U)
#define EXTI_FPR1_FPIF12_Msk      (0x1UL << EXTI_FPR1_FPIF12_Pos)        /*!< 0x00001000 */
#define EXTI_FPR1_FPIF12          EXTI_FPR1_FPIF12_Msk                   /*!< configurable event input 12 falling edge
                                                                              pending bit */
#define EXTI_FPR1_FPIF13_Pos      (13U)
#define EXTI_FPR1_FPIF13_Msk      (0x1UL << EXTI_FPR1_FPIF13_Pos)        /*!< 0x00002000 */
#define EXTI_FPR1_FPIF13          EXTI_FPR1_FPIF13_Msk                   /*!< configurable event input 13 falling edge
                                                                              pending bit */
#define EXTI_FPR1_FPIF14_Pos      (14U)
#define EXTI_FPR1_FPIF14_Msk      (0x1UL << EXTI_FPR1_FPIF14_Pos)        /*!< 0x00004000 */
#define EXTI_FPR1_FPIF14          EXTI_FPR1_FPIF14_Msk                   /*!< configurable event input 14 falling edge
                                                                              pending bit */
#define EXTI_FPR1_FPIF15_Pos      (15U)
#define EXTI_FPR1_FPIF15_Msk      (0x1UL << EXTI_FPR1_FPIF15_Pos)        /*!< 0x00008000 */
#define EXTI_FPR1_FPIF15          EXTI_FPR1_FPIF15_Msk                   /*!< configurable event input 15 falling edge
                                                                              pending bit */
#define EXTI_FPR1_FPIF16_Pos      (16U)
#define EXTI_FPR1_FPIF16_Msk      (0x1UL << EXTI_FPR1_FPIF16_Pos)        /*!< 0x00010000 */
#define EXTI_FPR1_FPIF16          EXTI_FPR1_FPIF16_Msk                   /*!< configurable event input 16 falling edge
                                                                              pending bit */

