MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* **********************************  Bit definition for EXTI_PRIVCFGR1 register  ********************************** */
#define EXTI_PRIVCFGR1_PRIV0_Pos  (0U)
#define EXTI_PRIVCFGR1_PRIV0_Msk  (0x1UL << EXTI_PRIVCFGR1_PRIV0_Pos)    /*!< 0x00000001 */
#define EXTI_PRIVCFGR1_PRIV0      EXTI_PRIVCFGR1_PRIV0_Msk               /*!< Privilege enable on event input 0 */
#define EXTI_PRIVCFGR1_PRIV1_Pos  (1U)
#define EXTI_PRIVCFGR1_PRIV1_Msk  (0x1UL << EXTI_PRIVCFGR1_PRIV1_Pos)    /*!< 0x00000002 */
#define EXTI_PRIVCFGR1_PRIV1      EXTI_PRIVCFGR1_PRIV1_Msk               /*!< Privilege enable on event input 1 */
#define EXTI_PRIVCFGR1_PRIV2_Pos  (2U)
#define EXTI_PRIVCFGR1_PRIV2_Msk  (0x1UL << EXTI_PRIVCFGR1_PRIV2_Pos)    /*!< 0x00000004 */
#define EXTI_PRIVCFGR1_PRIV2      EXTI_PRIVCFGR1_PRIV2_Msk               /*!< Privilege enable on event input 2 */
#define EXTI_PRIVCFGR1_PRIV3_Pos  (3U)
#define EXTI_PRIVCFGR1_PRIV3_Msk  (0x1UL << EXTI_PRIVCFGR1_PRIV3_Pos)    /*!< 0x00000008 */
#define EXTI_PRIVCFGR1_PRIV3      EXTI_PRIVCFGR1_PRIV3_Msk               /*!< Privilege enable on event input 3 */
#define EXTI_PRIVCFGR1_PRIV4_Pos  (4U)
#define EXTI_PRIVCFGR1_PRIV4_Msk  (0x1UL << EXTI_PRIVCFGR1_PRIV4_Pos)    /*!< 0x00000010 */
#define EXTI_PRIVCFGR1_PRIV4      EXTI_PRIVCFGR1_PRIV4_Msk               /*!< Privilege enable on event input 4 */
#define EXTI_PRIVCFGR1_PRIV5_Pos  (5U)
#define EXTI_PRIVCFGR1_PRIV5_Msk  (0x1UL << EXTI_PRIVCFGR1_PRIV5_Pos)    /*!< 0x00000020 */
#define EXTI_PRIVCFGR1_PRIV5      EXTI_PRIVCFGR1_PRIV5_Msk               /*!< Privilege enable on event input 5 */
#define EXTI_PRIVCFGR1_PRIV6_Pos  (6U)
#define EXTI_PRIVCFGR1_PRIV6_Msk  (0x1UL << EXTI_PRIVCFGR1_PRIV6_Pos)    /*!< 0x00000040 */
#define EXTI_PRIVCFGR1_PRIV6      EXTI_PRIVCFGR1_PRIV6_Msk               /*!< Privilege enable on event input 6 */
#define EXTI_PRIVCFGR1_PRIV7_Pos  (7U)
#define EXTI_PRIVCFGR1_PRIV7_Msk  (0x1UL << EXTI_PRIVCFGR1_PRIV7_Pos)    /*!< 0x00000080 */
#define EXTI_PRIVCFGR1_PRIV7      EXTI_PRIVCFGR1_PRIV7_Msk               /*!< Privilege enable on event input 7 */
#define EXTI_PRIVCFGR1_PRIV8_Pos  (8U)
#define EXTI_PRIVCFGR1_PRIV8_Msk  (0x1UL << EXTI_PRIVCFGR1_PRIV8_Pos)    /*!< 0x00000100 */
#define EXTI_PRIVCFGR1_PRIV8      EXTI_PRIVCFGR1_PRIV8_Msk               /*!< Privilege enable on event input 8 */
#define EXTI_PRIVCFGR1_PRIV9_Pos  (9U)
#define EXTI_PRIVCFGR1_PRIV9_Msk  (0x1UL << EXTI_PRIVCFGR1_PRIV9_Pos)    /*!< 0x00000200 */
#define EXTI_PRIVCFGR1_PRIV9      EXTI_PRIVCFGR1_PRIV9_Msk               /*!< Privilege enable on event input 9 */
#define EXTI_PRIVCFGR1_PRIV10_Pos (10U)
#define EXTI_PRIVCFGR1_PRIV10_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV10_Pos)   /*!< 0x00000400 */
#define EXTI_PRIVCFGR1_PRIV10     EXTI_PRIVCFGR1_PRIV10_Msk              /*!< Privilege enable on event input 10 */
#define EXTI_PRIVCFGR1_PRIV11_Pos (11U)
#define EXTI_PRIVCFGR1_PRIV11_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV11_Pos)   /*!< 0x00000800 */
#define EXTI_PRIVCFGR1_PRIV11     EXTI_PRIVCFGR1_PRIV11_Msk              /*!< Privilege enable on event input 11 */
#define EXTI_PRIVCFGR1_PRIV12_Pos (12U)
#define EXTI_PRIVCFGR1_PRIV12_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV12_Pos)   /*!< 0x00001000 */
#define EXTI_PRIVCFGR1_PRIV12     EXTI_PRIVCFGR1_PRIV12_Msk              /*!< Privilege enable on event input 12 */
#define EXTI_PRIVCFGR1_PRIV13_Pos (13U)
#define EXTI_PRIVCFGR1_PRIV13_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV13_Pos)   /*!< 0x00002000 */
#define EXTI_PRIVCFGR1_PRIV13     EXTI_PRIVCFGR1_PRIV13_Msk              /*!< Privilege enable on event input 13 */
#define EXTI_PRIVCFGR1_PRIV14_Pos (14U)
#define EXTI_PRIVCFGR1_PRIV14_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV14_Pos)   /*!< 0x00004000 */
#define EXTI_PRIVCFGR1_PRIV14     EXTI_PRIVCFGR1_PRIV14_Msk              /*!< Privilege enable on event input 14 */
#define EXTI_PRIVCFGR1_PRIV15_Pos (15U)
#define EXTI_PRIVCFGR1_PRIV15_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV15_Pos)   /*!< 0x00008000 */
#define EXTI_PRIVCFGR1_PRIV15     EXTI_PRIVCFGR1_PRIV15_Msk              /*!< Privilege enable on event input 15 */
#define EXTI_PRIVCFGR1_PRIV16_Pos (16U)
#define EXTI_PRIVCFGR1_PRIV16_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV16_Pos)   /*!< 0x00010000 */
#define EXTI_PRIVCFGR1_PRIV16     EXTI_PRIVCFGR1_PRIV16_Msk              /*!< Privilege enable on event input 16 */
#define EXTI_PRIVCFGR1_PRIV17_Pos (17U)
#define EXTI_PRIVCFGR1_PRIV17_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV17_Pos)   /*!< 0x00020000 */
#define EXTI_PRIVCFGR1_PRIV17     EXTI_PRIVCFGR1_PRIV17_Msk              /*!< Privilege enable on event input 17 */
#define EXTI_PRIVCFGR1_PRIV18_Pos (18U)
#define EXTI_PRIVCFGR1_PRIV18_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV18_Pos)   /*!< 0x00040000 */
#define EXTI_PRIVCFGR1_PRIV18     EXTI_PRIVCFGR1_PRIV18_Msk              /*!< Privilege enable on event input 18 */
#define EXTI_PRIVCFGR1_PRIV19_Pos (19U)
#define EXTI_PRIVCFGR1_PRIV19_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV19_Pos)   /*!< 0x00080000 */
#define EXTI_PRIVCFGR1_PRIV19     EXTI_PRIVCFGR1_PRIV19_Msk              /*!< Privilege enable on event input 19 */
#define EXTI_PRIVCFGR1_PRIV20_Pos (20U)
#define EXTI_PRIVCFGR1_PRIV20_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV20_Pos)   /*!< 0x00100000 */
#define EXTI_PRIVCFGR1_PRIV20     EXTI_PRIVCFGR1_PRIV20_Msk              /*!< Privilege enable on event input 20 */
#define EXTI_PRIVCFGR1_PRIV21_Pos (21U)
#define EXTI_PRIVCFGR1_PRIV21_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV21_Pos)   /*!< 0x00200000 */
#define EXTI_PRIVCFGR1_PRIV21     EXTI_PRIVCFGR1_PRIV21_Msk              /*!< Privilege enable on event input 21 */
#define EXTI_PRIVCFGR1_PRIV22_Pos (22U)
#define EXTI_PRIVCFGR1_PRIV22_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV22_Pos)   /*!< 0x00400000 */
#define EXTI_PRIVCFGR1_PRIV22     EXTI_PRIVCFGR1_PRIV22_Msk              /*!< Privilege enable on event input 22 */
#define EXTI_PRIVCFGR1_PRIV23_Pos (23U)
#define EXTI_PRIVCFGR1_PRIV23_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV23_Pos)   /*!< 0x00800000 */
#define EXTI_PRIVCFGR1_PRIV23     EXTI_PRIVCFGR1_PRIV23_Msk              /*!< Privilege enable on event input 23 */
#define EXTI_PRIVCFGR1_PRIV24_Pos (24U)
#define EXTI_PRIVCFGR1_PRIV24_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV24_Pos)   /*!< 0x01000000 */
#define EXTI_PRIVCFGR1_PRIV24     EXTI_PRIVCFGR1_PRIV24_Msk              /*!< Privilege enable on event input 24 */
#define EXTI_PRIVCFGR1_PRIV25_Pos (25U)
#define EXTI_PRIVCFGR1_PRIV25_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV25_Pos)   /*!< 0x02000000 */
#define EXTI_PRIVCFGR1_PRIV25     EXTI_PRIVCFGR1_PRIV25_Msk              /*!< Privilege enable on event input 25 */
#define EXTI_PRIVCFGR1_PRIV26_Pos (26U)
#define EXTI_PRIVCFGR1_PRIV26_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV26_Pos)   /*!< 0x04000000 */
#define EXTI_PRIVCFGR1_PRIV26     EXTI_PRIVCFGR1_PRIV26_Msk              /*!< Privilege enable on event input 26 */
#define EXTI_PRIVCFGR1_PRIV27_Pos (27U)
#define EXTI_PRIVCFGR1_PRIV27_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV27_Pos)   /*!< 0x08000000 */
#define EXTI_PRIVCFGR1_PRIV27     EXTI_PRIVCFGR1_PRIV27_Msk              /*!< Privilege enable on event input 27 */
#define EXTI_PRIVCFGR1_PRIV28_Pos (28U)
#define EXTI_PRIVCFGR1_PRIV28_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV28_Pos)   /*!< 0x10000000 */
#define EXTI_PRIVCFGR1_PRIV28     EXTI_PRIVCFGR1_PRIV28_Msk              /*!< Privilege enable on event input 28 */
#define EXTI_PRIVCFGR1_PRIV29_Pos (29U)
#define EXTI_PRIVCFGR1_PRIV29_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV29_Pos)   /*!< 0x20000000 */
#define EXTI_PRIVCFGR1_PRIV29     EXTI_PRIVCFGR1_PRIV29_Msk              /*!< Privilege enable on event input 29 */
#define EXTI_PRIVCFGR1_PRIV30_Pos (30U)
#define EXTI_PRIVCFGR1_PRIV30_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV30_Pos)   /*!< 0x40000000 */
#define EXTI_PRIVCFGR1_PRIV30     EXTI_PRIVCFGR1_PRIV30_Msk              /*!< Privilege enable on event input 30 */
#define EXTI_PRIVCFGR1_PRIV31_Pos (31U)
#define EXTI_PRIVCFGR1_PRIV31_Msk (0x1UL << EXTI_PRIVCFGR1_PRIV31_Pos)   /*!< 0x80000000 */
#define EXTI_PRIVCFGR1_PRIV31     EXTI_PRIVCFGR1_PRIV31_Msk              /*!< Privilege enable on event input 31 */

/* ************************************  Bit definition for EXTI_RTSR2 register  ************************************ */
#define EXTI_RTSR2_RT34_Pos       (2U)
#define EXTI_RTSR2_RT34_Msk       (0x1UL << EXTI_RTSR2_RT34_Pos)         /*!< 0x00000004 */
#define EXTI_RTSR2_RT34           EXTI_RTSR2_RT34_Msk                    /*!< Rising trigger event configuration bit of
                                                                              configurable event input 34 */
#define EXTI_RTSR2_RT39_Pos       (7U)
#define EXTI_RTSR2_RT39_Msk       (0x1UL << EXTI_RTSR2_RT39_Pos)          /*!< 0x00000080 */
#define EXTI_RTSR2_RT39           EXTI_RTSR2_RT39_Msk                     /*!< Rising trigger event configuration bit of
                                                                              configurable event input 39 */

/* ************************************  Bit definition for EXTI_FTSR2 register  ************************************ */
#define EXTI_FTSR2_FT34_Pos       (2U)
#define EXTI_FTSR2_FT34_Msk       (0x1UL << EXTI_FTSR2_FT34_Pos)         /*!< 0x00000004 */
#define EXTI_FTSR2_FT34           EXTI_FTSR2_FT34_Msk                    /*!< Falling trigger event configuration bit of
                                                                              configurable event input 34 */
#define EXTI_FTSR2_FT39_Pos       (7U)
#define EXTI_FTSR2_FT39_Msk       (0x1UL << EXTI_FTSR2_FT39_Pos)         /*!< 0x00000080 */
#define EXTI_FTSR2_FT39           EXTI_FTSR2_FT39_Msk                    /*!< Falling trigger event configuration bit of
                                                                              configurable event input 39 */

/* ***********************************  Bit definition for EXTI_SWIER2 register  ************************************ */
#define EXTI_SWIER2_SWI34_Pos     (2U)
#define EXTI_SWIER2_SWI34_Msk     (0x1UL << EXTI_SWIER2_SWI34_Pos)       /*!< 0x00000004 */
#define EXTI_SWIER2_SWI34         EXTI_SWIER2_SWI34_Msk                  /*!< Software Interrupt on event 34 */
#define EXTI_SWIER2_SWI39_Pos     (7U)
#define EXTI_SWIER2_SWI39_Msk     (0x1UL << EXTI_SWIER2_SWI39_Pos)       /*!< 0x00000080 */
#define EXTI_SWIER2_SWI39         EXTI_SWIER2_SWI39_Msk                  /*!< Software Interrupt on event 39 */

/* ************************************  Bit definition for EXTI_RPR2 register  ************************************* */
#define EXTI_RPR2_RPIF34_Pos      (2U)
#define EXTI_RPR2_RPIF34_Msk      (0x1UL << EXTI_RPR2_RPIF34_Pos)        /*!< 0x00000004 */
#define EXTI_RPR2_RPIF34          EXTI_RPR2_RPIF34_Msk                   /*!< configurable event inputs 34 rising edge
                                                                              pending bit */
#define EXTI_RPR2_RPIF39_Pos      (7U)
#define EXTI_RPR2_RPIF39_Msk      (0x1UL << EXTI_RPR2_RPIF39_Pos)        /*!< 0x00000080 */
#define EXTI_RPR2_RPIF39          EXTI_RPR2_RPIF39_Msk                   /*!< configurable event inputs 39 rising edge
                                                                              pending bit */

/* ************************************  Bit definition for EXTI_FPR2 register  ************************************* */
#define EXTI_FPR2_FPIF34_Pos      (2U)
#define EXTI_FPR2_FPIF34_Msk      (0x1UL << EXTI_FPR2_FPIF34_Pos)        /*!< 0x00000004 */
#define EXTI_FPR2_FPIF34          EXTI_FPR2_FPIF34_Msk                   /*!< configurable event inputs 34 falling edge
                                                                              pending bit */
#define EXTI_FPR2_FPIF39_Pos      (7U)
#define EXTI_FPR2_FPIF39_Msk      (0x1UL << EXTI_FPR2_FPIF39_Pos)        /*!< 0x00000080 */
#define EXTI_FPR2_FPIF39          EXTI_FPR2_FPIF39_Msk                   /*!< configurable event inputs 39 falling edge
                                                                              pending bit */

