MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* ************************************  Bit definition for PWR_WUSCR register  ************************************* */
#define PWR_WUSCR_CWUF1_Pos        (0U)
#define PWR_WUSCR_CWUF1_Msk        (0x1UL << PWR_WUSCR_CWUF1_Pos)          /*!< 0x00000001 */
#define PWR_WUSCR_CWUF1            PWR_WUSCR_CWUF1_Msk                     /*!< clear wake-up pin flag for WUFx (x = 7
                                                                                to 1) */
#define PWR_WUSCR_CWUF2_Pos        (1U)
#define PWR_WUSCR_CWUF2_Msk        (0x1UL << PWR_WUSCR_CWUF2_Pos)          /*!< 0x00000002 */
#define PWR_WUSCR_CWUF2            PWR_WUSCR_CWUF2_Msk                     /*!< clear wake-up pin flag for WUFx (x = 7
                                                                                to 1) */
#define PWR_WUSCR_CWUF3_Pos        (2U)
#define PWR_WUSCR_CWUF3_Msk        (0x1UL << PWR_WUSCR_CWUF3_Pos)          /*!< 0x00000004 */
#define PWR_WUSCR_CWUF3            PWR_WUSCR_CWUF3_Msk                     /*!< clear wake-up pin flag for WUFx (x = 7
                                                                               to 1) */
#define PWR_WUSCR_CWUF4_Pos        (3U)
#define PWR_WUSCR_CWUF4_Msk        (0x1UL << PWR_WUSCR_CWUF4_Pos)          /*!< 0x00000008 */
#define PWR_WUSCR_CWUF4            PWR_WUSCR_CWUF4_Msk                     /*!< clear wake-up pin flag for WUFx (x = 7
                                                                                to 1) */
#define PWR_WUSCR_CWUF5_Pos        (4U)
#define PWR_WUSCR_CWUF5_Msk        (0x1UL << PWR_WUSCR_CWUF5_Pos)          /*!< 0x00000010 */
#define PWR_WUSCR_CWUF5            PWR_WUSCR_CWUF5_Msk                     /*!< clear wake-up pin flag for WUFx (x = 7
                                                                                to 1) */
#define PWR_WUSCR_CWUF6_Pos        (5U)
#define PWR_WUSCR_CWUF6_Msk        (0x1UL << PWR_WUSCR_CWUF6_Pos)          /*!< 0x00000020 */
#define PWR_WUSCR_CWUF6            PWR_WUSCR_CWUF6_Msk                     /*!< clear wake-up pin flag for WUFx (x = 7
                                                                                to 1) */
#define PWR_WUSCR_CWUF7_Pos        (6U)
#define PWR_WUSCR_CWUF7_Msk        (0x1UL << PWR_WUSCR_CWUF7_Pos)          /*!< 0x00000040 */
#define PWR_WUSCR_CWUF7            PWR_WUSCR_CWUF7_Msk                     /*!< clear wake-up pin flag for WUFx (x = 7
                                                                                to 1) */

/* *************************************  Bit definition for PWR_WUSR register  ************************************* */
#define PWR_WUSR_WUF1_Pos          (0U)
#define PWR_WUSR_WUF1_Msk          (0x1UL << PWR_WUSR_WUF1_Pos)            /*!< 0x00000001 */
#define PWR_WUSR_WUF1              PWR_WUSR_WUF1_Msk                       /*!< wake-up pin WUFx flag */
#define PWR_WUSR_WUF2_Pos          (1U)
#define PWR_WUSR_WUF2_Msk          (0x1UL << PWR_WUSR_WUF2_Pos)            /*!< 0x00000002 */
#define PWR_WUSR_WUF2              PWR_WUSR_WUF2_Msk                       /*!< wake-up pin WUFx flag */
#define PWR_WUSR_WUF3_Pos          (2U)
#define PWR_WUSR_WUF3_Msk          (0x1UL << PWR_WUSR_WUF3_Pos)            /*!< 0x00000004 */
#define PWR_WUSR_WUF3              PWR_WUSR_WUF3_Msk                       /*!< wake-up pin WUFx flag */
#define PWR_WUSR_WUF4_Pos          (3U)
#define PWR_WUSR_WUF4_Msk          (0x1UL << PWR_WUSR_WUF4_Pos)            /*!< 0x00000008 */
#define PWR_WUSR_WUF4              PWR_WUSR_WUF4_Msk                       /*!< wake-up pin WUFx flag */
#define PWR_WUSR_WUF5_Pos          (4U)
#define PWR_WUSR_WUF5_Msk          (0x1UL << PWR_WUSR_WUF5_Pos)            /*!< 0x00000010 */
#define PWR_WUSR_WUF5              PWR_WUSR_WUF5_Msk                       /*!< wake-up pin WUFx flag */
#define PWR_WUSR_WUF6_Pos          (5U)
#define PWR_WUSR_WUF6_Msk          (0x1UL << PWR_WUSR_WUF6_Pos)            /*!< 0x00000020 */
#define PWR_WUSR_WUF6              PWR_WUSR_WUF6_Msk                       /*!< wake-up pin WUFx flag */
#define PWR_WUSR_WUF7_Pos          (6U)
#define PWR_WUSR_WUF7_Msk          (0x1UL << PWR_WUSR_WUF7_Pos)            /*!< 0x00000040 */
#define PWR_WUSR_WUF7              PWR_WUSR_WUF7_Msk                       /*!< wake-up pin WUFx flag */

/* *************************************  Bit definition for PWR_WUCR register  ************************************* */
#define PWR_WUCR_WUPEN1_Pos        (0U)
#define PWR_WUCR_WUPEN1_Msk        (0x1UL << PWR_WUCR_WUPEN1_Pos)          /*!< 0x00000001 */
#define PWR_WUCR_WUPEN1            PWR_WUCR_WUPEN1_Msk                     /*!< Enable wake-up pin WKUPx (x = 7 to 1) */
#define PWR_WUCR_WUPEN2_Pos        (1U)
#define PWR_WUCR_WUPEN2_Msk        (0x1UL << PWR_WUCR_WUPEN2_Pos)          /*!< 0x00000002 */
#define PWR_WUCR_WUPEN2            PWR_WUCR_WUPEN2_Msk                     /*!< Enable wake-up pin WKUPx (x = 7 to 1) */
#define PWR_WUCR_WUPEN3_Pos        (2U)
#define PWR_WUCR_WUPEN3_Msk        (0x1UL << PWR_WUCR_WUPEN3_Pos)          /*!< 0x00000004 */
#define PWR_WUCR_WUPEN3            PWR_WUCR_WUPEN3_Msk                     /*!< Enable wake-up pin WKUPx (x = 7 to 1) */
#define PWR_WUCR_WUPEN4_Pos        (3U)
#define PWR_WUCR_WUPEN4_Msk        (0x1UL << PWR_WUCR_WUPEN4_Pos)          /*!< 0x00000008 */
#define PWR_WUCR_WUPEN4            PWR_WUCR_WUPEN4_Msk                     /*!< Enable wake-up pin WKUPx (x = 7 to 1) */
#define PWR_WUCR_WUPEN5_Pos        (4U)
#define PWR_WUCR_WUPEN5_Msk        (0x1UL << PWR_WUCR_WUPEN5_Pos)          /*!< 0x00000010 */
#define PWR_WUCR_WUPEN5            PWR_WUCR_WUPEN5_Msk                     /*!< Enable wake-up pin WKUPx (x = 7 to 1) */
#define PWR_WUCR_WUPEN6_Pos        (5U)
#define PWR_WUCR_WUPEN6_Msk        (0x1UL << PWR_WUCR_WUPEN6_Pos)          /*!< 0x00000020 */
#define PWR_WUCR_WUPEN6            PWR_WUCR_WUPEN6_Msk                     /*!< Enable wake-up pin WKUPx (x = 7 to 1) */
#define PWR_WUCR_WUPEN7_Pos        (6U)
#define PWR_WUCR_WUPEN7_Msk        (0x1UL << PWR_WUCR_WUPEN7_Pos)          /*!< 0x00000040 */
#define PWR_WUCR_WUPEN7            PWR_WUCR_WUPEN7_Msk                     /*!< Enable wake-up pin WKUPx (x = 7 to 1) */
#define PWR_WUCR_WUPP1_Pos         (8U)
#define PWR_WUCR_WUPP1_Msk         (0x1UL << PWR_WUCR_WUPP1_Pos)           /*!< 0x00000100 */
#define PWR_WUCR_WUPP1             PWR_WUCR_WUPP1_Msk                      /*!< Wake-up pin polarity bit for WKUPx
                                                                                (x = 7 to 1) */
#define PWR_WUCR_WUPP2_Pos         (9U)
#define PWR_WUCR_WUPP2_Msk         (0x1UL << PWR_WUCR_WUPP2_Pos)           /*!< 0x00000200 */
#define PWR_WUCR_WUPP2             PWR_WUCR_WUPP2_Msk                      /*!< Wake-up pin polarity bit for WKUPx
                                                                                (x = 7 to 1) */
#define PWR_WUCR_WUPP3_Pos         (10U)
#define PWR_WUCR_WUPP3_Msk         (0x1UL << PWR_WUCR_WUPP3_Pos)           /*!< 0x00000400 */
#define PWR_WUCR_WUPP3             PWR_WUCR_WUPP3_Msk                      /*!< Wake-up pin polarity bit for WKUPx
                                                                                (x = 7 to 1) */
#define PWR_WUCR_WUPP4_Pos         (11U)
#define PWR_WUCR_WUPP4_Msk         (0x1UL << PWR_WUCR_WUPP4_Pos)           /*!< 0x00000800 */
#define PWR_WUCR_WUPP4             PWR_WUCR_WUPP4_Msk                      /*!< Wake-up pin polarity bit for WKUPx
                                                                                (x = 7 to 1) */
#define PWR_WUCR_WUPP5_Pos         (12U)
#define PWR_WUCR_WUPP5_Msk         (0x1UL << PWR_WUCR_WUPP5_Pos)           /*!< 0x00001000 */
#define PWR_WUCR_WUPP5             PWR_WUCR_WUPP5_Msk                      /*!< Wake-up pin polarity bit for WKUPx
                                                                                (x = 7 to 1) */
#define PWR_WUCR_WUPP6_Pos         (13U)
#define PWR_WUCR_WUPP6_Msk         (0x1UL << PWR_WUCR_WUPP6_Pos)           /*!< 0x00002000 */
#define PWR_WUCR_WUPP6             PWR_WUCR_WUPP6_Msk                      /*!< Wake-up pin polarity bit for WKUPx
                                                                                (x = 7 to 1) */
#define PWR_WUCR_WUPP7_Pos         (14U)
#define PWR_WUCR_WUPP7_Msk         (0x1UL << PWR_WUCR_WUPP7_Pos)           /*!< 0x00004000 */
#define PWR_WUCR_WUPP7             PWR_WUCR_WUPP7_Msk                      /*!< Wake-up pin polarity bit for WKUPx
                                                                                (x = 7 to 1) */
#define PWR_WUCR_WUPPUPD1_Pos      (16U)
#define PWR_WUCR_WUPPUPD1_Msk      (0x3UL << PWR_WUCR_WUPPUPD1_Pos)        /*!< 0x00030000 */
#define PWR_WUCR_WUPPUPD1          PWR_WUCR_WUPPUPD1_Msk                   /*!< Wake-up pin pull configuration for WKUPx
                                                                                (x = 7 to 1) */
#define PWR_WUCR_WUPPUPD1_0        (0x1UL << PWR_WUCR_WUPPUPD1_Pos)        /*!< 0x00010000 */
#define PWR_WUCR_WUPPUPD1_1        (0x2UL << PWR_WUCR_WUPPUPD1_Pos)        /*!< 0x00020000 */
#define PWR_WUCR_WUPPUPD2_Pos      (18U)
#define PWR_WUCR_WUPPUPD2_Msk      (0x3UL << PWR_WUCR_WUPPUPD2_Pos)        /*!< 0x000C0000 */
#define PWR_WUCR_WUPPUPD2          PWR_WUCR_WUPPUPD2_Msk                   /*!< Wake-up pin pull configuration for WKUPx
                                                                                (x = 7 to 1) */
#define PWR_WUCR_WUPPUPD2_0        (0x1UL << PWR_WUCR_WUPPUPD2_Pos)        /*!< 0x00040000 */
#define PWR_WUCR_WUPPUPD2_1        (0x2UL << PWR_WUCR_WUPPUPD2_Pos)        /*!< 0x00080000 */
#define PWR_WUCR_WUPPUPD3_Pos      (20U)
#define PWR_WUCR_WUPPUPD3_Msk      (0x3UL << PWR_WUCR_WUPPUPD3_Pos)        /*!< 0x00300000 */
#define PWR_WUCR_WUPPUPD3          PWR_WUCR_WUPPUPD3_Msk                   /*!< Wake-up pin pull configuration for WKUPx
                                                                                (x = 7 to 1) */
#define PWR_WUCR_WUPPUPD3_0        (0x1UL << PWR_WUCR_WUPPUPD3_Pos)        /*!< 0x00100000 */
#define PWR_WUCR_WUPPUPD3_1        (0x2UL << PWR_WUCR_WUPPUPD3_Pos)        /*!< 0x00200000 */
#define PWR_WUCR_WUPPUPD4_Pos      (22U)
#define PWR_WUCR_WUPPUPD4_Msk      (0x3UL << PWR_WUCR_WUPPUPD4_Pos)        /*!< 0x00C00000 */
#define PWR_WUCR_WUPPUPD4          PWR_WUCR_WUPPUPD4_Msk                   /*!< Wake-up pin pull configuration for WKUPx
                                                                                (x = 7 to 1) */
#define PWR_WUCR_WUPPUPD4_0        (0x1UL << PWR_WUCR_WUPPUPD4_Pos)        /*!< 0x00400000 */
#define PWR_WUCR_WUPPUPD4_1        (0x2UL << PWR_WUCR_WUPPUPD4_Pos)        /*!< 0x00800000 */
#define PWR_WUCR_WUPPUPD5_Pos      (24U)
#define PWR_WUCR_WUPPUPD5_Msk      (0x3UL << PWR_WUCR_WUPPUPD5_Pos)        /*!< 0x03000000 */
#define PWR_WUCR_WUPPUPD5          PWR_WUCR_WUPPUPD5_Msk                   /*!< Wake-up pin pull configuration for WKUPx
                                                                                (x = 7 to 1) */
#define PWR_WUCR_WUPPUPD5_0        (0x1UL << PWR_WUCR_WUPPUPD5_Pos)        /*!< 0x01000000 */
#define PWR_WUCR_WUPPUPD5_1        (0x2UL << PWR_WUCR_WUPPUPD5_Pos)        /*!< 0x02000000 */
#define PWR_WUCR_WUPPUPD6_Pos      (26U)
#define PWR_WUCR_WUPPUPD6_Msk      (0x3UL << PWR_WUCR_WUPPUPD6_Pos)        /*!< 0x0C000000 */
#define PWR_WUCR_WUPPUPD6          PWR_WUCR_WUPPUPD6_Msk                   /*!< Wake-up pin pull configuration for WKUPx
                                                                                (x = 7 to 1) */
#define PWR_WUCR_WUPPUPD6_0        (0x1UL << PWR_WUCR_WUPPUPD6_Pos)        /*!< 0x04000000 */
#define PWR_WUCR_WUPPUPD6_1        (0x2UL << PWR_WUCR_WUPPUPD6_Pos)        /*!< 0x08000000 */
#define PWR_WUCR_WUPPUPD7_Pos      (28U)
#define PWR_WUCR_WUPPUPD7_Msk      (0x3UL << PWR_WUCR_WUPPUPD7_Pos)        /*!< 0x30000000 */
#define PWR_WUCR_WUPPUPD7          PWR_WUCR_WUPPUPD7_Msk                   /*!< Wake-up pin pull configuration for WKUPx
                                                                                (x = 7 to 1) */
#define PWR_WUCR_WUPPUPD7_0        (0x1UL << PWR_WUCR_WUPPUPD7_Pos)        /*!< 0x10000000 */
#define PWR_WUCR_WUPPUPD7_1        (0x2UL << PWR_WUCR_WUPPUPD7_Pos)        /*!< 0x20000000 */

/* ************************************  Bit definition for PWR_IORETR register  ************************************ */
#define PWR_IORETR_IORETEN_Pos     (0U)
#define PWR_IORETR_IORETEN_Msk     (0x1UL << PWR_IORETR_IORETEN_Pos)       /*!< 0x00000001 */
#define PWR_IORETR_IORETEN         PWR_IORETR_IORETEN_Msk                  /*!< IO retention enable */
#define PWR_IORETR_JTAGIORETEN_Pos (16U)
#define PWR_IORETR_JTAGIORETEN_Msk (0x1UL << PWR_IORETR_JTAGIORETEN_Pos)   /*!< 0x00010000 */
#define PWR_IORETR_JTAGIORETEN     PWR_IORETR_JTAGIORETEN_Msk              /*!< IO retention enable for JTAG I/Os */

/* ***********************************  Bit definition for PWR_PRIVCFGR register  *********************************** */
#define PWR_PRIVCFGR_PRIV_Pos      (1U)
#define PWR_PRIVCFGR_PRIV_Msk      (0x1UL << PWR_PRIVCFGR_PRIV_Pos)        /*!< 0x00000002 */
#define PWR_PRIVCFGR_PRIV          PWR_PRIVCFGR_PRIV_Msk                   /*!< PWR nonsecure functions privilege
                                                                                configuration */

/* ****************************************************************************************************************** */
/*                                                                                                                    */
/*                                            Public key accelerator (PKA)                                            */
/*                                                                                                                    */
/* ****************************************************************************************************************** */
/* **************************************  Bit definition for PKA_CR register  ************************************** */
#define PKA_CR_EN_Pos           (0U)
#define PKA_CR_EN_Msk           (0x1UL << PKA_CR_EN_Pos)             /*!< 0x00000001 */
#define PKA_CR_EN               PKA_CR_EN_Msk                        /*!< PKA enable */
#define PKA_CR_START_Pos        (1U)
#define PKA_CR_START_Msk        (0x1UL << PKA_CR_START_Pos)          /*!< 0x00000002 */
#define PKA_CR_START            PKA_CR_START_Msk                     /*!< start the operation */
#define PKA_CR_MODE_Pos         (8U)
#define PKA_CR_MODE_Msk         (0x3FUL << PKA_CR_MODE_Pos)          /*!< 0x00003F00 */
#define PKA_CR_MODE             PKA_CR_MODE_Msk                      /*!< PKA operation code */
#define PKA_CR_MODE_0           (0x01UL << PKA_CR_MODE_Pos)          /*!< 0x00000100 */
#define PKA_CR_MODE_1           (0x02UL << PKA_CR_MODE_Pos)          /*!< 0x00000200 */
#define PKA_CR_MODE_2           (0x04UL << PKA_CR_MODE_Pos)          /*!< 0x00000400 */
#define PKA_CR_MODE_3           (0x08UL << PKA_CR_MODE_Pos)          /*!< 0x00000800 */
#define PKA_CR_MODE_4           (0x10UL << PKA_CR_MODE_Pos)          /*!< 0x00001000 */
#define PKA_CR_MODE_5           (0x20UL << PKA_CR_MODE_Pos)          /*!< 0x00002000 */
#define PKA_CR_PROCENDIE_Pos    (17U)
#define PKA_CR_PROCENDIE_Msk    (0x1UL << PKA_CR_PROCENDIE_Pos)      /*!< 0x00020000 */
#define PKA_CR_PROCENDIE        PKA_CR_PROCENDIE_Msk                 /*!< End of operation interrupt enable */
#define PKA_CR_RAMERRIE_Pos     (19U)
#define PKA_CR_RAMERRIE_Msk     (0x1UL << PKA_CR_RAMERRIE_Pos)       /*!< 0x00080000 */
#define PKA_CR_RAMERRIE         PKA_CR_RAMERRIE_Msk                  /*!< RAM error interrupt enable */
#define PKA_CR_ADDRERRIE_Pos    (20U)
#define PKA_CR_ADDRERRIE_Msk    (0x1UL << PKA_CR_ADDRERRIE_Pos)      /*!< 0x00100000 */
#define PKA_CR_ADDRERRIE        PKA_CR_ADDRERRIE_Msk                 /*!< Address error interrupt enable */
#define PKA_CR_OPERRIE_Pos      (21U)
#define PKA_CR_OPERRIE_Msk      (0x1UL << PKA_CR_OPERRIE_Pos)        /*!< 0x00200000 */
#define PKA_CR_OPERRIE          PKA_CR_OPERRIE_Msk                   /*!< Operation error interrupt enable */
#define PKA_CR_CMFIE_Pos        (22U)
#define PKA_CR_CMFIE_Msk        (0x1UL << PKA_CR_CMFIE_Pos)          /*!< 0x00400000 */
#define PKA_CR_CMFIE            PKA_CR_CMFIE_Msk                     /*!< Chaining mode flags interrupt enable */

/* **************************************  Bit definition for PKA_SR register  ************************************** */
#define PKA_SR_INITOK_Pos       (0U)
#define PKA_SR_INITOK_Msk       (0x1UL << PKA_SR_INITOK_Pos)         /*!< 0x00000001 */
#define PKA_SR_INITOK           PKA_SR_INITOK_Msk                    /*!< PKA initialization OK */
#define PKA_SR_LMF_Pos          (1U)
#define PKA_SR_LMF_Msk          (0x1UL << PKA_SR_LMF_Pos)            /*!< 0x00000002 */
#define PKA_SR_LMF              PKA_SR_LMF_Msk                       /*!< Limited mode flag */
#define PKA_SR_CCEN_Pos         (2U)
#define PKA_SR_CCEN_Msk         (0x1UL << PKA_SR_CCEN_Pos)           /*!< 0x00000004 */
#define PKA_SR_CCEN             PKA_SR_CCEN_Msk                      /*!< Coupling and chaining mode enable */
#define PKA_SR_RNGOKF_Pos       (8U)
#define PKA_SR_RNGOKF_Msk       (0x1UL << PKA_SR_RNGOKF_Pos)         /*!< 0x00000100 */
#define PKA_SR_RNGOKF           PKA_SR_RNGOKF_Msk                    /*!< RNG OK flag */
#define PKA_SR_DATAOKF_Pos      (9U)
#define PKA_SR_DATAOKF_Msk      (0x1UL << PKA_SR_DATAOKF_Pos)        /*!< 0x00000200 */
#define PKA_SR_DATAOKF          PKA_SR_DATAOKF_Msk                   /*!< Data OK flag */
#define PKA_SR_INCRERRF_Pos     (10U)
#define PKA_SR_INCRERRF_Msk     (0x1UL << PKA_SR_INCRERRF_Pos)       /*!< 0x00000400 */
#define PKA_SR_INCRERRF         PKA_SR_INCRERRF_Msk                  /*!< Increment error flag */
#define PKA_SR_DATAZF_Pos       (11U)
#define PKA_SR_DATAZF_Msk       (0x1UL << PKA_SR_DATAZF_Pos)         /*!< 0x00000800 */
#define PKA_SR_DATAZF           PKA_SR_DATAZF_Msk                    /*!< Data 0-ed error flag */
#define PKA_SR_TRZERRF_Pos      (12U)
#define PKA_SR_TRZERRF_Msk      (0x1UL << PKA_SR_TRZERRF_Pos)        /*!< 0x00001000 */
#define PKA_SR_TRZERRF          PKA_SR_TRZERRF_Msk                   /*!< Trailing 0s error flag */
#define PKA_SR_MDERRF_Pos       (13U)
#define PKA_SR_MDERRF_Msk       (0x1UL << PKA_SR_MDERRF_Pos)         /*!< 0x00002000 */
#define PKA_SR_MDERRF           PKA_SR_MDERRF_Msk                    /*!< Mode error flag */
#define PKA_SR_RNGERRF_Pos      (14U)
#define PKA_SR_RNGERRF_Msk      (0x1UL << PKA_SR_RNGERRF_Pos)        /*!< 0x00004000 */
#define PKA_SR_RNGERRF          PKA_SR_RNGERRF_Msk                   /*!< RNG error flag */
#define PKA_SR_BUSY_Pos         (16U)
#define PKA_SR_BUSY_Msk         (0x1UL << PKA_SR_BUSY_Pos)           /*!< 0x00010000 */
#define PKA_SR_BUSY             PKA_SR_BUSY_Msk                      /*!< Busy flag */
#define PKA_SR_PROCENDF_Pos     (17U)
#define PKA_SR_PROCENDF_Msk     (0x1UL << PKA_SR_PROCENDF_Pos)       /*!< 0x00020000 */
#define PKA_SR_PROCENDF         PKA_SR_PROCENDF_Msk                  /*!< PKA end of operation flag */
#define PKA_SR_RAMERRF_Pos      (19U)
#define PKA_SR_RAMERRF_Msk      (0x1UL << PKA_SR_RAMERRF_Pos)        /*!< 0x00080000 */
#define PKA_SR_RAMERRF          PKA_SR_RAMERRF_Msk                   /*!< PKA RAM error flag */
#define PKA_SR_ADDRERRF_Pos     (20U)
#define PKA_SR_ADDRERRF_Msk     (0x1UL << PKA_SR_ADDRERRF_Pos)       /*!< 0x00100000 */
#define PKA_SR_ADDRERRF         PKA_SR_ADDRERRF_Msk                  /*!< Address error flag */
#define PKA_SR_OPERRF_Pos       (21U)
#define PKA_SR_OPERRF_Msk       (0x1UL << PKA_SR_OPERRF_Pos)         /*!< 0x00200000 */
#define PKA_SR_OPERRF           PKA_SR_OPERRF_Msk                    /*!< Operation error flag */
#define PKA_SR_CMF_Pos          (22U)
#define PKA_SR_CMF_Msk          (0x1UL << PKA_SR_CMF_Pos)            /*!< 0x00400000 */
#define PKA_SR_CMF              PKA_SR_CMF_Msk                       /*!< Chaining mode flags */

