MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* Montgomery multiplication output data */
#define PKA_MONTGOMERY_MUL_OUT_RESULT                  ((0x0E78UL - PKA_RAM_OFFSET)>>2)    /*!< Output result */

/* Generic Arithmetic input data */
#define PKA_ARITHMETIC_ALL_OPS_NB_BITS                 ((0x0408UL - PKA_RAM_OFFSET)>>2)    /*!< Input operand number of bits */
#define PKA_ARITHMETIC_ALL_OPS_IN_OP1                  ((0x0A50UL - PKA_RAM_OFFSET)>>2)    /*!< Input operand op1 */
#define PKA_ARITHMETIC_ALL_OPS_IN_OP2                  ((0x0C68UL - PKA_RAM_OFFSET)>>2)    /*!< Input operand op2 */
#define PKA_ARITHMETIC_ALL_OPS_IN_OP3                  ((0x1088UL - PKA_RAM_OFFSET)>>2)    /*!< Input operand op2 */

/* Generic Arithmetic output data */
#define PKA_ARITHMETIC_ALL_OPS_OUT_RESULT              ((0x0E78UL - PKA_RAM_OFFSET)>>2)    /*!< Output result for arithmetic operations */

/* Compute ECC complete addition input data */
#define PKA_ECC_COMPLETE_ADD_IN_MOD_NB_BITS            ((0x0408UL - PKA_RAM_OFFSET)>>2)    /*!< Input Modulus number of bits */
#define PKA_ECC_COMPLETE_ADD_IN_A_COEFF_SIGN           ((0x0410UL - PKA_RAM_OFFSET)>>2)    /*!< Input sign of the 'a' coefficient */
#define PKA_ECC_COMPLETE_ADD_IN_A_COEFF                ((0x0418UL - PKA_RAM_OFFSET)>>2)    /*!< Input ECC curve '|a|' coefficient */
#define PKA_ECC_COMPLETE_ADD_IN_MOD_P                  ((0x0470UL - PKA_RAM_OFFSET)>>2)    /*!< Input modulus GF(p) */
#define PKA_ECC_COMPLETE_ADD_IN_POINT1_X               ((0x0628UL - PKA_RAM_OFFSET)>>2)    /*!< Input initial point P X coordinate */
#define PKA_ECC_COMPLETE_ADD_IN_POINT1_Y               ((0x0680UL - PKA_RAM_OFFSET)>>2)    /*!< Input initial point P Y coordinate */
#define PKA_ECC_COMPLETE_ADD_IN_POINT1_Z               ((0x06D8UL - PKA_RAM_OFFSET)>>2)    /*!< Input initial point P Z coordinate */
#define PKA_ECC_COMPLETE_ADD_IN_POINT2_X               ((0x0730UL - PKA_RAM_OFFSET)>>2)    /*!< Input initial point Q X coordinate */
#define PKA_ECC_COMPLETE_ADD_IN_POINT2_Y               ((0x0788UL - PKA_RAM_OFFSET)>>2)    /*!< Input initial point Q Y coordinate */
#define PKA_ECC_COMPLETE_ADD_IN_POINT2_Z               ((0x07E0UL - PKA_RAM_OFFSET)>>2)    /*!< Input initial point Q Z coordinate */

/* Compute ECC complete addition output data */
#define PKA_ECC_COMPLETE_ADD_OUT_RESULT_X              ((0x0D60UL - PKA_RAM_OFFSET)>>2)    /*!< Output result X coordinate */
#define PKA_ECC_COMPLETE_ADD_OUT_RESULT_Y              ((0x0DB8UL - PKA_RAM_OFFSET)>>2)    /*!< Output result Y coordinate */
#define PKA_ECC_COMPLETE_ADD_OUT_RESULT_Z              ((0x0E10UL - PKA_RAM_OFFSET)>>2)    /*!< Output result Z coordinate */

/* Compute ECC double base ladder input data */
#define PKA_ECC_DOUBLE_LADDER_IN_PRIME_ORDER_NB_BITS   ((0x0400UL - PKA_RAM_OFFSET)>>2)    /*!< Input n, order of the curve */
#define PKA_ECC_DOUBLE_LADDER_IN_MOD_NB_BITS           ((0x0408UL - PKA_RAM_OFFSET)>>2)    /*!< Input Modulus number of bits */
#define PKA_ECC_DOUBLE_LADDER_IN_A_COEFF_SIGN          ((0x0410UL - PKA_RAM_OFFSET)>>2)    /*!< Input sign of the 'a' coefficient */
#define PKA_ECC_DOUBLE_LADDER_IN_A_COEFF               ((0x0418UL - PKA_RAM_OFFSET)>>2)    /*!< Input ECC curve '|a|' coefficient */
#define PKA_ECC_DOUBLE_LADDER_IN_MOD_P                 ((0x0470UL - PKA_RAM_OFFSET)>>2)    /*!< Input modulus GF(p) */
#define PKA_ECC_DOUBLE_LADDER_IN_K_INTEGER             ((0x0520UL - PKA_RAM_OFFSET)>>2)    /*!< Input 'k' integer coefficient */
#define PKA_ECC_DOUBLE_LADDER_IN_M_INTEGER             ((0x0578UL - PKA_RAM_OFFSET)>>2)    /*!< Input 'm' integer coefficient */
#define PKA_ECC_DOUBLE_LADDER_IN_POINT1_X              ((0x0628UL - PKA_RAM_OFFSET)>>2)    /*!< Input initial point P X coordinate */
#define PKA_ECC_DOUBLE_LADDER_IN_POINT1_Y              ((0x0680UL - PKA_RAM_OFFSET)>>2)    /*!< Input initial point P Y coordinate */
#define PKA_ECC_DOUBLE_LADDER_IN_POINT1_Z              ((0x06D8UL - PKA_RAM_OFFSET)>>2)    /*!< Input initial point P Z coordinate */
#define PKA_ECC_DOUBLE_LADDER_IN_POINT2_X              ((0x0730UL - PKA_RAM_OFFSET)>>2)    /*!< Input initial point Q X coordinate */
#define PKA_ECC_DOUBLE_LADDER_IN_POINT2_Y              ((0x0788UL - PKA_RAM_OFFSET)>>2)    /*!< Input initial point Q Y coordinate */
#define PKA_ECC_DOUBLE_LADDER_IN_POINT2_Z              ((0x07E0UL - PKA_RAM_OFFSET)>>2)    /*!< Input initial point Q Z coordinate */

/* Compute ECC double base ladder output data */
#define PKA_ECC_DOUBLE_LADDER_OUT_RESULT_X             ((0x0578UL - PKA_RAM_OFFSET)>>2)    /*!< Output result X coordinate (affine coordinate) */
#define PKA_ECC_DOUBLE_LADDER_OUT_RESULT_Y             ((0x05D0UL - PKA_RAM_OFFSET)>>2)    /*!< Output result Y coordinate (affine coordinate) */
#define PKA_ECC_DOUBLE_LADDER_OUT_ERROR                ((0x0520UL - PKA_RAM_OFFSET)>>2)    /*!< Output result error */

/* Compute ECC projective to affine conversion input data */
#define PKA_ECC_PROJECTIVE_AFF_IN_MOD_NB_BITS          ((0x0408UL - PKA_RAM_OFFSET)>>2)    /*!< Input Modulus number of bits */
#define PKA_ECC_PROJECTIVE_AFF_IN_MOD_P                ((0x0470UL - PKA_RAM_OFFSET)>>2)    /*!< Input modulus GF(p) */
#define PKA_ECC_PROJECTIVE_AFF_IN_POINT_X              ((0x0D60UL - PKA_RAM_OFFSET)>>2)    /*!< Input initial projective point P X coordinate */
#define PKA_ECC_PROJECTIVE_AFF_IN_POINT_Y              ((0x0DB8UL - PKA_RAM_OFFSET)>>2)    /*!< Input initial projective point P Y coordinate */
#define PKA_ECC_PROJECTIVE_AFF_IN_POINT_Z              ((0x0E10UL - PKA_RAM_OFFSET)>>2)    /*!< Input initial projective point P Z coordinate */
#define PKA_ECC_PROJECTIVE_AFF_IN_MONTGOMERY_PARAM_R2  ((0x04C8UL - PKA_RAM_OFFSET)>>2)    /*!< Input storage area for Montgomery parameter */

/* Compute ECC projective to affine conversion output data */
#define PKA_ECC_PROJECTIVE_AFF_OUT_RESULT_X            ((0x0578UL - PKA_RAM_OFFSET)>>2)    /*!< Output result x affine coordinate */
#define PKA_ECC_PROJECTIVE_AFF_OUT_RESULT_Y            ((0x05D0UL - PKA_RAM_OFFSET)>>2)    /*!< Output result y affine coordinate */
#define PKA_ECC_PROJECTIVE_AFF_OUT_ERROR               ((0x0680UL - PKA_RAM_OFFSET)>>2)    /*!< Output result error */

/* PKA operating modes input data */
#define PKA_MODE_MODULAR_EXP               (0U)                                                                             /*!< modular exponentiation                   */
#define PKA_MODE_MONTGOMERY_PARAM          (PKA_CR_MODE_0)                                                                  /*!< Compute Montgomery parameter only        */
#define PKA_MODE_MODULAR_EXP_FAST          (PKA_CR_MODE_1)                                                                  /*!< modular exponentiation fast mode         */
#define PKA_MODE_MODULAR_EXP_PROTECT       (PKA_CR_MODE_0 | PKA_CR_MODE_1)                                                  /*!< modular exponentiation protected mode    */
#define PKA_MODE_ECC_MUL_PROTECT           (PKA_CR_MODE_5)                                                                  /*!< ECC scalar multiplication protected mode */
#define PKA_MODE_ECC_COMPLETE_ADD          (PKA_CR_MODE_0 | PKA_CR_MODE_1 | PKA_CR_MODE_5)                                  /*!< ECC complete addition                    */
#define PKA_MODE_ECDSA_SIGNATURE_PROTECT   (PKA_CR_MODE_2 | PKA_CR_MODE_5)                                                  /*!< ECDSA signature protected mode           */
#define PKA_MODE_ECDSA_VERIFICATION        (PKA_CR_MODE_1 | PKA_CR_MODE_2 | PKA_CR_MODE_5)                                  /*!< ECDSA verification                       */
#define PKA_MODE_POINT_CHECK               (PKA_CR_MODE_3 | PKA_CR_MODE_5)                                                  /*!< Point check                              */
#define PKA_MODE_RSA_CRT_EXP               (PKA_CR_MODE_0 | PKA_CR_MODE_1 | PKA_CR_MODE_2)                                  /*!< RSA CRT exponentiation                   */
#define PKA_MODE_MODULAR_INV               (PKA_CR_MODE_3)                                                                  /*!< Modular inversion                        */
#define PKA_MODE_ARITHMETIC_ADD            (PKA_CR_MODE_0 | PKA_CR_MODE_3)                                                  /*!< Arithmetic addition                      */
#define PKA_MODE_ARITHMETIC_SUB            (PKA_CR_MODE_1 | PKA_CR_MODE_3)                                                  /*!< Arithmetic subtraction                   */
#define PKA_MODE_ARITHMETIC_MUL            (PKA_CR_MODE_0 | PKA_CR_MODE_1 | PKA_CR_MODE_3)                                  /*!< Arithmetic multiplication                */
#define PKA_MODE_COMPARISON                (PKA_CR_MODE_2 | PKA_CR_MODE_3)                                                  /*!< Comparison                               */
#define PKA_MODE_MODULAR_REDUC             (PKA_CR_MODE_0 | PKA_CR_MODE_2 | PKA_CR_MODE_3)                                  /*!< Modular reduction                        */
#define PKA_MODE_MODULAR_ADD               (PKA_CR_MODE_1 | PKA_CR_MODE_2 | PKA_CR_MODE_3)                                  /*!< Modular addition                         */
#define PKA_MODE_MODULAR_SUB               (PKA_CR_MODE_0 | PKA_CR_MODE_1 | PKA_CR_MODE_2 | PKA_CR_MODE_3)                  /*!< Modular subtraction                      */
#define PKA_MODE_MONTGOMERY_MUL            (PKA_CR_MODE_4)                                                                  /*!< Montgomery multiplication                */
#define PKA_MODE_DOUBLE_BASE_LADDER        (PKA_CR_MODE_0 | PKA_CR_MODE_1 | PKA_CR_MODE_2 | PKA_CR_MODE_5)                  /*!< Double base ladder                       */
#define PKA_MODE_ECC_PROJECTIVE_AFF        (PKA_CR_MODE_0 | PKA_CR_MODE_1 | PKA_CR_MODE_2 | PKA_CR_MODE_3 | PKA_CR_MODE_5)  /*!< ECC projective to affine                 */
#define PKA_MODE_RSA_SIGNATURE             (0U)                                                                             /*!< RSA signature                            */
#define PKA_MODE_RSA_SIGNATURE_FAST        (PKA_CR_MODE_1)                                                                  /*!< RSA signature fast mode                  */
#define PKA_MODE_RSA_SIGNATURE_PROTECT     (PKA_CR_MODE_0 | PKA_CR_MODE_1)                                                  /*!< RSA signature protected mode             */
#define PKA_MODE_RSA_VERIFICATION          (0U)                                                                             /*!< RSA verification */

/* ****************************************************************************************************************** */
/*                                                                                                                    */
/*                                       RAMs configuration controller (RAMCFG)                                       */
/*                                                                                                                    */
/* ****************************************************************************************************************** */
/* ***********************************   Bit definition for RAMCFG_CR register   ************************************ */
#define RAMCFG_CR_ECCE_Pos         (0U)
#define RAMCFG_CR_ECCE_Msk         (0x1UL << RAMCFG_CR_ECCE_Pos)           /*!< 0x00000001 */
#define RAMCFG_CR_ECCE             RAMCFG_CR_ECCE_Msk                      /*!< ECC enable. */
#define RAMCFG_CR_ALE_Pos          (4U)
#define RAMCFG_CR_ALE_Msk          (0x1UL << RAMCFG_CR_ALE_Pos)            /*!< 0x00000010 */
#define RAMCFG_CR_ALE              RAMCFG_CR_ALE_Msk                       /*!< Address latch enable */
#define RAMCFG_CR_SRAMER_Pos       (8U)
#define RAMCFG_CR_SRAMER_Msk       (0x1UL << RAMCFG_CR_SRAMER_Pos)         /*!< 0x00000100 */
#define RAMCFG_CR_SRAMER           RAMCFG_CR_SRAMER_Msk                    /*!< SRAM erase */

/* ***********************************   Bit definition for RAMCFG_IER register   *********************************** */
#define RAMCFG_IER_SEIE_Pos        (0U)
#define RAMCFG_IER_SEIE_Msk        (0x1UL << RAMCFG_IER_SEIE_Pos)          /*!< 0x00000001 */
#define RAMCFG_IER_SEIE            RAMCFG_IER_SEIE_Msk                     /*!< ECC single error interrupt enable */
#define RAMCFG_IER_DEIE_Pos        (1U)
#define RAMCFG_IER_DEIE_Msk        (0x1UL << RAMCFG_IER_DEIE_Pos)          /*!< 0x00000002 */
#define RAMCFG_IER_DEIE            RAMCFG_IER_DEIE_Msk                     /*!< ECC double error interrupt enable */
#define RAMCFG_IER_ECCNMI_Pos      (3U)
#define RAMCFG_IER_ECCNMI_Msk      (0x1UL << RAMCFG_IER_ECCNMI_Pos)        /*!< 0x00000008 */
#define RAMCFG_IER_ECCNMI          RAMCFG_IER_ECCNMI_Msk                   /*!< Double error NMI */

/* ***********************************   Bit definition for RAMCFG_ISR register   *********************************** */
#define RAMCFG_ISR_SEDC_Pos        (0U)
#define RAMCFG_ISR_SEDC_Msk        (0x1UL << RAMCFG_ISR_SEDC_Pos)          /*!< 0x00000001 */
#define RAMCFG_ISR_SEDC            RAMCFG_ISR_SEDC_Msk                     /*!< ECC single error detected and
                                                                                corrected */
#define RAMCFG_ISR_DED_Pos         (1U)
#define RAMCFG_ISR_DED_Msk         (0x1UL << RAMCFG_ISR_DED_Pos)           /*!< 0x00000002 */
#define RAMCFG_ISR_DED             RAMCFG_ISR_DED_Msk                      /*!< ECC double error detected */
#define RAMCFG_ISR_SRAMBUSY_Pos    (8U)
#define RAMCFG_ISR_SRAMBUSY_Msk    (0x1UL << RAMCFG_ISR_SRAMBUSY_Pos)      /*!< 0x00000100 */
#define RAMCFG_ISR_SRAMBUSY        RAMCFG_ISR_SRAMBUSY_Msk                 /*!< SRAM busy with erase operation */

