MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* **********************************   Bit definition for RAMCFG_WPR2 register   *********************************** */
#define RAMCFG_WPR2_P32WP_Pos      (0U)
#define RAMCFG_WPR2_P32WP_Msk      (0x1UL << RAMCFG_WPR2_P32WP_Pos)        /*!< 0x00000001 */
#define RAMCFG_WPR2_P32WP          RAMCFG_WPR2_P32WP_Msk                   /*!< Write Protection Page 32 */
#define RAMCFG_WPR2_P33WP_Pos      (1U)
#define RAMCFG_WPR2_P33WP_Msk      (0x1UL << RAMCFG_WPR2_P33WP_Pos)        /*!< 0x00000002 */
#define RAMCFG_WPR2_P33WP          RAMCFG_WPR2_P33WP_Msk                   /*!< Write Protection Page 33 */
#define RAMCFG_WPR2_P34WP_Pos      (2U)
#define RAMCFG_WPR2_P34WP_Msk      (0x1UL << RAMCFG_WPR2_P34WP_Pos)        /*!< 0x00000004 */
#define RAMCFG_WPR2_P34WP          RAMCFG_WPR2_P34WP_Msk                   /*!< Write Protection Page 34 */
#define RAMCFG_WPR2_P35WP_Pos      (3U)
#define RAMCFG_WPR2_P35WP_Msk      (0x1UL << RAMCFG_WPR2_P35WP_Pos)        /*!< 0x00000008 */
#define RAMCFG_WPR2_P35WP          RAMCFG_WPR2_P35WP_Msk                   /*!< Write Protection Page 35 */
#define RAMCFG_WPR2_P36WP_Pos      (4U)
#define RAMCFG_WPR2_P36WP_Msk      (0x1UL << RAMCFG_WPR2_P36WP_Pos)        /*!< 0x00000010 */
#define RAMCFG_WPR2_P36WP          RAMCFG_WPR2_P36WP_Msk                   /*!< Write Protection Page 36 */
#define RAMCFG_WPR2_P37WP_Pos      (5U)
#define RAMCFG_WPR2_P37WP_Msk      (0x1UL << RAMCFG_WPR2_P37WP_Pos)        /*!< 0x00000020 */
#define RAMCFG_WPR2_P37WP          RAMCFG_WPR2_P37WP_Msk                   /*!< Write Protection Page 37 */
#define RAMCFG_WPR2_P38WP_Pos      (6U)
#define RAMCFG_WPR2_P38WP_Msk      (0x1UL << RAMCFG_WPR2_P38WP_Pos)        /*!< 0x00000040 */
#define RAMCFG_WPR2_P38WP          RAMCFG_WPR2_P38WP_Msk                   /*!< Write Protection Page 38 */
#define RAMCFG_WPR2_P39WP_Pos      (7U)
#define RAMCFG_WPR2_P39WP_Msk      (0x1UL << RAMCFG_WPR2_P39WP_Pos)        /*!< 0x00000080 */
#define RAMCFG_WPR2_P39WP          RAMCFG_WPR2_P39WP_Msk                   /*!< Write Protection Page 39 */
#define RAMCFG_WPR2_P40WP_Pos      (8U)
#define RAMCFG_WPR2_P40WP_Msk      (0x1UL << RAMCFG_WPR2_P40WP_Pos)        /*!< 0x00000100 */
#define RAMCFG_WPR2_P40WP          RAMCFG_WPR2_P40WP_Msk                   /*!< Write Protection Page 40 */
#define RAMCFG_WPR2_P41WP_Pos      (9U)
#define RAMCFG_WPR2_P41WP_Msk      (0x1UL << RAMCFG_WPR2_P41WP_Pos)        /*!< 0x00000200 */
#define RAMCFG_WPR2_P41WP          RAMCFG_WPR2_P41WP_Msk                   /*!< Write Protection Page 41 */
#define RAMCFG_WPR2_P42WP_Pos      (10U)
#define RAMCFG_WPR2_P42WP_Msk      (0x1UL << RAMCFG_WPR2_P42WP_Pos)        /*!< 0x00000400 */
#define RAMCFG_WPR2_P42WP          RAMCFG_WPR2_P42WP_Msk                   /*!< Write Protection Page 42 */
#define RAMCFG_WPR2_P43WP_Pos      (11U)
#define RAMCFG_WPR2_P43WP_Msk      (0x1UL << RAMCFG_WPR2_P43WP_Pos)        /*!< 0x00000800 */
#define RAMCFG_WPR2_P43WP          RAMCFG_WPR2_P43WP_Msk                   /*!< Write Protection Page 43 */
#define RAMCFG_WPR2_P44WP_Pos      (12U)
#define RAMCFG_WPR2_P44WP_Msk      (0x1UL << RAMCFG_WPR2_P44WP_Pos)        /*!< 0x00001000 */
#define RAMCFG_WPR2_P44WP          RAMCFG_WPR2_P44WP_Msk                   /*!< Write Protection Page 44 */
#define RAMCFG_WPR2_P45WP_Pos      (13U)
#define RAMCFG_WPR2_P45WP_Msk      (0x1UL << RAMCFG_WPR2_P45WP_Pos)        /*!< 0x00002000 */
#define RAMCFG_WPR2_P45WP          RAMCFG_WPR2_P45WP_Msk                   /*!< Write Protection Page 45 */
#define RAMCFG_WPR2_P46WP_Pos      (14U)
#define RAMCFG_WPR2_P46WP_Msk      (0x1UL << RAMCFG_WPR2_P46WP_Pos)        /*!< 0x00004000 */
#define RAMCFG_WPR2_P46WP          RAMCFG_WPR2_P46WP_Msk                   /*!< Write Protection Page 46 */
#define RAMCFG_WPR2_P47WP_Pos      (15U)
#define RAMCFG_WPR2_P47WP_Msk      (0x1UL << RAMCFG_WPR2_P47WP_Pos)        /*!< 0x00008000 */
#define RAMCFG_WPR2_P47WP          RAMCFG_WPR2_P47WP_Msk                   /*!< Write Protection Page 47 */
#define RAMCFG_WPR2_P48WP_Pos      (16U)
#define RAMCFG_WPR2_P48WP_Msk      (0x1UL << RAMCFG_WPR2_P48WP_Pos)        /*!< 0x00010000 */
#define RAMCFG_WPR2_P48WP          RAMCFG_WPR2_P48WP_Msk                   /*!< Write Protection Page 48 */
#define RAMCFG_WPR2_P49WP_Pos      (17U)
#define RAMCFG_WPR2_P49WP_Msk      (0x1UL << RAMCFG_WPR2_P49WP_Pos)        /*!< 0x00020000 */
#define RAMCFG_WPR2_P49WP          RAMCFG_WPR2_P49WP_Msk                   /*!< Write Protection Page 49 */
#define RAMCFG_WPR2_P50WP_Pos      (18U)
#define RAMCFG_WPR2_P50WP_Msk      (0x1UL << RAMCFG_WPR2_P50WP_Pos)        /*!< 0x00040000 */
#define RAMCFG_WPR2_P50WP          RAMCFG_WPR2_P50WP_Msk                   /*!< Write Protection Page 50 */
#define RAMCFG_WPR2_P51WP_Pos      (19U)
#define RAMCFG_WPR2_P51WP_Msk      (0x1UL << RAMCFG_WPR2_P51WP_Pos)        /*!< 0x00080000 */
#define RAMCFG_WPR2_P51WP          RAMCFG_WPR2_P51WP_Msk                   /*!< Write Protection Page 51 */
#define RAMCFG_WPR2_P52WP_Pos      (20U)
#define RAMCFG_WPR2_P52WP_Msk      (0x1UL << RAMCFG_WPR2_P52WP_Pos)        /*!< 0x00100000 */
#define RAMCFG_WPR2_P52WP          RAMCFG_WPR2_P52WP_Msk                   /*!< Write Protection Page 52 */
#define RAMCFG_WPR2_P53WP_Pos      (21U)
#define RAMCFG_WPR2_P53WP_Msk      (0x1UL << RAMCFG_WPR2_P53WP_Pos)        /*!< 0x00200000 */
#define RAMCFG_WPR2_P53WP          RAMCFG_WPR2_P53WP_Msk                   /*!< Write Protection Page 53 */
#define RAMCFG_WPR2_P54WP_Pos      (22U)
#define RAMCFG_WPR2_P54WP_Msk      (0x1UL << RAMCFG_WPR2_P54WP_Pos)        /*!< 0x00400000 */
#define RAMCFG_WPR2_P54WP          RAMCFG_WPR2_P54WP_Msk                   /*!< Write Protection Page 54 */
#define RAMCFG_WPR2_P55WP_Pos      (23U)
#define RAMCFG_WPR2_P55WP_Msk      (0x1UL << RAMCFG_WPR2_P55WP_Pos)        /*!< 0x00800000 */
#define RAMCFG_WPR2_P55WP          RAMCFG_WPR2_P55WP_Msk                   /*!< Write Protection Page 55 */
#define RAMCFG_WPR2_P56WP_Pos      (25U)
#define RAMCFG_WPR2_P56WP_Msk      (0x1UL << RAMCFG_WPR2_P56WP_Pos)        /*!< 0x01000000 */
#define RAMCFG_WPR2_P56WP          RAMCFG_WPR2_P56WP_Msk                   /*!< Write Protection Page 56 */
#define RAMCFG_WPR2_P57WP_Pos      (26U)
#define RAMCFG_WPR2_P57WP_Msk      (0x1UL << RAMCFG_WPR2_P57WP_Pos)        /*!< 0x02000000 */
#define RAMCFG_WPR2_P57WP          RAMCFG_WPR2_P57WP_Msk                   /*!< Write Protection Page 57 */
#define RAMCFG_WPR2_P58WP_Pos      (27U)
#define RAMCFG_WPR2_P58WP_Msk      (0x1UL << RAMCFG_WPR2_P58WP_Pos)        /*!< 0x04000000 */
#define RAMCFG_WPR2_P58WP          RAMCFG_WPR2_P58WP_Msk                   /*!< Write Protection Page 58 */
#define RAMCFG_WPR2_P59WP_Pos      (28U)
#define RAMCFG_WPR2_P59WP_Msk      (0x1UL << RAMCFG_WPR2_P59WP_Pos)        /*!< 0x08000000 */
#define RAMCFG_WPR2_P59WP          RAMCFG_WPR2_P59WP_Msk                   /*!< Write Protection Page 59 */
#define RAMCFG_WPR2_P60WP_Pos      (29U)
#define RAMCFG_WPR2_P60WP_Msk      (0x1UL << RAMCFG_WPR2_P60WP_Pos)        /*!< 0x10000000 */
#define RAMCFG_WPR2_P60WP          RAMCFG_WPR2_P60WP_Msk                   /*!< Write Protection Page 60 */
#define RAMCFG_WPR2_P61WP_Pos      (30U)
#define RAMCFG_WPR2_P61WP_Msk      (0x1UL << RAMCFG_WPR2_P61WP_Pos)        /*!< 0x20000000 */
#define RAMCFG_WPR2_P61WP          RAMCFG_WPR2_P61WP_Msk                   /*!< Write Protection Page 61 */
#define RAMCFG_WPR2_P62WP_Pos      (31U)
#define RAMCFG_WPR2_P62WP_Msk      (0x1UL << RAMCFG_WPR2_P62WP_Pos)        /*!< 0x40000000 */
#define RAMCFG_WPR2_P62WP          RAMCFG_WPR2_P62WP_Msk                   /*!< Write Protection Page 62 */
#define RAMCFG_WPR2_P63WP_Pos      (31U)
#define RAMCFG_WPR2_P63WP_Msk      (0x1UL << RAMCFG_WPR2_P63WP_Pos)        /*!< 0x80000000 */
#define RAMCFG_WPR2_P63WP          RAMCFG_WPR2_P63WP_Msk                   /*!< Write Protection Page 63 */

/* *********************************   Bit definition for RAMCFG_ECCKEYR register   ********************************* */
#define RAMCFG_ECCKEYR_ECCKEY_Pos  (0U)
#define RAMCFG_ECCKEYR_ECCKEY_Msk  (0xFFUL << RAMCFG_ECCKEYR_ECCKEY_Pos)   /*!< 0x000000FF */
#define RAMCFG_ECCKEYR_ECCKEY      RAMCFG_ECCKEYR_ECCKEY_Msk               /*!< ECC write protection key */

/* *********************************   Bit definition for RAMCFG_ERKEYR register   ********************************** */
#define RAMCFG_ERKEYR_ERASEKEY_Pos (0U)
#define RAMCFG_ERKEYR_ERASEKEY_Msk (0xFFUL << RAMCFG_ERKEYR_ERASEKEY_Pos)  /*!< 0x000000FF */
#define RAMCFG_ERKEYR_ERASEKEY     RAMCFG_ERKEYR_ERASEKEY_Msk              /*!< Erase write protection key */

/* **********************************   Bit definition for RAMCFG_WPR3 register   *********************************** */
#define RAMCFG_WPR3_P64WP_Pos      (0U)
#define RAMCFG_WPR3_P64WP_Msk      (0x1UL << RAMCFG_WPR3_P64WP_Pos)        /*!< 0x00000001 */
#define RAMCFG_WPR3_P64WP          RAMCFG_WPR3_P64WP_Msk                   /*!< Write Protection Page 64 */
#define RAMCFG_WPR3_P65WP_Pos      (1U)
#define RAMCFG_WPR3_P65WP_Msk      (0x1UL << RAMCFG_WPR3_P65WP_Pos)        /*!< 0x00000002 */
#define RAMCFG_WPR3_P65WP          RAMCFG_WPR3_P65WP_Msk                   /*!< Write Protection Page 65 */
#define RAMCFG_WPR3_P66WP_Pos      (2U)
#define RAMCFG_WPR3_P66WP_Msk      (0x1UL << RAMCFG_WPR3_P66WP_Pos)        /*!< 0x00000004 */
#define RAMCFG_WPR3_P66WP          RAMCFG_WPR3_P66WP_Msk                   /*!< Write Protection Page 66 */
#define RAMCFG_WPR3_P67WP_Pos      (3U)
#define RAMCFG_WPR3_P67WP_Msk      (0x1UL << RAMCFG_WPR3_P67WP_Pos)        /*!< 0x00000008 */
#define RAMCFG_WPR3_P67WP          RAMCFG_WPR3_P67WP_Msk                   /*!< Write Protection Page 67 */
#define RAMCFG_WPR3_P68WP_Pos      (4U)
#define RAMCFG_WPR3_P68WP_Msk      (0x1UL << RAMCFG_WPR3_P68WP_Pos)        /*!< 0x00000010 */
#define RAMCFG_WPR3_P68WP          RAMCFG_WPR3_P68WP_Msk                   /*!< Write Protection Page 68 */
#define RAMCFG_WPR3_P69WP_Pos      (5U)
#define RAMCFG_WPR3_P69WP_Msk      (0x1UL << RAMCFG_WPR3_P69WP_Pos)        /*!< 0x00000020 */
#define RAMCFG_WPR3_P69WP          RAMCFG_WPR3_P69WP_Msk                   /*!< Write Protection Page 69 */
#define RAMCFG_WPR3_P70WP_Pos      (6U)
#define RAMCFG_WPR3_P70WP_Msk      (0x1UL << RAMCFG_WPR3_P70WP_Pos)        /*!< 0x00000040 */
#define RAMCFG_WPR3_P70WP          RAMCFG_WPR3_P70WP_Msk                   /*!< Write Protection Page 70 */
#define RAMCFG_WPR3_P71WP_Pos      (7U)
#define RAMCFG_WPR3_P71WP_Msk      (0x1UL << RAMCFG_WPR3_P71WP_Pos)        /*!< 0x00000080 */
#define RAMCFG_WPR3_P71WP          RAMCFG_WPR3_P71WP_Msk                   /*!< Write Protection Page 71 */
#define RAMCFG_WPR3_P72WP_Pos      (8U)
#define RAMCFG_WPR3_P72WP_Msk      (0x1UL << RAMCFG_WPR3_P72WP_Pos)        /*!< 0x00000100 */
#define RAMCFG_WPR3_P72WP          RAMCFG_WPR3_P72WP_Msk                   /*!< Write Protection Page 72 */
#define RAMCFG_WPR3_P73WP_Pos      (9U)
#define RAMCFG_WPR3_P73WP_Msk      (0x1UL << RAMCFG_WPR3_P73WP_Pos)        /*!< 0x00000200 */
#define RAMCFG_WPR3_P73WP          RAMCFG_WPR3_P73WP_Msk                   /*!< Write Protection Page 73 */
#define RAMCFG_WPR3_P74WP_Pos      (10U)
#define RAMCFG_WPR3_P74WP_Msk      (0x1UL << RAMCFG_WPR3_P74WP_Pos)        /*!< 0x00000400 */
#define RAMCFG_WPR3_P74WP          RAMCFG_WPR3_P74WP_Msk                   /*!< Write Protection Page 74 */
#define RAMCFG_WPR3_P75WP_Pos      (11U)
#define RAMCFG_WPR3_P75WP_Msk      (0x1UL << RAMCFG_WPR3_P75WP_Pos)        /*!< 0x00000800 */
#define RAMCFG_WPR3_P75WP          RAMCFG_WPR3_P75WP_Msk                   /*!< Write Protection Page 75 */
#define RAMCFG_WPR3_P76WP_Pos      (12U)
#define RAMCFG_WPR3_P76WP_Msk      (0x1UL << RAMCFG_WPR3_P76WP_Pos)        /*!< 0x00001000 */
#define RAMCFG_WPR3_P76WP          RAMCFG_WPR3_P76WP_Msk                   /*!< Write Protection Page 76 */
#define RAMCFG_WPR3_P77WP_Pos      (13U)
#define RAMCFG_WPR3_P77WP_Msk      (0x1UL << RAMCFG_WPR3_P77WP_Pos)        /*!< 0x00002000 */
#define RAMCFG_WPR3_P77WP          RAMCFG_WPR3_P77WP_Msk                   /*!< Write Protection Page 77 */
#define RAMCFG_WPR3_P78WP_Pos      (14U)
#define RAMCFG_WPR3_P78WP_Msk      (0x1UL << RAMCFG_WPR3_P78WP_Pos)        /*!< 0x00004000 */
#define RAMCFG_WPR3_P78WP          RAMCFG_WPR3_P78WP_Msk                   /*!< Write Protection Page 78 */
#define RAMCFG_WPR3_P79WP_Pos      (15U)
#define RAMCFG_WPR3_P79WP_Msk      (0x1UL << RAMCFG_WPR3_P79WP_Pos)        /*!< 0x00008000 */
#define RAMCFG_WPR3_P79WP          RAMCFG_WPR3_P79WP_Msk                   /*!< Write Protection Page 79 */
#define RAMCFG_WPR3_P80WP_Pos      (16U)
#define RAMCFG_WPR3_P80WP_Msk      (0x1UL << RAMCFG_WPR3_P80WP_Pos)        /*!< 0x00010000 */
#define RAMCFG_WPR3_P80WP          RAMCFG_WPR3_P80WP_Msk                   /*!< Write Protection Page 80 */
#define RAMCFG_WPR3_P81WP_Pos      (17U)
#define RAMCFG_WPR3_P81WP_Msk      (0x1UL << RAMCFG_WPR3_P81WP_Pos)        /*!< 0x00020000 */
#define RAMCFG_WPR3_P81WP          RAMCFG_WPR3_P81WP_Msk                   /*!< Write Protection Page 81 */
#define RAMCFG_WPR3_P82WP_Pos      (18U)
#define RAMCFG_WPR3_P82WP_Msk      (0x1UL << RAMCFG_WPR3_P82WP_Pos)        /*!< 0x00040000 */
#define RAMCFG_WPR3_P82WP          RAMCFG_WPR3_P82WP_Msk                   /*!< Write Protection Page 82 */
#define RAMCFG_WPR3_P83WP_Pos      (19U)
#define RAMCFG_WPR3_P83WP_Msk      (0x1UL << RAMCFG_WPR3_P83WP_Pos)        /*!< 0x00080000 */
#define RAMCFG_WPR3_P83WP          RAMCFG_WPR3_P83WP_Msk                   /*!< Write Protection Page 83 */
#define RAMCFG_WPR3_P84WP_Pos      (20U)
#define RAMCFG_WPR3_P84WP_Msk      (0x1UL << RAMCFG_WPR3_P84WP_Pos)        /*!< 0x00100000 */
#define RAMCFG_WPR3_P84WP          RAMCFG_WPR3_P84WP_Msk                   /*!< Write Protection Page 84 */
#define RAMCFG_WPR3_P85WP_Pos      (21U)
#define RAMCFG_WPR3_P85WP_Msk      (0x1UL << RAMCFG_WPR3_P85WP_Pos)        /*!< 0x00200000 */
#define RAMCFG_WPR3_P85WP          RAMCFG_WPR3_P85WP_Msk                   /*!< Write Protection Page 85 */
#define RAMCFG_WPR3_P86WP_Pos      (22U)
#define RAMCFG_WPR3_P86WP_Msk      (0x1UL << RAMCFG_WPR3_P86WP_Pos)        /*!< 0x00400000 */
#define RAMCFG_WPR3_P86WP          RAMCFG_WPR3_P86WP_Msk                   /*!< Write Protection Page 86 */
#define RAMCFG_WPR3_P87WP_Pos      (23U)
#define RAMCFG_WPR3_P87WP_Msk      (0x1UL << RAMCFG_WPR3_P87WP_Pos)        /*!< 0x00800000 */
#define RAMCFG_WPR3_P87WP          RAMCFG_WPR3_P87WP_Msk                   /*!< Write Protection Page 87 */
#define RAMCFG_WPR3_P88WP_Pos      (24U)
#define RAMCFG_WPR3_P88WP_Msk      (0x1UL << RAMCFG_WPR3_P88WP_Pos)        /*!< 0x01000000 */
#define RAMCFG_WPR3_P88WP          RAMCFG_WPR3_P88WP_Msk                   /*!< Write Protection Page 88 */
#define RAMCFG_WPR3_P89WP_Pos      (25U)
#define RAMCFG_WPR3_P89WP_Msk      (0x1UL << RAMCFG_WPR3_P89WP_Pos)        /*!< 0x02000000 */
#define RAMCFG_WPR3_P89WP          RAMCFG_WPR3_P89WP_Msk                   /*!< Write Protection Page 89 */
#define RAMCFG_WPR3_P90WP_Pos      (26U)
#define RAMCFG_WPR3_P90WP_Msk      (0x1UL << RAMCFG_WPR3_P90WP_Pos)        /*!< 0x04000000 */
#define RAMCFG_WPR3_P90WP          RAMCFG_WPR3_P90WP_Msk                   /*!< Write Protection Page 90 */
#define RAMCFG_WPR3_P91WP_Pos      (27U)
#define RAMCFG_WPR3_P91WP_Msk      (0x1UL << RAMCFG_WPR3_P91WP_Pos)        /*!< 0x08000000 */
#define RAMCFG_WPR3_P91WP          RAMCFG_WPR3_P91WP_Msk                   /*!< Write Protection Page 91 */
#define RAMCFG_WPR3_P92WP_Pos      (28U)
#define RAMCFG_WPR3_P92WP_Msk      (0x1UL << RAMCFG_WPR3_P92WP_Pos)        /*!< 0x10000000 */
#define RAMCFG_WPR3_P92WP          RAMCFG_WPR3_P92WP_Msk                   /*!< Write Protection Page 92 */
#define RAMCFG_WPR3_P93WP_Pos      (29U)
#define RAMCFG_WPR3_P93WP_Msk      (0x1UL << RAMCFG_WPR3_P93WP_Pos)        /*!< 0x20000000 */
#define RAMCFG_WPR3_P93WP          RAMCFG_WPR3_P93WP_Msk                   /*!< Write Protection Page 93 */
#define RAMCFG_WPR3_P94WP_Pos      (30U)
#define RAMCFG_WPR3_P94WP_Msk      (0x1UL << RAMCFG_WPR3_P94WP_Pos)        /*!< 0x40000000 */
#define RAMCFG_WPR3_P94WP          RAMCFG_WPR3_P94WP_Msk                   /*!< Write Protection Page 94 */
#define RAMCFG_WPR3_P95WP_Pos      (31U)
#define RAMCFG_WPR3_P95WP_Msk      (0x1UL << RAMCFG_WPR3_P95WP_Pos)        /*!< 0x80000000 */
#define RAMCFG_WPR3_P95WP          RAMCFG_WPR3_P95WP_Msk                   /*!< Write Protection Page 95 */

