MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* **********************************   Bit definition for RAMCFG_WPR4 register   *********************************** */
#define RAMCFG_WPR4_P96WP_Pos      (0U)
#define RAMCFG_WPR4_P96WP_Msk      (0x1UL << RAMCFG_WPR4_P96WP_Pos)        /*!< 0x00000001 */
#define RAMCFG_WPR4_P96WP          RAMCFG_WPR4_P96WP_Msk                   /*!< Write Protection Page 96 */
#define RAMCFG_WPR4_P97WP_Pos      (1U)
#define RAMCFG_WPR4_P97WP_Msk      (0x1UL << RAMCFG_WPR4_P97WP_Pos)        /*!< 0x00000002 */
#define RAMCFG_WPR4_P97WP          RAMCFG_WPR4_P97WP_Msk                   /*!< Write Protection Page 97 */
#define RAMCFG_WPR4_P98WP_Pos      (2U)
#define RAMCFG_WPR4_P98WP_Msk      (0x1UL << RAMCFG_WPR4_P98WP_Pos)        /*!< 0x00000004 */
#define RAMCFG_WPR4_P98WP          RAMCFG_WPR4_P98WP_Msk                   /*!< Write Protection Page 98 */
#define RAMCFG_WPR4_P99WP_Pos      (3U)
#define RAMCFG_WPR4_P99WP_Msk      (0x1UL << RAMCFG_WPR4_P99WP_Pos)        /*!< 0x00000008 */
#define RAMCFG_WPR4_P99WP          RAMCFG_WPR4_P99WP_Msk                   /*!< Write Protection Page 99 */
#define RAMCFG_WPR4_P100WP_Pos     (4U)
#define RAMCFG_WPR4_P100WP_Msk     (0x1UL << RAMCFG_WPR4_P100WP_Pos)       /*!< 0x00000010 */
#define RAMCFG_WPR4_P100WP         RAMCFG_WPR4_P100WP_Msk                  /*!< Write Protection Page 100 */
#define RAMCFG_WPR4_P101WP_Pos     (5U)
#define RAMCFG_WPR4_P101WP_Msk     (0x1UL << RAMCFG_WPR4_P101WP_Pos)       /*!< 0x00000020 */
#define RAMCFG_WPR4_P101WP         RAMCFG_WPR4_P101WP_Msk                  /*!< Write Protection Page 101 */
#define RAMCFG_WPR4_P102WP_Pos     (6U)
#define RAMCFG_WPR4_P102WP_Msk     (0x1UL << RAMCFG_WPR4_P102WP_Pos)       /*!< 0x00000040 */
#define RAMCFG_WPR4_P102WP         RAMCFG_WPR4_P102WP_Msk                  /*!< Write Protection Page 102 */
#define RAMCFG_WPR4_P103WP_Pos     (7U)
#define RAMCFG_WPR4_P103WP_Msk     (0x1UL << RAMCFG_WPR4_P103WP_Pos)       /*!< 0x00000080 */
#define RAMCFG_WPR4_P103WP         RAMCFG_WPR4_P103WP_Msk                  /*!< Write Protection Page 103 */
#define RAMCFG_WPR4_P104WP_Pos     (8U)
#define RAMCFG_WPR4_P104WP_Msk     (0x1UL << RAMCFG_WPR4_P104WP_Pos)       /*!< 0x00000100 */
#define RAMCFG_WPR4_P104WP         RAMCFG_WPR4_P104WP_Msk                  /*!< Write Protection Page 104 */
#define RAMCFG_WPR4_P105WP_Pos     (9U)
#define RAMCFG_WPR4_P105WP_Msk     (0x1UL << RAMCFG_WPR4_P105WP_Pos)       /*!< 0x00000200 */
#define RAMCFG_WPR4_P105WP         RAMCFG_WPR4_P105WP_Msk                  /*!< Write Protection Page 105 */
#define RAMCFG_WPR4_P106WP_Pos     (10U)
#define RAMCFG_WPR4_P106WP_Msk     (0x1UL << RAMCFG_WPR4_P106WP_Pos)       /*!< 0x00000400 */
#define RAMCFG_WPR4_P106WP         RAMCFG_WPR4_P106WP_Msk                  /*!< Write Protection Page 106 */
#define RAMCFG_WPR4_P107WP_Pos     (11U)
#define RAMCFG_WPR4_P107WP_Msk     (0x1UL << RAMCFG_WPR4_P107WP_Pos)       /*!< 0x00000800 */
#define RAMCFG_WPR4_P107WP         RAMCFG_WPR4_P107WP_Msk                  /*!< Write Protection Page 107 */
#define RAMCFG_WPR4_P108WP_Pos     (12U)
#define RAMCFG_WPR4_P108WP_Msk     (0x1UL << RAMCFG_WPR4_P108WP_Pos)       /*!< 0x00001000 */
#define RAMCFG_WPR4_P108WP         RAMCFG_WPR4_P108WP_Msk                  /*!< Write Protection Page 108 */
#define RAMCFG_WPR4_P109WP_Pos     (13U)
#define RAMCFG_WPR4_P109WP_Msk     (0x1UL << RAMCFG_WPR4_P109WP_Pos)       /*!< 0x00002000 */
#define RAMCFG_WPR4_P109WP         RAMCFG_WPR4_P109WP_Msk                  /*!< Write Protection Page 109 */
#define RAMCFG_WPR4_P110WP_Pos     (14U)
#define RAMCFG_WPR4_P110WP_Msk     (0x1UL << RAMCFG_WPR4_P110WP_Pos)       /*!< 0x00004000 */
#define RAMCFG_WPR4_P110WP         RAMCFG_WPR4_P110WP_Msk                  /*!< Write Protection Page 110 */
#define RAMCFG_WPR4_P111WP_Pos     (15U)
#define RAMCFG_WPR4_P111WP_Msk     (0x1UL << RAMCFG_WPR4_P111WP_Pos)       /*!< 0x00008000 */
#define RAMCFG_WPR4_P111WP         RAMCFG_WPR4_P111WP_Msk                  /*!< Write Protection Page 111 */
#define RAMCFG_WPR4_P112WP_Pos     (16U)
#define RAMCFG_WPR4_P112WP_Msk     (0x1UL << RAMCFG_WPR4_P112WP_Pos)       /*!< 0x00010000 */
#define RAMCFG_WPR4_P112WP         RAMCFG_WPR4_P112WP_Msk                  /*!< Write Protection Page 112 */
#define RAMCFG_WPR4_P113WP_Pos     (17U)
#define RAMCFG_WPR4_P113WP_Msk     (0x1UL << RAMCFG_WPR4_P113WP_Pos)       /*!< 0x00020000 */
#define RAMCFG_WPR4_P113WP         RAMCFG_WPR4_P113WP_Msk                  /*!< Write Protection Page 113 */
#define RAMCFG_WPR4_P114WP_Pos     (18U)
#define RAMCFG_WPR4_P114WP_Msk     (0x1UL << RAMCFG_WPR4_P114WP_Pos)       /*!< 0x00040000 */
#define RAMCFG_WPR4_P114WP         RAMCFG_WPR4_P114WP_Msk                  /*!< Write Protection Page 114 */
#define RAMCFG_WPR4_P115WP_Pos     (19U)
#define RAMCFG_WPR4_P115WP_Msk     (0x1UL << RAMCFG_WPR4_P115WP_Pos)       /*!< 0x00080000 */
#define RAMCFG_WPR4_P115WP         RAMCFG_WPR4_P115WP_Msk                  /*!< Write Protection Page 115 */
#define RAMCFG_WPR4_P116WP_Pos     (20U)
#define RAMCFG_WPR4_P116WP_Msk     (0x1UL << RAMCFG_WPR4_P116WP_Pos)       /*!< 0x00100000 */
#define RAMCFG_WPR4_P116WP         RAMCFG_WPR4_P116WP_Msk                  /*!< Write Protection Page 116 */
#define RAMCFG_WPR4_P117WP_Pos     (21U)
#define RAMCFG_WPR4_P117WP_Msk     (0x1UL << RAMCFG_WPR4_P117WP_Pos)       /*!< 0x00200000 */
#define RAMCFG_WPR4_P117WP         RAMCFG_WPR4_P117WP_Msk                  /*!< Write Protection Page 117 */
#define RAMCFG_WPR4_P118WP_Pos     (22U)
#define RAMCFG_WPR4_P118WP_Msk     (0x1UL << RAMCFG_WPR4_P118WP_Pos)       /*!< 0x00400000 */
#define RAMCFG_WPR4_P118WP         RAMCFG_WPR4_P118WP_Msk                  /*!< Write Protection Page 118 */
#define RAMCFG_WPR4_P119WP_Pos     (23U)
#define RAMCFG_WPR4_P119WP_Msk     (0x1UL << RAMCFG_WPR4_P119WP_Pos)       /*!< 0x00800000 */
#define RAMCFG_WPR4_P119WP         RAMCFG_WPR4_P119WP_Msk                  /*!< Write Protection Page 119 */
#define RAMCFG_WPR4_P120WP_Pos     (24U)
#define RAMCFG_WPR4_P120WP_Msk     (0x1UL << RAMCFG_WPR4_P120WP_Pos)       /*!< 0x01000000 */
#define RAMCFG_WPR4_P120WP         RAMCFG_WPR4_P120WP_Msk                  /*!< Write Protection Page 120 */
#define RAMCFG_WPR4_P121WP_Pos     (25U)
#define RAMCFG_WPR4_P121WP_Msk     (0x1UL << RAMCFG_WPR4_P121WP_Pos)       /*!< 0x02000000 */
#define RAMCFG_WPR4_P121WP         RAMCFG_WPR4_P121WP_Msk                  /*!< Write Protection Page 121 */
#define RAMCFG_WPR4_P122WP_Pos     (26U)
#define RAMCFG_WPR4_P122WP_Msk     (0x1UL << RAMCFG_WPR4_P122WP_Pos)       /*!< 0x04000000 */
#define RAMCFG_WPR4_P122WP         RAMCFG_WPR4_P122WP_Msk                  /*!< Write Protection Page 122 */
#define RAMCFG_WPR4_P123WP_Pos     (27U)
#define RAMCFG_WPR4_P123WP_Msk     (0x1UL << RAMCFG_WPR4_P123WP_Pos)       /*!< 0x08000000 */
#define RAMCFG_WPR4_P123WP         RAMCFG_WPR4_P123WP_Msk                  /*!< Write Protection Page 123 */
#define RAMCFG_WPR4_P124WP_Pos     (28U)
#define RAMCFG_WPR4_P124WP_Msk     (0x1UL << RAMCFG_WPR4_P124WP_Pos)       /*!< 0x10000000 */
#define RAMCFG_WPR4_P124WP         RAMCFG_WPR4_P124WP_Msk                  /*!< Write Protection Page 124 */
#define RAMCFG_WPR4_P125WP_Pos     (29U)
#define RAMCFG_WPR4_P125WP_Msk     (0x1UL << RAMCFG_WPR4_P125WP_Pos)       /*!< 0x20000000 */
#define RAMCFG_WPR4_P125WP         RAMCFG_WPR4_P125WP_Msk                  /*!< Write Protection Page 125 */
#define RAMCFG_WPR4_P126WP_Pos     (30U)
#define RAMCFG_WPR4_P126WP_Msk     (0x1UL << RAMCFG_WPR4_P126WP_Pos)       /*!< 0x40000000 */
#define RAMCFG_WPR4_P126WP         RAMCFG_WPR4_P126WP_Msk                  /*!< Write Protection Page 126 */
#define RAMCFG_WPR4_P127WP_Pos     (31U)
#define RAMCFG_WPR4_P127WP_Msk     (0x1UL << RAMCFG_WPR4_P127WP_Pos)       /*!< 0x80000000 */
#define RAMCFG_WPR4_P127WP         RAMCFG_WPR4_P127WP_Msk                  /*!< Write Protection Page 127 */

/**********************************************************************************************************************/
/*                                                                                                                    */
/*                                           Reset and Clock Control (RCC)                                            */
/*                                                                                                                    */
/**********************************************************************************************************************/
/* *************************************  Bit definition for RCC_CR1 register  ************************************** */
#define RCC_CR1_Rst                   (0x00000022UL)                             /*!< RCC_CR1 reset value */
#define RCC_CR1_HSISON_Pos            (0U)
#define RCC_CR1_HSISON_Msk            (0x1UL << RCC_CR1_HSISON_Pos)              /*!< 0x00000001 */
#define RCC_CR1_HSISON                RCC_CR1_HSISON_Msk                         /*!< HSIS clock enable */
#define RCC_CR1_HSIDIV3ON_Pos         (1U)
#define RCC_CR1_HSIDIV3ON_Msk         (0x1UL << RCC_CR1_HSIDIV3ON_Pos)           /*!< 0x00000002 */
#define RCC_CR1_HSIDIV3ON             RCC_CR1_HSIDIV3ON_Msk                      /*!< HSIDIV3 clock enable */
#define RCC_CR1_HSIKON_Pos            (2U)
#define RCC_CR1_HSIKON_Msk            (0x1UL << RCC_CR1_HSIKON_Pos)              /*!< 0x00000004 */
#define RCC_CR1_HSIKON                RCC_CR1_HSIKON_Msk                         /*!< HSIK clock enable */
#define RCC_CR1_HSIKERON_Pos          (3U)
#define RCC_CR1_HSIKERON_Msk          (0x1UL << RCC_CR1_HSIKERON_Pos)            /*!< 0x00000008 */
#define RCC_CR1_HSIKERON              RCC_CR1_HSIKERON_Msk                       /*!< HSI clock enable in Stop mode */
#define RCC_CR1_HSISRDY_Pos           (4U)
#define RCC_CR1_HSISRDY_Msk           (0x1UL << RCC_CR1_HSISRDY_Pos)             /*!< 0x00000010 */
#define RCC_CR1_HSISRDY               RCC_CR1_HSISRDY_Msk                        /*!< HSIS clock ready flag */
#define RCC_CR1_HSIDIV3RDY_Pos        (5U)
#define RCC_CR1_HSIDIV3RDY_Msk        (0x1UL << RCC_CR1_HSIDIV3RDY_Pos)          /*!< 0x00000020 */
#define RCC_CR1_HSIDIV3RDY            RCC_CR1_HSIDIV3RDY_Msk                     /*!< HSIDIV3 clock ready flag */
#define RCC_CR1_HSIKRDY_Pos           (6U)
#define RCC_CR1_HSIKRDY_Msk           (0x1UL << RCC_CR1_HSIKRDY_Pos)             /*!< 0x00000040 */
#define RCC_CR1_HSIKRDY               RCC_CR1_HSIKRDY_Msk                        /*!< HSIK clock ready flag */
#define RCC_CR1_PSISON_Pos            (8U)
#define RCC_CR1_PSISON_Msk            (0x1UL << RCC_CR1_PSISON_Pos)              /*!< 0x00000100 */
#define RCC_CR1_PSISON                RCC_CR1_PSISON_Msk                         /*!< PSIS clock enable */
#define RCC_CR1_PSIDIV3ON_Pos         (9U)
#define RCC_CR1_PSIDIV3ON_Msk         (0x1UL << RCC_CR1_PSIDIV3ON_Pos)           /*!< 0x00000200 */
#define RCC_CR1_PSIDIV3ON             RCC_CR1_PSIDIV3ON_Msk                      /*!< PSIDIV3 clock enable */
#define RCC_CR1_PSIKON_Pos            (10U)
#define RCC_CR1_PSIKON_Msk            (0x1UL << RCC_CR1_PSIKON_Pos)              /*!< 0x00000400 */
#define RCC_CR1_PSIKON                RCC_CR1_PSIKON_Msk                         /*!< PSIK clock enable */
#define RCC_CR1_PSIKERON_Pos          (11U)
#define RCC_CR1_PSIKERON_Msk          (0x1UL << RCC_CR1_PSIKERON_Pos)            /*!< 0x00000800 */
#define RCC_CR1_PSIKERON              RCC_CR1_PSIKERON_Msk                       /*!< PSI clock enable in Stop mode */
#define RCC_CR1_PSISRDY_Pos           (12U)
#define RCC_CR1_PSISRDY_Msk           (0x1UL << RCC_CR1_PSISRDY_Pos)             /*!< 0x00001000 */
#define RCC_CR1_PSISRDY               RCC_CR1_PSISRDY_Msk                        /*!< PSIS clock ready flag */
#define RCC_CR1_PSIDIV3RDY_Pos        (13U)
#define RCC_CR1_PSIDIV3RDY_Msk        (0x1UL << RCC_CR1_PSIDIV3RDY_Pos)          /*!< 0x00002000 */
#define RCC_CR1_PSIDIV3RDY            RCC_CR1_PSIDIV3RDY_Msk                     /*!< PSIDIV3 clock ready flag */
#define RCC_CR1_PSIKRDY_Pos           (14U)
#define RCC_CR1_PSIKRDY_Msk           (0x1UL << RCC_CR1_PSIKRDY_Pos)             /*!< 0x00004000 */
#define RCC_CR1_PSIKRDY               RCC_CR1_PSIKRDY_Msk                        /*!< PSIK clock ready flag */
#define RCC_CR1_HSEON_Pos             (16U)
#define RCC_CR1_HSEON_Msk             (0x1UL << RCC_CR1_HSEON_Pos)               /*!< 0x00010000 */
#define RCC_CR1_HSEON                 RCC_CR1_HSEON_Msk                          /*!< HSE clock enable */
#define RCC_CR1_HSERDY_Pos            (17U)
#define RCC_CR1_HSERDY_Msk            (0x1UL << RCC_CR1_HSERDY_Pos)              /*!< 0x00020000 */
#define RCC_CR1_HSERDY                RCC_CR1_HSERDY_Msk                         /*!< HSE clock ready flag */
#define RCC_CR1_HSEBYP_Pos            (18U)
#define RCC_CR1_HSEBYP_Msk            (0x1UL << RCC_CR1_HSEBYP_Pos)              /*!< 0x00040000 */
#define RCC_CR1_HSEBYP                RCC_CR1_HSEBYP_Msk                         /*!< HSE clock bypass */
#define RCC_CR1_HSECSSON_Pos          (19U)
#define RCC_CR1_HSECSSON_Msk          (0x1UL << RCC_CR1_HSECSSON_Pos)            /*!< 0x00080000 */
#define RCC_CR1_HSECSSON              RCC_CR1_HSECSSON_Msk                       /*!< HSE clock security system enable
                                                                                      */
#define RCC_CR1_HSEEXT_Pos            (20U)
#define RCC_CR1_HSEEXT_Msk            (0x1UL << RCC_CR1_HSEEXT_Pos)              /*!< 0x00100000 */
#define RCC_CR1_HSEEXT                RCC_CR1_HSEEXT_Msk                         /*!< External high speed clock type in
                                                                                      Bypass mode */

/* *************************************  Bit definition for RCC_CR2 register  ************************************** */
#define RCC_CR2_Rst                   (0x00000000UL)                             /*!< RCC_CR2 reset value */
#define RCC_CR2_HSIKDIV_Pos           (0U)
#define RCC_CR2_HSIKDIV_Msk           (0xFUL << RCC_CR2_HSIKDIV_Pos)             /*!< 0x0000000F */
#define RCC_CR2_HSIKDIV               RCC_CR2_HSIKDIV_Msk                        /*!< HSI clock out divider factor */
#define RCC_CR2_HSIKDIV_0             (0x1UL << RCC_CR2_HSIKDIV_Pos)             /*!< 0x00000001 */
#define RCC_CR2_HSIKDIV_1             (0x2UL << RCC_CR2_HSIKDIV_Pos)             /*!< 0x00000002 */
#define RCC_CR2_HSIKDIV_2             (0x4UL << RCC_CR2_HSIKDIV_Pos)             /*!< 0x00000004 */
#define RCC_CR2_HSIKDIV_3             (0x8UL << RCC_CR2_HSIKDIV_Pos)             /*!< 0x00000008 */
#define RCC_CR2_PSIKDIV_Pos           (8U)
#define RCC_CR2_PSIKDIV_Msk           (0xFUL << RCC_CR2_PSIKDIV_Pos)             /*!< 0x00000F00 */
#define RCC_CR2_PSIKDIV               RCC_CR2_PSIKDIV_Msk                        /*!< PSI clock out divider factor */
#define RCC_CR2_PSIKDIV_0             (0x1UL << RCC_CR2_PSIKDIV_Pos)             /*!< 0x00000100 */
#define RCC_CR2_PSIKDIV_1             (0x2UL << RCC_CR2_PSIKDIV_Pos)             /*!< 0x00000200 */
#define RCC_CR2_PSIKDIV_2             (0x4UL << RCC_CR2_PSIKDIV_Pos)             /*!< 0x00000400 */
#define RCC_CR2_PSIKDIV_3             (0x8UL << RCC_CR2_PSIKDIV_Pos)             /*!< 0x00000800 */
#define RCC_CR2_PSIREFSRC_Pos         (16U)
#define RCC_CR2_PSIREFSRC_Msk         (0x3UL << RCC_CR2_PSIREFSRC_Pos)           /*!< 0x00030000 */
#define RCC_CR2_PSIREFSRC             RCC_CR2_PSIREFSRC_Msk                      /*!< PSI reference clock source
                                                                                      selection */
#define RCC_CR2_PSIREFSRC_0           (0x1UL << RCC_CR2_PSIREFSRC_Pos)           /*!< 0x00010000 */
#define RCC_CR2_PSIREFSRC_1           (0x2UL << RCC_CR2_PSIREFSRC_Pos)           /*!< 0x00020000 */
#define RCC_CR2_PSIREF_Pos            (20U)
#define RCC_CR2_PSIREF_Msk            (0x7UL << RCC_CR2_PSIREF_Pos)              /*!< 0x00700000 */
#define RCC_CR2_PSIREF                RCC_CR2_PSIREF_Msk                         /*!< PSI reference clock frequency
                                                                                      selection */
#define RCC_CR2_PSIREF_0              (0x1UL << RCC_CR2_PSIREF_Pos)              /*!< 0x00100000 */
#define RCC_CR2_PSIREF_1              (0x2UL << RCC_CR2_PSIREF_Pos)              /*!< 0x00200000 */
#define RCC_CR2_PSIREF_2              (0x4UL << RCC_CR2_PSIREF_Pos)              /*!< 0x00400000 */
#define RCC_CR2_PSIFREQ_Pos           (28U)
#define RCC_CR2_PSIFREQ_Msk           (0x3UL << RCC_CR2_PSIFREQ_Pos)             /*!< 0x30000000 */
#define RCC_CR2_PSIFREQ               RCC_CR2_PSIFREQ_Msk                        /*!< PSI target frequency configuration
                                                                                      */
#define RCC_CR2_PSIFREQ_0             (0x1UL << RCC_CR2_PSIFREQ_Pos)             /*!< 0x10000000 */
#define RCC_CR2_PSIFREQ_1             (0x2UL << RCC_CR2_PSIFREQ_Pos)             /*!< 0x20000000 */

