MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* **********************************  Bit definition for RCC_APB1LLPENR register  ********************************** */
#define RCC_APB1LLPENR_Rst            (0x43FEC87FUL)                             /*!< RCC_APB1LLPENR reset value */
#define RCC_APB1LLPENR_TIM2LPEN_Pos   (0U)
#define RCC_APB1LLPENR_TIM2LPEN_Msk   (0x1UL << RCC_APB1LLPENR_TIM2LPEN_Pos)     /*!< 0x00000001 */
#define RCC_APB1LLPENR_TIM2LPEN       RCC_APB1LLPENR_TIM2LPEN_Msk                /*!< TIM2 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_TIM3LPEN_Pos   (1U)
#define RCC_APB1LLPENR_TIM3LPEN_Msk   (0x1UL << RCC_APB1LLPENR_TIM3LPEN_Pos)     /*!< 0x00000002 */
#define RCC_APB1LLPENR_TIM3LPEN       RCC_APB1LLPENR_TIM3LPEN_Msk                /*!< TIM3 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_TIM4LPEN_Pos   (2U)
#define RCC_APB1LLPENR_TIM4LPEN_Msk   (0x1UL << RCC_APB1LLPENR_TIM4LPEN_Pos)     /*!< 0x00000004 */
#define RCC_APB1LLPENR_TIM4LPEN       RCC_APB1LLPENR_TIM4LPEN_Msk                /*!< TIM4LPEN (TIM4 clock enable during
                                                                                      Sleep mode) */
#define RCC_APB1LLPENR_TIM5LPEN_Pos   (3U)
#define RCC_APB1LLPENR_TIM5LPEN_Msk   (0x1UL << RCC_APB1LLPENR_TIM5LPEN_Pos)     /*!< 0x00000008 */
#define RCC_APB1LLPENR_TIM5LPEN       RCC_APB1LLPENR_TIM5LPEN_Msk                /*!< TIM5 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_TIM6LPEN_Pos   (4U)
#define RCC_APB1LLPENR_TIM6LPEN_Msk   (0x1UL << RCC_APB1LLPENR_TIM6LPEN_Pos)     /*!< 0x00000010 */
#define RCC_APB1LLPENR_TIM6LPEN       RCC_APB1LLPENR_TIM6LPEN_Msk                /*!< TIM6 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_TIM7LPEN_Pos   (5U)
#define RCC_APB1LLPENR_TIM7LPEN_Msk   (0x1UL << RCC_APB1LLPENR_TIM7LPEN_Pos)     /*!< 0x00000020 */
#define RCC_APB1LLPENR_TIM7LPEN       RCC_APB1LLPENR_TIM7LPEN_Msk                /*!< TIM7 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_TIM12LPEN_Pos  (6U)
#define RCC_APB1LLPENR_TIM12LPEN_Msk  (0x1UL << RCC_APB1LLPENR_TIM12LPEN_Pos)    /*!< 0x00000040 */
#define RCC_APB1LLPENR_TIM12LPEN      RCC_APB1LLPENR_TIM12LPEN_Msk               /*!< TIM12 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_WWDGLPEN_Pos   (11U)
#define RCC_APB1LLPENR_WWDGLPEN_Msk   (0x1UL << RCC_APB1LLPENR_WWDGLPEN_Pos)     /*!< 0x00000800 */
#define RCC_APB1LLPENR_WWDGLPEN       RCC_APB1LLPENR_WWDGLPEN_Msk                /*!< WWDG clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_OPAMP1LPEN_Pos (13U)
#define RCC_APB1LLPENR_OPAMP1LPEN_Msk (0x1UL << RCC_APB1LLPENR_OPAMP1LPEN_Pos)   /*!< 0x00002000 */
#define RCC_APB1LLPENR_OPAMP1LPEN     RCC_APB1LLPENR_OPAMP1LPEN_Msk              /*!< OPAMP1 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_SPI2LPEN_Pos   (14U)
#define RCC_APB1LLPENR_SPI2LPEN_Msk   (0x1UL << RCC_APB1LLPENR_SPI2LPEN_Pos)     /*!< 0x00004000 */
#define RCC_APB1LLPENR_SPI2LPEN       RCC_APB1LLPENR_SPI2LPEN_Msk                /*!< SPI2 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_SPI3LPEN_Pos   (15U)
#define RCC_APB1LLPENR_SPI3LPEN_Msk   (0x1UL << RCC_APB1LLPENR_SPI3LPEN_Pos)     /*!< 0x00008000 */
#define RCC_APB1LLPENR_SPI3LPEN       RCC_APB1LLPENR_SPI3LPEN_Msk                /*!< SPI3 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_USART2LPEN_Pos (17U)
#define RCC_APB1LLPENR_USART2LPEN_Msk (0x1UL << RCC_APB1LLPENR_USART2LPEN_Pos)   /*!< 0x00020000 */
#define RCC_APB1LLPENR_USART2LPEN     RCC_APB1LLPENR_USART2LPEN_Msk              /*!< USART2 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_USART3LPEN_Pos (18U)
#define RCC_APB1LLPENR_USART3LPEN_Msk (0x1UL << RCC_APB1LLPENR_USART3LPEN_Pos)   /*!< 0x00040000 */
#define RCC_APB1LLPENR_USART3LPEN     RCC_APB1LLPENR_USART3LPEN_Msk              /*!< USART3 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_UART4LPEN_Pos  (19U)
#define RCC_APB1LLPENR_UART4LPEN_Msk  (0x1UL << RCC_APB1LLPENR_UART4LPEN_Pos)    /*!< 0x00080000 */
#define RCC_APB1LLPENR_UART4LPEN      RCC_APB1LLPENR_UART4LPEN_Msk               /*!< UART4 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_UART5LPEN_Pos  (20U)
#define RCC_APB1LLPENR_UART5LPEN_Msk  (0x1UL << RCC_APB1LLPENR_UART5LPEN_Pos)    /*!< 0x00100000 */
#define RCC_APB1LLPENR_UART5LPEN      RCC_APB1LLPENR_UART5LPEN_Msk               /*!< UART5 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_I2C1LPEN_Pos   (21U)
#define RCC_APB1LLPENR_I2C1LPEN_Msk   (0x1UL << RCC_APB1LLPENR_I2C1LPEN_Pos)     /*!< 0x00200000 */
#define RCC_APB1LLPENR_I2C1LPEN       RCC_APB1LLPENR_I2C1LPEN_Msk                /*!< I2C1 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_I2C2LPEN_Pos   (22U)
#define RCC_APB1LLPENR_I2C2LPEN_Msk   (0x1UL << RCC_APB1LLPENR_I2C2LPEN_Pos)     /*!< 0x00400000 */
#define RCC_APB1LLPENR_I2C2LPEN       RCC_APB1LLPENR_I2C2LPEN_Msk                /*!< I2C2 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_I3C1LPEN_Pos   (23U)
#define RCC_APB1LLPENR_I3C1LPEN_Msk   (0x1UL << RCC_APB1LLPENR_I3C1LPEN_Pos)     /*!< 0x00800000 */
#define RCC_APB1LLPENR_I3C1LPEN       RCC_APB1LLPENR_I3C1LPEN_Msk                /*!< I3C1 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_CRSLPEN_Pos    (24U)
#define RCC_APB1LLPENR_CRSLPEN_Msk    (0x1UL << RCC_APB1LLPENR_CRSLPEN_Pos)      /*!< 0x01000000 */
#define RCC_APB1LLPENR_CRSLPEN        RCC_APB1LLPENR_CRSLPEN_Msk                 /*!< CRS clock enable during Sleep mode
                                                                                      */
/*!< USART6LPEN configuration */
#define RCC_APB1LLPENR_USART6LPEN_Pos (25U)
#define RCC_APB1LLPENR_USART6LPEN_Msk (0x1UL << RCC_APB1LLPENR_USART6LPEN_Pos)   /*!< 0x02000000 */
#define RCC_APB1LLPENR_USART6LPEN     RCC_APB1LLPENR_USART6LPEN_Msk              /*!< USART6LPEN (USART6 clock enable
                                                                                      during Sleep mode) */
/*!< UART7LPEN configuration */
#define RCC_APB1LLPENR_UART7LPEN_Pos  (30U)
#define RCC_APB1LLPENR_UART7LPEN_Msk  (0x1UL << RCC_APB1LLPENR_UART7LPEN_Pos)    /*!< 0x40000000 */
#define RCC_APB1LLPENR_UART7LPEN      RCC_APB1LLPENR_UART7LPEN_Msk               /*!< UART7LPEN (CRS clock enable
                                                                                      during Sleep mode) */

/* **********************************  Bit definition for RCC_APB1HLPENR register  ********************************** */
#define RCC_APB1HLPENR_Rst            (0x40000208UL)                             /*!< RCC_APB1HLPENR reset value */
#define RCC_APB1HLPENR_COMP12LPEN_Pos (3U)
#define RCC_APB1HLPENR_COMP12LPEN_Msk (0x1UL << RCC_APB1HLPENR_COMP12LPEN_Pos)   /*!< 0x00000008 */
#define RCC_APB1HLPENR_COMP12LPEN     RCC_APB1HLPENR_COMP12LPEN_Msk              /*!< COMP1 and COMP2 clock enable
                                                                                      during Sleep mode */
#define RCC_APB1HLPENR_FDCANLPEN_Pos  (9U)
#define RCC_APB1HLPENR_FDCANLPEN_Msk  (0x1UL << RCC_APB1HLPENR_FDCANLPEN_Pos)    /*!< 0x00000200 */
#define RCC_APB1HLPENR_FDCANLPEN      RCC_APB1HLPENR_FDCANLPEN_Msk               /*!< FDCAN1 clock enable during Sleep
                                                                                      mode */

/* **********************************  Bit definition for RCC_APB2LPENR register  *********************************** */
#define RCC_APB2LPENR_Rst             (0x01077800UL)                             /*!< RCC_APB2LPENR reset value */
#define RCC_APB2LPENR_TIM1LPEN_Pos    (11U)
#define RCC_APB2LPENR_TIM1LPEN_Msk    (0x1UL << RCC_APB2LPENR_TIM1LPEN_Pos)      /*!< 0x00000800 */
#define RCC_APB2LPENR_TIM1LPEN        RCC_APB2LPENR_TIM1LPEN_Msk                 /*!< TIM1 clock enable during Sleep
                                                                                      mode */
#define RCC_APB2LPENR_SPI1LPEN_Pos    (12U)
#define RCC_APB2LPENR_SPI1LPEN_Msk    (0x1UL << RCC_APB2LPENR_SPI1LPEN_Pos)      /*!< 0x00001000 */
#define RCC_APB2LPENR_SPI1LPEN        RCC_APB2LPENR_SPI1LPEN_Msk                 /*!< SPI1 clock enable during Sleep
                                                                                      mode */
#define RCC_APB2LPENR_TIM8LPEN_Pos    (13U)
#define RCC_APB2LPENR_TIM8LPEN_Msk    (0x1UL << RCC_APB2LPENR_TIM8LPEN_Pos)      /*!< 0x00002000 */
#define RCC_APB2LPENR_TIM8LPEN        RCC_APB2LPENR_TIM8LPEN_Msk                 /*!< TIM8 clock enable during Sleep
                                                                                      mode */
#define RCC_APB2LPENR_USART1LPEN_Pos  (14U)
#define RCC_APB2LPENR_USART1LPEN_Msk  (0x1UL << RCC_APB2LPENR_USART1LPEN_Pos)    /*!< 0x00004000 */
#define RCC_APB2LPENR_USART1LPEN      RCC_APB2LPENR_USART1LPEN_Msk               /*!< USART1 clock enable during Sleep
                                                                                      mode */
#define RCC_APB2LPENR_TIM15LPEN_Pos   (16U)
#define RCC_APB2LPENR_TIM15LPEN_Msk   (0x1UL << RCC_APB2LPENR_TIM15LPEN_Pos)     /*!< 0x00010000 */
#define RCC_APB2LPENR_TIM15LPEN       RCC_APB2LPENR_TIM15LPEN_Msk                /*!< TIM15 clock enable during Sleep
                                                                                      mode */
#define RCC_APB2LPENR_TIM16LPEN_Pos   (17U)
#define RCC_APB2LPENR_TIM16LPEN_Msk   (0x1UL << RCC_APB2LPENR_TIM16LPEN_Pos)     /*!< 0x00020000 */
#define RCC_APB2LPENR_TIM16LPEN       RCC_APB2LPENR_TIM16LPEN_Msk                /*!< TIM16 clock enable during Sleep
                                                                                      mode */
#define RCC_APB2LPENR_TIM17LPEN_Pos   (18U)
#define RCC_APB2LPENR_TIM17LPEN_Msk   (0x1UL << RCC_APB2LPENR_TIM17LPEN_Pos)     /*!< 0x00040000 */
#define RCC_APB2LPENR_TIM17LPEN       RCC_APB2LPENR_TIM17LPEN_Msk                /*!< TIM17 clock enable during Sleep
                                                                                      mode */
#define RCC_APB2LPENR_USBLPEN_Pos     (24U)
#define RCC_APB2LPENR_USBLPEN_Msk     (0x1UL << RCC_APB2LPENR_USBLPEN_Pos)       /*!< 0x01000000 */
#define RCC_APB2LPENR_USBLPEN         RCC_APB2LPENR_USBLPEN_Msk                  /*!< USBLPEN (USB clock enable during
                                                                                      Sleep mode) */

/* **********************************  Bit definition for RCC_APB3LPENR register  *********************************** */
#define RCC_APB3LPENR_Rst             (0x00200842UL)                             /*!< RCC_APB3LPENR reset value */
#define RCC_APB3LPENR_SBSLPEN_Pos     (1U)
#define RCC_APB3LPENR_SBSLPEN_Msk     (0x1UL << RCC_APB3LPENR_SBSLPEN_Pos)       /*!< 0x00000002 */
#define RCC_APB3LPENR_SBSLPEN         RCC_APB3LPENR_SBSLPEN_Msk                  /*!< SBS clock enable during Sleep mode
                                                                                      */
#define RCC_APB3LPENR_LPUART1LPEN_Pos (6U)
#define RCC_APB3LPENR_LPUART1LPEN_Msk (0x1UL << RCC_APB3LPENR_LPUART1LPEN_Pos)   /*!< 0x00000040 */
#define RCC_APB3LPENR_LPUART1LPEN     RCC_APB3LPENR_LPUART1LPEN_Msk              /*!< LPUART1 clock enable during Sleep
                                                                                      mode */
#define RCC_APB3LPENR_LPTIM1LPEN_Pos  (11U)
#define RCC_APB3LPENR_LPTIM1LPEN_Msk  (0x1UL << RCC_APB3LPENR_LPTIM1LPEN_Pos)    /*!< 0x00000800 */
#define RCC_APB3LPENR_LPTIM1LPEN      RCC_APB3LPENR_LPTIM1LPEN_Msk               /*!< LPTIM1LPEN (LPTIM1 clock enable
                                                                                      during Sleep mode) */
#define RCC_APB3LPENR_RTCAPBLPEN_Pos  (21U)
#define RCC_APB3LPENR_RTCAPBLPEN_Msk  (0x1UL << RCC_APB3LPENR_RTCAPBLPEN_Pos)    /*!< 0x00200000 */
#define RCC_APB3LPENR_RTCAPBLPEN      RCC_APB3LPENR_RTCAPBLPEN_Msk               /*!< RTC APB interface clock enable
                                                                                      during Sleep mode */

