MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* ************************************  Bit definition for RCC_CCIPR1 register  ************************************ */
#define RCC_CCIPR1_Rst                (0x00000000UL)                             /*!< RCC_CCIPR1 reset value */
#define RCC_CCIPR1_USART1SEL_Pos      (0U)
#define RCC_CCIPR1_USART1SEL_Msk      (0x3UL << RCC_CCIPR1_USART1SEL_Pos)        /*!< 0x00000003 */
#define RCC_CCIPR1_USART1SEL          RCC_CCIPR1_USART1SEL_Msk                   /*!< USART1 kernel clock source
                                                                                      selection */
#define RCC_CCIPR1_USART1SEL_0        (0x1UL << RCC_CCIPR1_USART1SEL_Pos)        /*!< 0x00000001 */
#define RCC_CCIPR1_USART1SEL_1        (0x2UL << RCC_CCIPR1_USART1SEL_Pos)        /*!< 0x00000002 */
#define RCC_CCIPR1_USART2SEL_Pos      (2U)
#define RCC_CCIPR1_USART2SEL_Msk      (0x3UL << RCC_CCIPR1_USART2SEL_Pos)        /*!< 0x0000000C */
#define RCC_CCIPR1_USART2SEL          RCC_CCIPR1_USART2SEL_Msk                   /*!< USART2 kernel clock source
                                                                                      selection */
#define RCC_CCIPR1_USART2SEL_0        (0x1UL << RCC_CCIPR1_USART2SEL_Pos)        /*!< 0x00000004 */
#define RCC_CCIPR1_USART2SEL_1        (0x2UL << RCC_CCIPR1_USART2SEL_Pos)        /*!< 0x00000008 */
#define RCC_CCIPR1_USART3SEL_Pos      (4U)
#define RCC_CCIPR1_USART3SEL_Msk      (0x3UL << RCC_CCIPR1_USART3SEL_Pos)        /*!< 0x00000030 */
#define RCC_CCIPR1_USART3SEL          RCC_CCIPR1_USART3SEL_Msk                   /*!< UART3 kernel clock source
                                                                                      selection */
#define RCC_CCIPR1_USART3SEL_0        (0x1UL << RCC_CCIPR1_USART3SEL_Pos)        /*!< 0x00000010 */
#define RCC_CCIPR1_USART3SEL_1        (0x2UL << RCC_CCIPR1_USART3SEL_Pos)        /*!< 0x00000020 */
#define RCC_CCIPR1_UART4SEL_Pos       (6U)
#define RCC_CCIPR1_UART4SEL_Msk       (0x3UL << RCC_CCIPR1_UART4SEL_Pos)         /*!< 0x000000C0 */
#define RCC_CCIPR1_UART4SEL           RCC_CCIPR1_UART4SEL_Msk                    /*!< UART4 kernel clock source
                                                                                      selection */
#define RCC_CCIPR1_UART4SEL_0         (0x1UL << RCC_CCIPR1_UART4SEL_Pos)         /*!< 0x00000040 */
#define RCC_CCIPR1_UART4SEL_1         (0x2UL << RCC_CCIPR1_UART4SEL_Pos)         /*!< 0x00000080 */
#define RCC_CCIPR1_UART5SEL_Pos       (8U)
#define RCC_CCIPR1_UART5SEL_Msk       (0x3UL << RCC_CCIPR1_UART5SEL_Pos)         /*!< 0x00000300 */
#define RCC_CCIPR1_UART5SEL           RCC_CCIPR1_UART5SEL_Msk                    /*!< UART5 kernel clock source
                                                                                      selection */
#define RCC_CCIPR1_UART5SEL_0         (0x1UL << RCC_CCIPR1_UART5SEL_Pos)         /*!< 0x00000100 */
#define RCC_CCIPR1_UART5SEL_1         (0x2UL << RCC_CCIPR1_UART5SEL_Pos)         /*!< 0x00000200 */
/*!< USART6SEL configuration */
#define RCC_CCIPR1_USART6SEL_Pos      (10U)
#define RCC_CCIPR1_USART6SEL_Msk      (0x3UL << RCC_CCIPR1_USART6SEL_Pos)        /*!< 0x00000C00 */
#define RCC_CCIPR1_USART6SEL          RCC_CCIPR1_USART6SEL_Msk                   /*!< USART6SEL[1:0] bits (USART6 kernel
                                                                                      clock source selection) */
#define RCC_CCIPR1_USART6SEL_0        (0x1UL << RCC_CCIPR1_USART6SEL_Pos)        /*!< 0x00000400 */
#define RCC_CCIPR1_USART6SEL_1        (0x2UL << RCC_CCIPR1_USART6SEL_Pos)        /*!< 0x00000800 */
/*!< UART7SEL configuration */
#define RCC_CCIPR1_UART7SEL_Pos       (12U)
#define RCC_CCIPR1_UART7SEL_Msk       (0x3UL << RCC_CCIPR1_UART7SEL_Pos)         /*!< 0x00003000 */
#define RCC_CCIPR1_UART7SEL           RCC_CCIPR1_UART7SEL_Msk                    /*!< UART7SEL[1:0] bits (UART7 kernel
                                                                                      clock source selection) */
#define RCC_CCIPR1_UART7SEL_0         (0x1UL << RCC_CCIPR1_UART7SEL_Pos)         /*!< 0x00001000 */
#define RCC_CCIPR1_UART7SEL_1         (0x2UL << RCC_CCIPR1_UART7SEL_Pos)         /*!< 0x00002000 */
#define RCC_CCIPR1_LPUART1SEL_Pos     (14U)
#define RCC_CCIPR1_LPUART1SEL_Msk     (0x3UL << RCC_CCIPR1_LPUART1SEL_Pos)       /*!< 0x0000C000 */
#define RCC_CCIPR1_LPUART1SEL         RCC_CCIPR1_LPUART1SEL_Msk                  /*!< LPUART1 kernel clock source
                                                                                      selection */
#define RCC_CCIPR1_LPUART1SEL_0       (0x1UL << RCC_CCIPR1_LPUART1SEL_Pos)       /*!< 0x00004000 */
#define RCC_CCIPR1_LPUART1SEL_1       (0x2UL << RCC_CCIPR1_LPUART1SEL_Pos)       /*!< 0x00008000 */
#define RCC_CCIPR1_SPI1SEL_Pos        (16U)
#define RCC_CCIPR1_SPI1SEL_Msk        (0x3UL << RCC_CCIPR1_SPI1SEL_Pos)          /*!< 0x00030000 */
#define RCC_CCIPR1_SPI1SEL            RCC_CCIPR1_SPI1SEL_Msk                     /*!< SPI1 kernel clock source selection
                                                                                      */
#define RCC_CCIPR1_SPI1SEL_0          (0x1UL << RCC_CCIPR1_SPI1SEL_Pos)          /*!< 0x00010000 */
#define RCC_CCIPR1_SPI1SEL_1          (0x2UL << RCC_CCIPR1_SPI1SEL_Pos)          /*!< 0x00020000 */
#define RCC_CCIPR1_SPI2SEL_Pos        (18U)
#define RCC_CCIPR1_SPI2SEL_Msk        (0x3UL << RCC_CCIPR1_SPI2SEL_Pos)          /*!< 0x000C0000 */
#define RCC_CCIPR1_SPI2SEL            RCC_CCIPR1_SPI2SEL_Msk                     /*!< SPI2 kernel clock source selection
                                                                                      */
#define RCC_CCIPR1_SPI2SEL_0          (0x1UL << RCC_CCIPR1_SPI2SEL_Pos)          /*!< 0x00040000 */
#define RCC_CCIPR1_SPI2SEL_1          (0x2UL << RCC_CCIPR1_SPI2SEL_Pos)          /*!< 0x00080000 */
#define RCC_CCIPR1_SPI3SEL_Pos        (20U)
#define RCC_CCIPR1_SPI3SEL_Msk        (0x3UL << RCC_CCIPR1_SPI3SEL_Pos)          /*!< 0x00300000 */
#define RCC_CCIPR1_SPI3SEL            RCC_CCIPR1_SPI3SEL_Msk                     /*!< SPI3 kernel clock source selection
                                                                                      */
#define RCC_CCIPR1_SPI3SEL_0          (0x1UL << RCC_CCIPR1_SPI3SEL_Pos)          /*!< 0x00100000 */
#define RCC_CCIPR1_SPI3SEL_1          (0x2UL << RCC_CCIPR1_SPI3SEL_Pos)          /*!< 0x00200000 */
#define RCC_CCIPR1_FDCANSEL_Pos       (26U)
#define RCC_CCIPR1_FDCANSEL_Msk       (0x3UL << RCC_CCIPR1_FDCANSEL_Pos)         /*!< 0x0C000000 */
#define RCC_CCIPR1_FDCANSEL           RCC_CCIPR1_FDCANSEL_Msk                    /*!< FDCAN1 kernel clock source
                                                                                      selection */
#define RCC_CCIPR1_FDCANSEL_0         (0x1UL << RCC_CCIPR1_FDCANSEL_Pos)         /*!< 0x04000000 */
#define RCC_CCIPR1_FDCANSEL_1         (0x2UL << RCC_CCIPR1_FDCANSEL_Pos)         /*!< 0x08000000 */

