MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/* ************************************  Bit definition for RNG_HTSR0 register  ************************************* */
#define RNG_HTSR0_RPERRX_Pos   (0U)
#define RNG_HTSR0_RPERRX_Msk   (0x1UL << RNG_HTSR0_RPERRX_Pos)     /*!< 0x00000001 */
#define RNG_HTSR0_RPERRX       RNG_HTSR0_RPERRX_Msk                /*!< Repetitive error after the XOR */
#define RNG_HTSR0_RPERR1_Pos   (1U)
#define RNG_HTSR0_RPERR1_Msk   (0x1UL << RNG_HTSR0_RPERR1_Pos)     /*!< 0x00000002 */
#define RNG_HTSR0_RPERR1       RNG_HTSR0_RPERR1_Msk                /*!< Repetitive error for oscillator i */
#define RNG_HTSR0_RPERR2_Pos   (2U)
#define RNG_HTSR0_RPERR2_Msk   (0x1UL << RNG_HTSR0_RPERR2_Pos)     /*!< 0x00000004 */
#define RNG_HTSR0_RPERR2       RNG_HTSR0_RPERR2_Msk                /*!< Repetitive error for oscillator i */
#define RNG_HTSR0_RPERR3_Pos   (3U)
#define RNG_HTSR0_RPERR3_Msk   (0x1UL << RNG_HTSR0_RPERR3_Pos)     /*!< 0x00000008 */
#define RNG_HTSR0_RPERR3       RNG_HTSR0_RPERR3_Msk                /*!< Repetitive error for oscillator i */
#define RNG_HTSR0_RPERR4_Pos   (4U)
#define RNG_HTSR0_RPERR4_Msk   (0x1UL << RNG_HTSR0_RPERR4_Pos)     /*!< 0x00000010 */
#define RNG_HTSR0_RPERR4       RNG_HTSR0_RPERR4_Msk                /*!< Repetitive error for oscillator i */
#define RNG_HTSR0_RPERR5_Pos   (5U)
#define RNG_HTSR0_RPERR5_Msk   (0x1UL << RNG_HTSR0_RPERR5_Pos)     /*!< 0x00000020 */
#define RNG_HTSR0_RPERR5       RNG_HTSR0_RPERR5_Msk                /*!< Repetitive error for oscillator i */
#define RNG_HTSR0_RPERR6_Pos   (6U)
#define RNG_HTSR0_RPERR6_Msk   (0x1UL << RNG_HTSR0_RPERR6_Pos)     /*!< 0x00000040 */
#define RNG_HTSR0_RPERR6       RNG_HTSR0_RPERR6_Msk                /*!< Repetitive error for oscillator i */
#define RNG_HTSR0_RPERR7_Pos   (7U)
#define RNG_HTSR0_RPERR7_Msk   (0x1UL << RNG_HTSR0_RPERR7_Pos)     /*!< 0x00000080 */
#define RNG_HTSR0_RPERR7       RNG_HTSR0_RPERR7_Msk                /*!< Repetitive error for oscillator i */
#define RNG_HTSR0_RPERR8_Pos   (8U)
#define RNG_HTSR0_RPERR8_Msk   (0x1UL << RNG_HTSR0_RPERR8_Pos)     /*!< 0x00000100 */
#define RNG_HTSR0_RPERR8       RNG_HTSR0_RPERR8_Msk                /*!< Repetitive error for oscillator i */
#define RNG_HTSR0_RPERR9_Pos   (9U)
#define RNG_HTSR0_RPERR9_Msk   (0x1UL << RNG_HTSR0_RPERR9_Pos)     /*!< 0x00000200 */
#define RNG_HTSR0_RPERR9       RNG_HTSR0_RPERR9_Msk                /*!< Repetitive error for oscillator i */

/* ************************************  Bit definition for RNG_HTSR1 register  ************************************* */
#define RNG_HTSR1_ADERRX_Pos   (0U)
#define RNG_HTSR1_ADERRX_Msk   (0x1UL << RNG_HTSR1_ADERRX_Pos)     /*!< 0x00000001 */
#define RNG_HTSR1_ADERRX       RNG_HTSR1_ADERRX_Msk                /*!< Adaptative error after the XOR */
#define RNG_HTSR1_ADERR1_Pos   (1U)
#define RNG_HTSR1_ADERR1_Msk   (0x1UL << RNG_HTSR1_ADERR1_Pos)     /*!< 0x00000002 */
#define RNG_HTSR1_ADERR1       RNG_HTSR1_ADERR1_Msk                /*!< Adaptative error for oscillator i */
#define RNG_HTSR1_ADERR2_Pos   (2U)
#define RNG_HTSR1_ADERR2_Msk   (0x1UL << RNG_HTSR1_ADERR2_Pos)     /*!< 0x00000004 */
#define RNG_HTSR1_ADERR2       RNG_HTSR1_ADERR2_Msk                /*!< Adaptative error for oscillator i */
#define RNG_HTSR1_ADERR3_Pos   (3U)
#define RNG_HTSR1_ADERR3_Msk   (0x1UL << RNG_HTSR1_ADERR3_Pos)     /*!< 0x00000008 */
#define RNG_HTSR1_ADERR3       RNG_HTSR1_ADERR3_Msk                /*!< Adaptative error for oscillator i */
#define RNG_HTSR1_ADERR4_Pos   (4U)
#define RNG_HTSR1_ADERR4_Msk   (0x1UL << RNG_HTSR1_ADERR4_Pos)     /*!< 0x00000010 */
#define RNG_HTSR1_ADERR4       RNG_HTSR1_ADERR4_Msk                /*!< Adaptative error for oscillator i */
#define RNG_HTSR1_ADERR5_Pos   (5U)
#define RNG_HTSR1_ADERR5_Msk   (0x1UL << RNG_HTSR1_ADERR5_Pos)     /*!< 0x00000020 */
#define RNG_HTSR1_ADERR5       RNG_HTSR1_ADERR5_Msk                /*!< Adaptative error for oscillator i */
#define RNG_HTSR1_ADERR6_Pos   (6U)
#define RNG_HTSR1_ADERR6_Msk   (0x1UL << RNG_HTSR1_ADERR6_Pos)     /*!< 0x00000040 */
#define RNG_HTSR1_ADERR6       RNG_HTSR1_ADERR6_Msk                /*!< Adaptative error for oscillator i */
#define RNG_HTSR1_ADERR7_Pos   (7U)
#define RNG_HTSR1_ADERR7_Msk   (0x1UL << RNG_HTSR1_ADERR7_Pos)     /*!< 0x00000080 */
#define RNG_HTSR1_ADERR7       RNG_HTSR1_ADERR7_Msk                /*!< Adaptative error for oscillator i */
#define RNG_HTSR1_ADERR8_Pos   (8U)
#define RNG_HTSR1_ADERR8_Msk   (0x1UL << RNG_HTSR1_ADERR8_Pos)     /*!< 0x00000100 */
#define RNG_HTSR1_ADERR8       RNG_HTSR1_ADERR8_Msk                /*!< Adaptative error for oscillator i */
#define RNG_HTSR1_ADERR9_Pos   (9U)
#define RNG_HTSR1_ADERR9_Msk   (0x1UL << RNG_HTSR1_ADERR9_Pos)     /*!< 0x00000200 */
#define RNG_HTSR1_ADERR9       RNG_HTSR1_ADERR9_Msk                /*!< Adaptative error for oscillator i */

/* *************************************  Bit definition for RNG_NSMR register  ************************************* */
#define RNG_NSMR_MOSC1_Pos     (0U)
#define RNG_NSMR_MOSC1_Msk     (0x1UL << RNG_NSMR_MOSC1_Pos)       /*!< 0x00000001 */
#define RNG_NSMR_MOSC1         RNG_NSMR_MOSC1_Msk                  /*!< Mask oscillator i */
#define RNG_NSMR_MOSC2_Pos     (1U)
#define RNG_NSMR_MOSC2_Msk     (0x1UL << RNG_NSMR_MOSC2_Pos)       /*!< 0x00000002 */
#define RNG_NSMR_MOSC2         RNG_NSMR_MOSC2_Msk                  /*!< Mask oscillator i */
#define RNG_NSMR_MOSC3_Pos     (2U)
#define RNG_NSMR_MOSC3_Msk     (0x1UL << RNG_NSMR_MOSC3_Pos)       /*!< 0x00000004 */
#define RNG_NSMR_MOSC3         RNG_NSMR_MOSC3_Msk                  /*!< Mask oscillator i */
#define RNG_NSMR_MOSC4_Pos     (3U)
#define RNG_NSMR_MOSC4_Msk     (0x1UL << RNG_NSMR_MOSC4_Pos)       /*!< 0x00000008 */
#define RNG_NSMR_MOSC4         RNG_NSMR_MOSC4_Msk                  /*!< Mask oscillator i */
#define RNG_NSMR_MOSC5_Pos     (4U)
#define RNG_NSMR_MOSC5_Msk     (0x1UL << RNG_NSMR_MOSC5_Pos)       /*!< 0x00000010 */
#define RNG_NSMR_MOSC5         RNG_NSMR_MOSC5_Msk                  /*!< Mask oscillator i */
#define RNG_NSMR_MOSC6_Pos     (5U)
#define RNG_NSMR_MOSC6_Msk     (0x1UL << RNG_NSMR_MOSC6_Pos)       /*!< 0x00000020 */
#define RNG_NSMR_MOSC6         RNG_NSMR_MOSC6_Msk                  /*!< Mask oscillator i */
#define RNG_NSMR_MOSC7_Pos     (6U)
#define RNG_NSMR_MOSC7_Msk     (0x1UL << RNG_NSMR_MOSC7_Pos)       /*!< 0x00000040 */
#define RNG_NSMR_MOSC7         RNG_NSMR_MOSC7_Msk                  /*!< Mask oscillator i */
#define RNG_NSMR_MOSC8_Pos     (7U)
#define RNG_NSMR_MOSC8_Msk     (0x1UL << RNG_NSMR_MOSC8_Pos)       /*!< 0x00000080 */
#define RNG_NSMR_MOSC8         RNG_NSMR_MOSC8_Msk                  /*!< Mask oscillator i */
#define RNG_NSMR_MOSC9_Pos     (8U)
#define RNG_NSMR_MOSC9_Msk     (0x1UL << RNG_NSMR_MOSC9_Pos)       /*!< 0x00000100 */
#define RNG_NSMR_MOSC9         RNG_NSMR_MOSC9_Msk                  /*!< Mask oscillator i */

/******************************************************************************/
/*                                                                            */
/*                           Real-Time Clock (RTC)                            */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RTC_TR register  *******************/
#define RTC_TR_SU_Pos                       (0U)
#define RTC_TR_SU_Msk                       (0xFUL << RTC_TR_SU_Pos)                /*!< 0x0000000F */
#define RTC_TR_SU                           RTC_TR_SU_Msk                           /*!< Second units in BCD format */
#define RTC_TR_SU_0                         (0x1UL << RTC_TR_SU_Pos)                /*!< 0x00000001 */
#define RTC_TR_SU_1                         (0x2UL << RTC_TR_SU_Pos)                /*!< 0x00000002 */
#define RTC_TR_SU_2                         (0x4UL << RTC_TR_SU_Pos)                /*!< 0x00000004 */
#define RTC_TR_SU_3                         (0x8UL << RTC_TR_SU_Pos)                /*!< 0x00000008 */
#define RTC_TR_ST_Pos                       (4U)
#define RTC_TR_ST_Msk                       (0x7UL << RTC_TR_ST_Pos)                /*!< 0x00000070 */
#define RTC_TR_ST                           RTC_TR_ST_Msk                           /*!< Second tens in BCD format */
#define RTC_TR_ST_0                         (0x1UL << RTC_TR_ST_Pos)                /*!< 0x00000010 */
#define RTC_TR_ST_1                         (0x2UL << RTC_TR_ST_Pos)                /*!< 0x00000020 */
#define RTC_TR_ST_2                         (0x4UL << RTC_TR_ST_Pos)                /*!< 0x00000040 */
#define RTC_TR_MNU_Pos                      (8U)
#define RTC_TR_MNU_Msk                      (0xFUL << RTC_TR_MNU_Pos)               /*!< 0x00000F00 */
#define RTC_TR_MNU                          RTC_TR_MNU_Msk                          /*!< Minute units in BCD format */
#define RTC_TR_MNU_0                        (0x1UL << RTC_TR_MNU_Pos)               /*!< 0x00000100 */
#define RTC_TR_MNU_1                        (0x2UL << RTC_TR_MNU_Pos)               /*!< 0x00000200 */
#define RTC_TR_MNU_2                        (0x4UL << RTC_TR_MNU_Pos)               /*!< 0x00000400 */
#define RTC_TR_MNU_3                        (0x8UL << RTC_TR_MNU_Pos)               /*!< 0x00000800 */
#define RTC_TR_MNT_Pos                      (12U)
#define RTC_TR_MNT_Msk                      (0x7UL << RTC_TR_MNT_Pos)               /*!< 0x00007000 */
#define RTC_TR_MNT                          RTC_TR_MNT_Msk                          /*!< Minute tens in BCD format */
#define RTC_TR_MNT_0                        (0x1UL << RTC_TR_MNT_Pos)               /*!< 0x00001000 */
#define RTC_TR_MNT_1                        (0x2UL << RTC_TR_MNT_Pos)               /*!< 0x00002000 */
#define RTC_TR_MNT_2                        (0x4UL << RTC_TR_MNT_Pos)               /*!< 0x00004000 */
#define RTC_TR_HU_Pos                       (16U)
#define RTC_TR_HU_Msk                       (0xFUL << RTC_TR_HU_Pos)                /*!< 0x000F0000 */
#define RTC_TR_HU                           RTC_TR_HU_Msk                           /*!< Hour units in BCD format */
#define RTC_TR_HU_0                         (0x1UL << RTC_TR_HU_Pos)                /*!< 0x00010000 */
#define RTC_TR_HU_1                         (0x2UL << RTC_TR_HU_Pos)                /*!< 0x00020000 */
#define RTC_TR_HU_2                         (0x4UL << RTC_TR_HU_Pos)                /*!< 0x00040000 */
#define RTC_TR_HU_3                         (0x8UL << RTC_TR_HU_Pos)                /*!< 0x00080000 */
#define RTC_TR_HT_Pos                       (20U)
#define RTC_TR_HT_Msk                       (0x3UL << RTC_TR_HT_Pos)                /*!< 0x00300000 */
#define RTC_TR_HT                           RTC_TR_HT_Msk                           /*!< Hour tens in BCD format */
#define RTC_TR_HT_0                         (0x1UL << RTC_TR_HT_Pos)                /*!< 0x00100000 */
#define RTC_TR_HT_1                         (0x2UL << RTC_TR_HT_Pos)                /*!< 0x00200000 */
#define RTC_TR_PM_Pos                       (22U)
#define RTC_TR_PM_Msk                       (0x1UL << RTC_TR_PM_Pos)                /*!< 0x00400000 */
#define RTC_TR_PM                           RTC_TR_PM_Msk                           /*!< AM/PM notation */

