MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/*******************  Bit definition for WWDG_CFR register  *******************/
#define WWDG_CFR_W_Pos                      (0U)
#define WWDG_CFR_W_Msk                      (0x7FUL << WWDG_CFR_W_Pos)              /*!< 0x0000007F */
#define WWDG_CFR_W                          WWDG_CFR_W_Msk                          /*!<W[6:0] bits (7-bit window value) */
#define WWDG_CFR_W_0                        (0x01UL << WWDG_CFR_W_Pos)              /*!< 0x00000001 */
#define WWDG_CFR_W_1                        (0x02UL << WWDG_CFR_W_Pos)              /*!< 0x00000002 */
#define WWDG_CFR_W_2                        (0x04UL << WWDG_CFR_W_Pos)              /*!< 0x00000004 */
#define WWDG_CFR_W_3                        (0x08UL << WWDG_CFR_W_Pos)              /*!< 0x00000008 */
#define WWDG_CFR_W_4                        (0x10UL << WWDG_CFR_W_Pos)              /*!< 0x00000010 */
#define WWDG_CFR_W_5                        (0x20UL << WWDG_CFR_W_Pos)              /*!< 0x00000020 */
#define WWDG_CFR_W_6                        (0x40UL << WWDG_CFR_W_Pos)              /*!< 0x00000040 */
#define WWDG_CFR_WDGTB_Pos                  (11U)
#define WWDG_CFR_WDGTB_Msk                  (0x7UL << WWDG_CFR_WDGTB_Pos)           /*!< 0x00003800 */
#define WWDG_CFR_WDGTB                      WWDG_CFR_WDGTB_Msk                      /*!<WDGTB[2:0] bits (Timer Base) */
#define WWDG_CFR_WDGTB_0                    (0x1UL << WWDG_CFR_WDGTB_Pos)           /*!< 0x00000800 */
#define WWDG_CFR_WDGTB_1                    (0x2UL << WWDG_CFR_WDGTB_Pos)           /*!< 0x00001000 */
#define WWDG_CFR_WDGTB_2                    (0x4UL << WWDG_CFR_WDGTB_Pos)           /*!< 0x00002000 */
#define WWDG_CFR_EWI_Pos                    (9U)
#define WWDG_CFR_EWI_Msk                    (0x1UL << WWDG_CFR_EWI_Pos)             /*!< 0x00000200 */
#define WWDG_CFR_EWI                        WWDG_CFR_EWI_Msk                        /*!<Early Wakeup Interrupt */

/*******************  Bit definition for WWDG_SR register  ********************/
#define WWDG_SR_EWIF_Pos                    (0U)
#define WWDG_SR_EWIF_Msk                    (0x1UL << WWDG_SR_EWIF_Pos)             /*!< 0x00000001 */
#define WWDG_SR_EWIF                        WWDG_SR_EWIF_Msk                        /*!<Early Wakeup Interrupt Flag */

/* ****************************************************************************************************************** */
/*                                                                                                                    */
/*                                           Extended-SPI interface (XSPI)                                            */
/*                                                                                                                    */
/* ****************************************************************************************************************** */
/* *************************************  Bit definition for XSPI_CR register  ************************************** */
#define XSPI_CR_EN_Pos            (0U)
#define XSPI_CR_EN_Msk            (0x1UL << XSPI_CR_EN_Pos)              /*!< 0x00000001 */
#define XSPI_CR_EN                XSPI_CR_EN_Msk                         /*!< Enable */
#define XSPI_CR_ABORT_Pos         (1U)
#define XSPI_CR_ABORT_Msk         (0x1UL << XSPI_CR_ABORT_Pos)           /*!< 0x00000002 */
#define XSPI_CR_ABORT             XSPI_CR_ABORT_Msk                      /*!< Abort request */
#define XSPI_CR_DMAEN_Pos         (2U)
#define XSPI_CR_DMAEN_Msk         (0x1UL << XSPI_CR_DMAEN_Pos)           /*!< 0x00000004 */
#define XSPI_CR_DMAEN             XSPI_CR_DMAEN_Msk                      /*!< DMA enable */
#define XSPI_CR_TCEN_Pos          (3U)
#define XSPI_CR_TCEN_Msk          (0x1UL << XSPI_CR_TCEN_Pos)            /*!< 0x00000008 */
#define XSPI_CR_TCEN              XSPI_CR_TCEN_Msk                       /*!< Timeout counter enable */
#define XSPI_CR_DMM_Pos           (6U)
#define XSPI_CR_DMM_Msk           (0x1UL << XSPI_CR_DMM_Pos)             /*!< 0x00000040 */
#define XSPI_CR_DMM               XSPI_CR_DMM_Msk                        /*!< Dual-memory configuration */
#define XSPI_CR_FTHRES_Pos        (8U)
#define XSPI_CR_FTHRES_Msk        (0x1FUL << XSPI_CR_FTHRES_Pos)         /*!< 0x00001F00 */
#define XSPI_CR_FTHRES            XSPI_CR_FTHRES_Msk                     /*!< FIFO threshold level */
#define XSPI_CR_TEIE_Pos          (16U)
#define XSPI_CR_TEIE_Msk          (0x1UL << XSPI_CR_TEIE_Pos)            /*!< 0x00010000 */
#define XSPI_CR_TEIE              XSPI_CR_TEIE_Msk                       /*!< Transfer error interrupt enable */
#define XSPI_CR_TCIE_Pos          (17U)
#define XSPI_CR_TCIE_Msk          (0x1UL << XSPI_CR_TCIE_Pos)            /*!< 0x00020000 */
#define XSPI_CR_TCIE              XSPI_CR_TCIE_Msk                       /*!< Transfer complete interrupt enable */
#define XSPI_CR_FTIE_Pos          (18U)
#define XSPI_CR_FTIE_Msk          (0x1UL << XSPI_CR_FTIE_Pos)            /*!< 0x00040000 */
#define XSPI_CR_FTIE              XSPI_CR_FTIE_Msk                       /*!< FIFO threshold interrupt enable */
#define XSPI_CR_SMIE_Pos          (19U)
#define XSPI_CR_SMIE_Msk          (0x1UL << XSPI_CR_SMIE_Pos)            /*!< 0x00080000 */
#define XSPI_CR_SMIE              XSPI_CR_SMIE_Msk                       /*!< Status-match interrupt enable */
#define XSPI_CR_TOIE_Pos          (20U)
#define XSPI_CR_TOIE_Msk          (0x1UL << XSPI_CR_TOIE_Pos)            /*!< 0x00100000 */
#define XSPI_CR_TOIE              XSPI_CR_TOIE_Msk                       /*!< Timeout interrupt enable */
#define XSPI_CR_APMS_Pos          (22U)
#define XSPI_CR_APMS_Msk          (0x1UL << XSPI_CR_APMS_Pos)            /*!< 0x00400000 */
#define XSPI_CR_APMS              XSPI_CR_APMS_Msk                       /*!< Automatic status-polling mode stop */
#define XSPI_CR_PMM_Pos           (23U)
#define XSPI_CR_PMM_Msk           (0x1UL << XSPI_CR_PMM_Pos)             /*!< 0x00800000 */
#define XSPI_CR_PMM               XSPI_CR_PMM_Msk                        /*!< Polling match mode */
#define XSPI_CR_CSSEL_Pos         (24U)
#define XSPI_CR_CSSEL_Msk         (0x1UL << XSPI_CR_CSSEL_Pos)           /*!< 0x01000000 */
#define XSPI_CR_CSSEL             XSPI_CR_CSSEL_Msk                      /*!< Chip-select selection */
#define XSPI_CR_NOPREF_Pos        (25U)
#define XSPI_CR_NOPREF_Msk        (0x1UL << XSPI_CR_NOPREF_Pos)          /*!< 0x02000000 */
#define XSPI_CR_NOPREF            XSPI_CR_NOPREF_Msk                     /*!< No prefetch data */
#define XSPI_CR_FMODE_Pos         (28U)
#define XSPI_CR_FMODE_Msk         (0x3UL << XSPI_CR_FMODE_Pos)           /*!< 0x30000000 */
#define XSPI_CR_FMODE             XSPI_CR_FMODE_Msk                      /*!< Functional mode */
#define XSPI_CR_FMODE_0           (0x1UL << XSPI_CR_FMODE_Pos)           /*!< 0x10000000 */
#define XSPI_CR_FMODE_1           (0x2UL << XSPI_CR_FMODE_Pos)           /*!< 0x20000000 */
#define XSPI_CR_MSEL_Pos          (30U)
#define XSPI_CR_MSEL_Msk          (0x1UL << XSPI_CR_MSEL_Pos)            /*!< 0x40000000 */
#define XSPI_CR_MSEL              XSPI_CR_MSEL_Msk                       /*!< External memory select */

