MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c5a3xx.h
/****************** UART Instances : Hardware Flow control ********************/
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                           ((INSTANCE) == USART2)  || \
                                           ((INSTANCE) == USART3)  || \
                                           ((INSTANCE) == UART4)   || \
                                           ((INSTANCE) == UART5)   || \
                                           ((INSTANCE) == USART6)  || \
                                           ((INSTANCE) == UART7)   || \
                                           ((INSTANCE) == LPUART1))

/* **************************************  UART Instances : Receiver timeout **************************************** */
#define IS_UART_RECEIVER_TIMEOUT_INSTANCE(INSTANCE)   (((INSTANCE) == USART1)  || \
                                                       ((INSTANCE) == USART2)  || \
                                                       ((INSTANCE) == USART3)  || \
                                                       ((INSTANCE) == UART4)   || \
                                                       ((INSTANCE) == UART5)   || \
                                                       ((INSTANCE) == USART6)  || \
                                                       ((INSTANCE) == UART7))

/******************** UART Instances : LIN mode **********************/
#define IS_UART_LIN_INSTANCE(INSTANCE)   (((INSTANCE) == USART1)  || \
                                          ((INSTANCE) == USART2)  || \
                                          ((INSTANCE) == USART3)  || \
                                          ((INSTANCE) == UART4)   || \
                                          ((INSTANCE) == UART5)   || \
                                          ((INSTANCE) == USART6)  || \
                                          ((INSTANCE) == UART7))

/******************** UART Instances : Wake-up from Stop mode **********************/
#define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE)   (((INSTANCE) == USART1)  || \
                                                      ((INSTANCE) == USART2)  || \
                                                      ((INSTANCE) == USART3)  || \
                                                      ((INSTANCE) == UART4)   || \
                                                      ((INSTANCE) == UART5)   || \
                                                      ((INSTANCE) == USART6)  || \
                                                      ((INSTANCE) == UART7)   || \
                                                      ((INSTANCE) == LPUART1))

/*********************** UART Instances : IRDA mode ***************************/
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                    ((INSTANCE) == USART2)  || \
                                    ((INSTANCE) == USART3)  || \
                                    ((INSTANCE) == UART4)   || \
                                    ((INSTANCE) == UART5)   || \
                                    ((INSTANCE) == USART6)  || \
                                    ((INSTANCE) == UART7))

/********************* USART Instances : Smard card mode ***********************/
#define IS_SMARTCARD_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                         ((INSTANCE) == USART2)  || \
                                         ((INSTANCE) == USART3)  || \
                                         ((INSTANCE) == USART6))

/******************************* USB DRD FS HCD Instances *********************/
#define IS_HCD_ALL_INSTANCE(INSTANCE) ((INSTANCE) == USB_DRD_FS)

/******************************* USB DRD FS PCD Instances *********************/
#define IS_PCD_ALL_INSTANCE(INSTANCE) ((INSTANCE) == USB_DRD_FS)

/* ************************************************** XSPI Instances ************************************************ */
#define IS_XSPI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == XSPI1))

#define IS_XSPI_HSPI_INSTANCE(INSTANCE) ((INSTANCE) == (XSPI_TypeDef *) 0xDEADDEADUL)

#define IS_XSPI_HSIC_INSTANCE(INSTANCE) ((INSTANCE) == (XSPI_TypeDef *) 0xDEADDEADUL)

#define IS_XSPI_IO_MANAGER_INSTANCE(INSTANCE) ((INSTANCE) == (XSPI_TypeDef *) 0xDEADDEADUL)

#define IS_XSPI_FULL_FIFO_SIZE(INSTANCE) ((INSTANCE) == (XSPI_TypeDef *) 0xDEADDEADUL)

/* ******************************************** XSPI Delay Block Instances ****************************************** */
#define IS_XSPI_DLYB_INSTANCE(INSTANCE) (((INSTANCE) == XSPI1))

/** @} */ /* End of group STM32C5xx_Peripheral_Exported_macros */

/** @} */ /* End of group STM32C5A3xx */

/** @} */ /* End of group ST */

#ifdef __cplusplus
}
#endif

#endif  /* STM32C5A3xx_H */
